{
  "search_query": "Museum of Ventura County Ventura museum",
  "found": true,
  "page_title": "Jesse Ventura",
  "page_url": "https://en.wikipedia.org/wiki/Jesse_Ventura",
  "extract": "Jesse Ventura (born James George Janos; July 15, 1951) is an American Navy SEAL and Vietnam war veteran, politician, political commentator, actor, media personality, and retired professional wrestler. After achieving fame in the World Wrestling Federation, he served as the 38th governor of Minnesota from 1999 to 2003. He was elected governor with the Reform Party and is the party's only candidate to win a major government office. Born in Minneapolis, Ventura was a member of the Navy Special Operations Underwater Demolition/SEAL Teams during the Vietnam War. After leaving the military, he embarked on a professional wrestling career as a heel from 1975 to 1986, taking the ring name \"Jesse 'the Body' Ventura.\" He had a lengthy tenure in the WWF/WWE as a performer and color commentator and was inducted into the WWE Hall of Fame class of 2004. In addition to wrestling, Ventura pursued an acting career, appearing in films such as Predator and The Running Man. Ventura entered politics in 1991 when he was elected mayor of Brooklyn Park, Minnesota, a position he held until 1995. He was the Reform Party candidate in the 1998 Minnesota gubernatorial election, running a low-budget campaign centered on grassroots events and unusual advertising that urged citizens not to \"vote for politics as usual\". Initially ignored as a novelty candidate, Ventura defeated both the Democratic and the Republican nominee in a major upset. Amid internal fights for control over the party, Ventura left the Reform Party a year after taking office and served the remainder of his term as a member of the Independence Party of Minnesota. Since holding public office, Ventura has referred to himself as a \"statesman\" instead of a politician. As governor, Ventura oversaw reforms of Minnesota's property tax as well as the state's first sales tax rebate. Other initiatives he took included construction of the METRO Blue Line light rail in the Minneapolis–Saint Paul metropolitan area and income tax cuts. Ventura...",
  "error": null,
  "fetched_at": "2026-01-24T20:23:26Z"
}
