{
  "search_query": "Eli and Edythe Broad Art Museum at Michigan State East Lansing museum",
  "found": true,
  "page_title": "Eli and Edythe Broad Art Museum",
  "page_url": "https://en.wikipedia.org/wiki/Eli_and_Edythe_Broad_Art_Museum",
  "extract": "The Eli and Edythe Broad Art Museum (MSU Broad or BAM) is a nonprofit, contemporary art museum designed by Zaha Hadid located on the campus of Michigan State University in East Lansing, Michigan, United States. It opened on November 10, 2012. The rotating exhibition schedule allows for frequent new shows to be on view. The museum's curatorial focus is a global focus on emerging to mid-career artists. Exhibitions consist largely of contemporary artists, including those achieving their Master of Fine Arts degree at Michigan State University, as well as shows of selected works from the collection. The MSU Broad organizes a few hundred programs for various ages, open to all at no charge. Admission to the galleries and all community events and programs is free for all visitors, with only certain special exhibitions charging admissions fees. The museum is named for Eli and Edythe Broad, whose initial leading gift of $26 million to establish the MSU Broad was announced in June 2007. The museum's permanent collection of over 10,000 pieces includes more than 7,500 inherited from the Kresge Art Museum, MSU's former art museum, when it closed, representing a wide array of artistic production from the ancient to the present, across the world, in a variety of media. Significant holdings include Ancient Greek and Roman antiquities; pre-Columbian sculptures and vessels; Medieval and Renaissance illuminations; Old Master paintings; 19th-century American paintings; 20th-century sculpture by artists such as Alexander Calder and Jenny Holzer; and works by contemporary artists such as Chuck Close and Ann Hamilton. A selection of works from the permanent collection, rotating three times a year, is on display in the museum's Center for Object Research and Engagement (The CORE), which opened in November 2023. Current emphasis in collection growth and new acquisitions is on \"the art of our time,\" incorporating \"ongoing efforts to rewrite [...] collecting practices and priorities to focus p...",
  "error": null,
  "fetched_at": "2026-01-24T20:31:34Z"
}
