{
  "search_query": "Musee d’art contemporain des Laurentides QC museum",
  "found": true,
  "page_title": "Quebec",
  "page_url": "https://en.wikipedia.org/wiki/Quebec",
  "extract": "Quebec (French: Québec) is Canada's largest province by area. Located in Central Canada, it is the only Francophone-majority province in the country, being home to Québécois French. It shares borders with the provinces of Ontario to the west, Newfoundland and Labrador to the northeast, New Brunswick to the southeast and a coastal border with the territory of Nunavut. In the south, it shares a border with the United States. Quebec has a population of around 8 million, making it Canada's second-most populous province only behind Ontario. Between 1534 and 1763, what is now Quebec was the French colony of Canada and was the most developed colony in New France. Following the Seven Years' War, Canada became a British colony, first as the Province of Quebec (1763–1791), then Lower Canada (1791–1841), and lastly part of the Province of Canada (1841–1867) as a result of the Lower Canada Rebellion. It was confederated with Ontario, Nova Scotia, and New Brunswick in 1867. Until the early 1960s, the Catholic Church played a large role in the social and cultural institutions in Quebec. However, the Quiet Revolution of the 1960s to 1980s increased the role of the Government of Quebec in l'État québécois (the public authority of Quebec). The Government of Quebec functions within the context of a Westminster system and is both a liberal democracy and a constitutional monarchy. The Premier of Quebec acts as head of government. Independence debates have played a large role in Quebec politics. Quebec society's cohesion and specificity is based on three of its unique statutory documents: the Quebec Charter of Human Rights and Freedoms, the Charter of the French Language, and the Civil Code of Quebec. Furthermore, unlike elsewhere in Canada, law in Quebec is mixed: private law is exercised under a civil-law system, while public law is exercised under a common-law system. The economy of Quebec is mainly supported by its large service sector and varied industrial sector. For exports, it l...",
  "error": null,
  "fetched_at": "2026-01-24T20:41:56Z"
}
