{
  "search_query": "Dallas Museum of Art Dallas museum",
  "found": true,
  "page_title": "Dallas",
  "page_url": "https://en.wikipedia.org/wiki/Dallas",
  "extract": "Dallas is a city in the U.S. state of Texas. Located in the state's northern region, it is the ninth-most populous city in the United States and third-most populous city in Texas, with a population of 1.3 million at the 2020 census. Along with the city of Fort Worth, Dallas anchors the Dallas–Fort Worth metroplex, the fourth-most populous metropolitan area in the U.S. and the most populous metropolitan area in Texas, at 8.5 million people. Dallas is a core city of the largest metropolitan area in the Southern U.S. and the largest inland metropolitan area in the U.S. that lacks any navigable link to the sea. It is the seat of Dallas County, covering nearly 386 square miles (1,000 km2) and extending into Collin, Denton, Kaufman, and Rockwall counties. Both Dallas and nearby Fort Worth were initially developed as a product of the construction of major railroad lines through the area allowing access to cotton, cattle, and later oil in North and East Texas. The construction of the Interstate Highway System reinforced Dallas's prominence as a transportation hub, with four major interstate highways converging in the city and a fifth interstate loop around it. Dallas then developed as a strong industrial and financial center and a major inland port, due to the convergence of major railroad lines, interstate highways, and the construction of Dallas Fort Worth International Airport, one of the largest and busiest airports in the world. In addition, Dallas Area Rapid Transit (DART) operates rail and bus transit services throughout the city and its surrounding suburbs. Dominant sectors of its diverse economy include defense, financial services, information technology, telecommunications, and transportation. The Dallas–Fort Worth metroplex hosts 23 Fortune 500 companies, the second-most in Texas and fourth-most in the United States, and 11 of those companies are located within Dallas city limits. Over 41 colleges and universities are located within its metropolitan area, which i...",
  "error": null,
  "fetched_at": "2026-01-24T20:38:28Z"
}
