{
  "search_query": "Chicago History Museum Chicago museum",
  "found": true,
  "page_title": "History of Chicago",
  "page_url": "https://en.wikipedia.org/wiki/History_of_Chicago",
  "extract": "Chicago has played a central role in American economic, cultural and political history. Since the 1870s Chicago has been the largest and most dominant metropolis in the Midwestern United States. The recorded history begins with the arrival of French explorers, missionaries and fur traders in the late 17th century and their interaction with the local Potawatomi Native Americans. Jean Baptiste Point du Sable, a black freeman, by 1790 was the first permanent non-indigenous settler in the area. The small settlement was defended by Fort Dearborn after its completion in 1804, but was abandoned as part of the War of 1812 in expectation of an attack by the Potawatomi, who caught up with the retreating soldiers and civilians not two miles south of the fort. The modern city was incorporated in 1837 by Northern businessmen and grew rapidly from real estate speculation and the realization that it had a commanding position in the emerging inland transportation network, based on lake traffic and railroads, controlling access from the Great Lakes and the eastern states into the Mississippi River basin. Despite a fire in 1871 that destroyed the Central Business District, the city grew exponentially, becoming the nation's rail center and the dominant Midwestern center for manufacturing, commerce, finance, higher education, religion, broadcasting, sports, jazz, and high culture. The city was a magnet for European immigrants—at first Germans, Irish and Scandinavians, then from the 1890s to 1914, Jews, Czechs, Poles and Italians. They were all absorbed in the city's powerful ward-based political machines. Many joined militant labor unions, and Chicago became notorious for its violent strikes, but respected for its high wages. Large numbers of African Americans migrated from the South starting in the World War I era as part of the Great Migration. Mexicans started arriving after 1910, and Puerto Ricans after 1945. The Cook County suburbs grew rapidly after 1945, but the Democratic party...",
  "error": null,
  "fetched_at": "2026-01-24T20:28:12Z"
}
