{
  "search_query": "Knoxville Museum of Art Knoxville museum",
  "found": true,
  "page_title": "Knoxville, Tennessee",
  "page_url": "https://en.wikipedia.org/wiki/Knoxville,_Tennessee",
  "extract": "Knoxville is a city in Knox County, Tennessee, United States, and its county seat. Located on the Tennessee River within the Appalachian Mountains, it is the largest city in the Grand Division of East Tennessee. Knoxville had a population of 190,740 at the 2020 census, making it the third-most populous city in Tennessee. The Knoxville metropolitan area has an estimated 958,000 residents. Settled in 1786, Knoxville was the first capital of Tennessee. The city struggled with geographic isolation throughout the early 19th century before the arrival of the railroad in 1855 led to an economic boom. The city was bitterly divided over the issue of secession during the American Civil War and was occupied alternately by the Confederate and Union armies, which culminated in the Battle of Fort Sanders in 1863. Following the war, Knoxville grew rapidly and became a major wholesaling and manufacturing center until the 1920s when the city's economy began to stagnate. During the Great Depression, Knoxville's manufacturing sector collapsed, the downtown area declined, and city leaders became entrenched in highly partisan political fights. Hosting the 1982 World's Fair helped reinvigorate the city, and revitalization initiatives by city leaders and private developers have spurred growth in the city, especially downtown. Knoxville is home to the University of Tennessee's flagship campus, and the Tennessee Volunteers athletic teams are popular in the surrounding area. Knoxville is home to the Tennessee Supreme Court's courthouse for East Tennessee. It serves as the headquarters of the Tennessee Valley Authority and several national and regional companies, including Pilot Company, Clayton Homes, Bush Brothers, and H. T. Hackney Company. As one of the largest cities in the Appalachian region, Knoxville has positioned itself in recent years as a repository of Appalachian culture and gateway to Great Smoky Mountains National Park.",
  "error": null,
  "fetched_at": "2026-01-17T23:04:38Z"
}
