{
  "search_query": "Galveston Railroad Museum Galveston museum",
  "found": true,
  "page_title": "Galveston, Texas",
  "page_url": "https://en.wikipedia.org/wiki/Galveston,_Texas",
  "extract": "Galveston ( GAL-vis-tən) is a resort city and port on the Gulf Coast of the U.S. state of Texas. It encompasses 211.31 square miles (547.3 km2) on Galveston Island and Pelican Island. As of the 2020 census, the city had a population of 53,695, making it the second-largest municipality in Galveston County, where it also serves as the county seat. Located at the southern end of the Houston metropolitan area, Galveston sits on the northwestern coast of the Gulf of Mexico. Galveston, or Galvez's town, was named after 18th-century Spanish military and political leader Bernardo de Gálvez, 1st Count of Gálvez (1746–1786). The first European settlements on Galveston Island were built around 1816 by French pirate Louis-Michel Aury to help the fledgling First Mexican Empire fight for independence from the Spanish Empire. The Port of Galveston was established in 1825 by the Congress of Mexico following its independence. The city was the main port for the fledgling Texas Navy during the Texas Revolution of 1836, and later served temporarily as the new national capital of the Republic of Texas. In 1865, General Gordon Granger arrived at Ashton Villa and announced to some of the last enslaved African Americans that slavery was no longer legal. This event is commemorated annually on June 19, the federal holiday of Juneteenth. During the 19th century, Galveston became a major U.S. commercial center and one of the largest ports in the United States. It was, for a time, Texas' largest city, known as the \"Queen City of the Gulf\". It was devastated by the unexpected Galveston Hurricane of 1900, whose effects included massive flooding and a storm surge which nearly wiped out the town. The natural disaster on the exposed barrier island is still ranked today as the deadliest in United States history, with an estimated death toll between 6,000 and 12,000 people. The city subsequently reemerged during the Prohibition era of 1919–1933 as a leading tourist hub and a center of illegal gambling...",
  "error": null,
  "fetched_at": "2026-01-24T20:38:32Z"
}
