{
  "search_query": "Mercer Union A Centre for Contemporary Art museum",
  "found": true,
  "page_title": "Museum of Modern Art",
  "page_url": "https://en.wikipedia.org/wiki/Museum_of_Modern_Art",
  "extract": "The Museum of Modern Art (MoMA) is an art museum located in Midtown Manhattan, New York City, on 53rd Street between Fifth and Sixth Avenues. MoMA's collection spans the late 19th century to the present, and includes over 200,000 works of architecture and design, drawing, painting, sculpture, photography, prints, illustrated and artist's books, film, as well as electronic media. The institution was conceived in 1929 by Abby Aldrich Rockefeller, Lillie P. Bliss, and Mary Quinn Sullivan. Initially located in the Heckscher Building on Fifth Avenue, it opened just days after the Wall Street Crash. The museum was led by A. Conger Goodyear as president and Abby Rockefeller as treasurer, with Alfred H. Barr Jr. as its first director. Under Barr's leadership, the museum's collection rapidly expanded, beginning with an inaugural exhibition of works by European modernists. Despite financial challenges, including opposition from John D. Rockefeller Jr., the museum moved to several temporary locations in its early years, and John D. Rockefeller Jr. eventually donated the land for its permanent site. In 1939, the museum moved to its current location on West 53rd Street designed by architects Philip L. Goodwin and Edward Durell Stone. A new sculpture garden, designed by Barr and curator John McAndrew, also opened that year. From the 1930s through the 1950s, MoMA became a host to several landmark exhibitions, including Barr's influential \"Cubism and Abstract Art\" in 1936. Nelson Rockefeller became the museum's president in 1939, playing a key role in its expansion and publicity. David Rockefeller joined the board in 1948 and continued the family's close association with the museum until his death in 2017. In 1953, Philip Johnson redesigned the garden, which subsequently became the Abby Aldrich Rockefeller Sculpture Garden. In 1958, a fire at MoMA destroyed a painting by Claude Monet and led to the evacuation of other artworks. In later decades, the museum was among several institu...",
  "error": null,
  "fetched_at": "2026-01-24T20:41:27Z"
}
