{
  "search_query": "Port Angeles Fine Arts Center Port Angeles museum",
  "found": true,
  "page_title": "Port of San Francisco",
  "page_url": "https://en.wikipedia.org/wiki/Port_of_San_Francisco",
  "extract": "The Port of San Francisco is a semi-independent organization that oversees the port facilities at San Francisco, California, United States. It is run by a five-member commission, appointed by the mayor subject to confirmation by a majority of the San Francisco Board of Supervisors. The Port is responsible for managing the larger waterfront area that extends from the anchorage of the Golden Gate Bridge, along the Marina district, all the way around the north and east shores of the city of San Francisco including Fisherman's Wharf and the Embarcadero, and southward to the city line just beyond Candlestick Point. In 1968, the State of California, via the California State Lands Commission for the state-operated San Francisco Port Authority (est. 1957), transferred its responsibilities for the Harbor of San Francisco waterfront to the City and County of San Francisco/San Francisco Harbor Commission through the Burton Act AB2649. All eligible state port authority employees had the option to become employees of the City and County of San Francisco to maintain consistent operation of the port of San Francisco. The port of San Francisco lies on the western edge of the San Francisco Bay near the Golden Gate. It has been called one of the three great natural harbors in the world, but it took two long centuries for navigators from Spain and England to find the anchorage originally called Yerba Buena: a port, as was said in its early days, in which all the fleets of the world could find anchorage. The port area under the commission's control comprises nearly eight miles of waterfront lands, commercial real estate and maritime piers from Hyde Street on the north to India Basin in the southeast. The list of landmarks under port control include Fisherman's Wharf, Pier 39, the Ferry Building, Oracle Park (formerly AT&T Park, SBC Park and Pacific Bell Park), located next to China Basin and Pier 70 at Potrero Point. Huge covered piers on piles jut out into San Francisco Bay along much...",
  "error": null,
  "fetched_at": "2026-01-24T20:40:16Z"
}
