{
  "search_query": "SITE Santa Fe Santa Fe museum",
  "found": true,
  "page_title": "Santa Fe Trail",
  "page_url": "https://en.wikipedia.org/wiki/Santa_Fe_Trail",
  "extract": "The Santa Fe Trail was a 19th-century route through central North America that connected Franklin, Missouri, with Santa Fe, New Mexico. Pioneered in 1821 by William Becknell, who departed from the Boonslick region along the Missouri River, the trail served as a vital commercial highway until 1880, when the railroad arrived in Santa Fe. Santa Fe was near the end of El Camino Real de Tierra Adentro which carried trade from Mexico City. The trail was later incorporated into parts of the National Old Trails Road and U.S. Route 66. The route skirted the northern edge and crossed the north-western corner of Comancheria, the territory of the Comanche. Realizing the value, they demanded compensation for granting passage to the trail. American traders envisioned them as another market. Comanche raiding farther south in Mexico isolated New Mexico, making it more dependent on the American trade. They raided to gain a steady supply of horses to sell. By the 1840s, trail traffic through the Arkansas Valley was so numerous that bison herds were cut off from important seasonal grazing land. This habitat disruption, on top of overhunting, contributed to the collapse of the species. Comanche power declined in the region when they lost their most important game. In 1846, during the Mexican–American War, the United States Army used the Santa Fe Trail to invade New Mexico. After the U.S. acquisition of the Southwest that ended the war, the trail was integral to the U.S. opening the region to economic development and settlement. It played a vital role in the westward expansion of the U.S. into these new lands. The road route is commemorated today by the National Park Service as the Santa Fe National Historic Trail. A highway route that roughly follows the trail's path, through the entire length of Kansas, the southeast corner of Colorado and northern New Mexico, has been designated as the Santa Fe Trail National Scenic Byway.",
  "error": null,
  "fetched_at": "2026-01-24T20:33:38Z"
}
