{
  "search_query": "GLBT Historical Society San Francisco museum",
  "found": true,
  "page_title": "GLBT Historical Society",
  "page_url": "https://en.wikipedia.org/wiki/GLBT_Historical_Society",
  "extract": "The GLBT Historical Society (Gay, Lesbian, Bisexual, Transgender Historical Society) (formerly Gay and Lesbian Historical Society of Northern California; San Francisco Bay Area Gay and Lesbian Historical Society) maintains an extensive collection of archival materials, artifacts and graphic arts relating to LGBTQ history in the United States, with a focus on the LGBTQ communities of San Francisco and Northern California. The society also sponsors the GLBT Historical Society Museum, a stand-alone museum that has attracted international attention. The Swedish Exhibition Agency has cited the institution as one of just \"three established museums dedicated to LGBTQ history in the world\" as of 2016. It is also the first full-scale, stand-alone museum of lesbian, gay, bisexual and transgender history in the United States (and only the second in the world after the Schwules Museum in Berlin). The grand opening of the museum took place on the evening of January 13, 2011. Referred to as San Francisco's \"queer Smithsonian\", the GLBT Historical Society is one of approximately 30 LGBTQ archives in the United States—and is among the handful of such organizations to benefit from a paid staff and to function as a full-fledged center for exhibitions, programming, research, and production of oral histories. It is recognized by the Internal Revenue Service as a tax-exempt 501(c)(3) educational association and is registered with the State of California as a nonprofit corporation. The archives, reading room and administrative offices of the GLBT Historical Society are located at 989 Market St., Lower Level, in San Francisco's Mid-Market district. The GLBT Historical Society Museum, which serves as a separate center for exhibitions and programs, is located at 4127 18th St. in the city's Castro neighborhood.",
  "error": null,
  "fetched_at": "2026-01-24T20:23:05Z"
}
