{
  "search_query": "CAM Raleigh Raleigh museum",
  "found": true,
  "page_title": "Raleigh, North Carolina",
  "page_url": "https://en.wikipedia.org/wiki/Raleigh,_North_Carolina",
  "extract": "Raleigh ( RAH-lee) is the capital city of the U.S. state of North Carolina. It is the second-most populous city in the state (after Charlotte), tenth most populous city in the Southeast, the largest city in the Research Triangle area, and the 39th-most populous city in the U.S. Known as the \"City of Oaks\" for its oak-lined streets, Raleigh covers 148.54 square miles (384.7 km2) and had a population of 467,665 at the 2020 census. It is the county seat of Wake County and is named after Sir Walter Raleigh, who founded the lost Roanoke Colony. Raleigh is home to North Carolina State University and is part of the Research Triangle, which includes Durham (home to Duke University and North Carolina Central University) and Chapel Hill (home to the University of North Carolina at Chapel Hill). The Research Triangle area, centered around Research Triangle Park, has a population of over 2.37 million people. The Raleigh–Cary metropolitan statistical area alone has an estimated population of 1.51 million. Raleigh lies primarily in Wake County, with a small portion of the city extending into Durham County. Nearby suburbs include Apex, Cary, Clayton, Fuquay-Varina, Garner, Holly Springs, Knightdale, Morrisville, Rolesville, Wake Forest, Wendell, and Zebulon. Raleigh is an early example in the United States of a planned city. Following the American Revolutionary War when the U.S. gained independence, the area was chosen as the site of the state capital in 1788 and incorporated in 1792 as such. The city was originally laid out in a grid pattern with the North Carolina State Capitol at the center, in Union Square. During the American Civil War, the city was spared from any significant battle. It fell to the Union in the closing days of the war and struggled with the economic hardships in the postwar period, related to the reconstitution of labor markets, over-reliance on agriculture, and the social unrest of the Reconstruction Era. The establishment of the Research Triangle Park in 1...",
  "error": null,
  "fetched_at": "2026-01-24T20:32:23Z"
}
