{
  "search_query": "Princeton University Art Museum Princeton museum",
  "found": true,
  "page_title": "Princeton University Art Museum",
  "page_url": "https://en.wikipedia.org/wiki/Princeton_University_Art_Museum",
  "extract": "The Princeton University Art Museum (PUAM) is the Princeton University gallery of art, located in Princeton, New Jersey. With a collecting history that began in 1755, the museum was formally established in 1882, and now houses over 117,000 works of art ranging from antiquity to the contemporary period. The Princeton University Art Museum dedicates itself to supporting and enhancing the university's goals of teaching, research, and service in fields of art and culture, as well as to serving regional communities and visitors from around the world. Its collections concentrate on the Mediterranean region, Western Europe, Asia, the United States, and Latin America. The museum has a large collection of Greek and Roman antiquities, including ceramics, marbles, bronzes, and Roman mosaics from Princeton University's excavations in Antioch. Medieval Europe is represented by sculpture, metalwork, and stained glass. The collection of Western European paintings includes examples from the early Renaissance through the nineteenth century, and there is a growing collection of twentieth-century and contemporary art. Photographic holdings are a particular strength, numbering over 27,000 works from the invention of daguerreotype in 1839 to the present. The museum is also noted for its Asian art gallery, which includes a wide collection of Chinese calligraphy, painting, ancient bronze works, jade carvings as well as porcelain selections. In addition to its collections, the museum mounts regular temporary exhibitions featuring works from its own holdings as well as loans made from public and private collections around the world. Admission is free and the museum is open Tuesday, Wednesday, Friday, and Saturday, 10:00 am to 5:00 pm, Thursday, 10:00 am to 9:00 pm, and Sunday 12:00 to 5:00 pm. A new building for the museum has been constructed on the same site over the course of four years starting in 2021 with David Adjaye serving as architect. Demolition of the former facility began in Ju...",
  "error": null,
  "fetched_at": "2026-01-24T20:33:09Z"
}
