{
  "search_query": "Utah Museum of Fine Arts/University of Utah Salt Lake City museum",
  "found": true,
  "page_title": "Salt Lake City",
  "page_url": "https://en.wikipedia.org/wiki/Salt_Lake_City",
  "extract": "Salt Lake City, often shortened to Salt Lake or SLC, is the capital and most populous city of the U.S. state of Utah. It is the county seat of Salt Lake County, the most populous county in the state. The population was 199,723 at the 2020 census, while the Salt Lake City metropolitan area has an estimated 1.3 million residents and is the 46th-largest metropolitan area in the United States. It is also part of the larger Salt Lake City–Ogden–Provo combined statistical area, an urban corridor along a 120-mile (190 km) segment of the Wasatch Front with a population of approximately 2.8 million. It is one of the principal urban centers within the Great Basin, along with Reno, Nevada. Salt Lake City was founded in 1847 by settlers led by Brigham Young who were seeking to escape persecution they had experienced while living farther east. The Mormon pioneers, as they would come to be known, entered a semi-arid valley and immediately began building an extensive irrigation network that could feed the population and foster future growth. Salt Lake City's street grid system is based on a standard compass grid plan, with the southeast corner of Temple Square serving as the origin of the Salt Lake meridian. Owing to its proximity to the Great Salt Lake, the city was originally named Great Salt Lake City; the word \"Great\" was dropped from the city's name in 1868. Immigration of international members of the Church of Jesus Christ of Latter-day Saints (LDS Church), mining booms, and the construction of the first transcontinental railroad brought economic growth, and the city was nicknamed \"The Crossroads of the West\". It was traversed by the Lincoln Highway, the first transcontinental highway, in 1913. Two major cross-country freeways, I-15 and I-80, now intersect in the city. The city also has a belt route, I-215. Salt Lake City has developed a strong tourist industry based primarily on skiing, outdoor recreation, and religious tourism. It hosted the 2002 Winter Olympics and was fo...",
  "error": null,
  "fetched_at": "2026-01-24T20:39:18Z"
}
