{
  "search_query": "Arlington Historical Museum/Arlington Historical Society Arlington museum",
  "found": true,
  "page_title": "Arlington, Washington",
  "page_url": "https://en.wikipedia.org/wiki/Arlington,_Washington",
  "extract": "Arlington is a city in northern Snohomish County, Washington, United States, part of the Seattle metropolitan area. The city lies on the Stillaguamish River in the western foothills of the Cascade Range, adjacent to the city of Marysville. It is approximately 10 miles (16 km) north of Everett, the county seat, and 40 miles (64 km) north of Seattle, the state's largest city. As of the 2020 U.S. census, Arlington had a population of 19,868; its estimated population is 21,959 as of 2024. The city lies in the traditional territory of the Stillaguamish people, an indigenous Coast Salish group. Arlington was established in the 1880s by settlers and the area was platted as two towns, Arlington and Haller City. Haller City was absorbed by the larger Arlington, which was incorporated as a city in 1903. During the Great Depression of the 1930s, the Arlington area was the site of major projects undertaken for employment under the direction of federal relief agencies, including construction of a municipal airport that would serve as a naval air station during World War II. Arlington began suburbanizing in the 1980s, growing by more than 450 percent by 2000 and annexing the unincorporated area of Smokey Point to the southwest. The economy of the Arlington area historically relied on timber and agriculture. In the early 21st century, it has transitioned to a service economy, with some aviation industry jobs near the municipal airport. The city is governed by a mayor–council government, electing a mayor and seven city councilmembers. The municipal government maintains the city's parks system and water and wastewater utilities. Other services, including public utilities, public transportation, and schools, are contracted to regional or county-level agencies and companies.",
  "error": null,
  "fetched_at": "2026-01-24T20:39:20Z"
}
