{
  "search_query": "Museum of Art and Archaeology/University of Missouri- Columbia Columbia museum",
  "found": true,
  "page_title": "Columbia, Missouri",
  "page_url": "https://en.wikipedia.org/wiki/Columbia,_Missouri",
  "extract": "Columbia is a city in Boone County, Missouri, United States, and its county seat. It was founded in 1821 and had a population of 126,254 as recorded in the 2020 United States census, making it the fourth-most populous city in Missouri. Columbia is a Midwestern college town, home to the University of Missouri, a major research institution also known as MU or Mizzou. In addition to the university and surrounding Downtown Columbia are Stephens College and Columbia College, giving the city its educational focus and nearly 40,000 college students. It is the principal city of the Columbia metropolitan area, population 215,811, and the central city of the nine-county Columbia–Jefferson City–Moberly combined statistical area with 415,747 residents. The city is the fastest-growing municipality in Missouri, with a growth of almost 40% since 2000, and a population estimated at 130,900 in 2024. Columbia is among the most-educated cities in the United States with about half of citizens being college graduates and about a quarter holding advance degrees. The city is built on the oak-forested hills and rolling prairies of Mid-Missouri, near the Missouri River, where the Ozark Mountains transition into plains and savanna. At the city's center is the Avenue of the Columns (8th Street), connecting Francis Quadrangle and Jesse Hall to the Boone County Courthouse and City Hall. Surrounding Columbia is a greenbelt including Rock Bridge Memorial State Park, Eagle Bluffs Conservation Area, the Mark Twain National Forest, Katy Trail State Park, Finger Lakes State Park, and the Big Muddy National Fish and Wildlife Refuge. Limestone bedrock forms bluffs and glades while rain dissolves the bedrock, creating karst (caves and springs) which water the Hinkson, Roche Perche, Flat Branch, and Bonne Femme creeks. Within city limits, there is an extensive city parks and trails system with a focus on non-motorized transportation, including the MKT Trail. The Columbia Agriculture Park is home to the n...",
  "error": null,
  "fetched_at": "2026-01-24T20:31:55Z"
}
