{
  "search_query": "One Club Bilbao museum",
  "found": true,
  "page_title": "Athletic Bilbao",
  "page_url": "https://en.wikipedia.org/wiki/Athletic_Bilbao",
  "extract": "Athletic Club (Basque: Athletic Kluba; Spanish: Athletic Club), commonly known as Athletic Bilbao (Spanish: Athletic de Bilbao), or simply Athletic, is a professional football club based in the city of Bilbao, Spain. They are known as Lehoiak (The Lions) because their stadium was built near a church called San Mamés, which was named after Saint Mammes, an early Christian thrown to the lions by the Romans. Mammes pacified the lions and was later made a saint. The team plays its home matches at the San Mamés Stadium. Its home colours are red and white striped shirts with black shorts. Athletic are the fourth most successful club in La Liga with eight titles to their name. In the table of Copa del Rey titles, Athletic is second only to Barcelona, having won it 24 times. It is also the most successful Basque football club in both league and cup titles won. The club also has one of the most successful women's teams in Spain, which has won five championships in the Primera División Femenina. The club is one of three founding members of the Primera División that have never been relegated from the top division since its inception in 1929, the others being Real Madrid and Barcelona. These three clubs, along with Osasuna, are the only four professional clubs in Spain that are not sports corporations; instead they are owned and operated by club members. Athletic's main rivals are Real Sociedad, against whom it contests the Basque derby, and Real Madrid, due to sporting and political identity; a minor rivalry also exists with Barcelona due to historical significance. At various points in the club's history, further Basque league derbies have been contested against Alavés, Eibar and Osasuna. The club is known for its cantera policy of bringing young Basque players through the ranks, as well as recruiting players from other Basque clubs. Athletic's official policy is to sign players native to or trained in football in the greater Basque Country, which includes Biscay, Gipuzkoa, Á...",
  "error": null,
  "fetched_at": "2026-01-24T20:34:25Z"
}
