{
  "search_query": "Historic Georgetown Inc. Hamill House Museum museum",
  "found": true,
  "page_title": "Eldridge Street Synagogue",
  "page_url": "https://en.wikipedia.org/wiki/Eldridge_Street_Synagogue",
  "extract": "The Eldridge Street Synagogue is an Orthodox Jewish synagogue at 12–16 Eldridge Street in the Chinatown and Lower East Side neighborhoods of Manhattan in New York City. Built in 1887 for Congregation Kahal Adath Jeshurun, the synagogue is one of the first erected in the U.S. by Eastern European Jews. The congregation, officially known as Kahal Adath Jeshurun with Anshe Lubz, still owns the synagogue and hosts weekly services there in the 21st century. The Museum at Eldridge Street, founded in 1986 as the Eldridge Street Project, also occupies the synagogue under a long-term lease. The building is a National Historic Landmark and a New York City designated landmark. The congregation was established in 1852 as Beth Hamedrash and had congregants from across Eastern Europe. It relocated several times and was renamed Kahal Adath Jeshurun after merging with Holkhe Yosher Vizaner in 1886. Kahal Adath Jeshurun acquired a site for a new synagogue on Eldridge Street in 1886, and the building was dedicated on September 4, 1887. The congregation's membership peaked between 1890 and 1915, with up to 800 members, and the congregation merged with Anshe Lubz in 1909. Membership dwindled significantly after the 1920s, as congregants relocated and the Immigration Act of 1924 restricted new immigration. The main sanctuary was closed completely in 1954, and the remaining congregants met in the basement. Preservationists began trying to save the building in the 1970s and stabilized it in the early 1980s. The Eldridge Street Project raised money for a reconstruction of the synagogue, which was completed in 2007. The synagogue was designed by Peter and Francis William Herter in the Moorish Revival style, with Gothic Revival and Romanesque Revival elements spread throughout the building. The Eldridge Street facade includes a rose window, two stair towers, and arched openings. There is another rose window in the rear and finials on the rooftops. The main and largest space is the sanctuary, ...",
  "error": null,
  "fetched_at": "2026-01-24T20:25:26Z"
}
