{
  "search_query": "Monterey Museum of Art Monterey museum",
  "found": true,
  "page_title": "Monterey, California",
  "page_url": "https://en.wikipedia.org/wiki/Monterey,_California",
  "extract": "Monterey ( MON-tə-RAY; Spanish: Monterrey) is a city situated on the southern edge of Monterey Bay, on the Central Coast of California. Located in Monterey County, the city occupies a land area of 8.645 sq mi (22.39 km2) and recorded a population of 30,218 in the 2020 census. Monterey was founded by the Spanish in 1774, when Gaspar de Portolá and Junípero Serra established the Presidio of Monterey and the Cathedral of San Carlos Borromeo. Monterey was elevated to capital of the Province of the Californias in 1777, servings as the administrative and military headquarters of both Alta California and Baja California, as well as its only official port of entry. Following the Mexican War of Independence, Monterey continued as the capital of the Mexican Department of the Californias. During the United States conquest of California, part of the Mexican-American War, Monterey was seized by the American military in the Battle of Monterey in 1846. Following its capture, Monterey continued to serve as the capital of the American interim government of California until 1849, during which it hosted the California's 1st Constitutional Convention. In the late 19th century, Monterey and its surrounding area began to attract communities of artists, writers, and other creatives, leading to the creation of an art colony. Today, Monterey is a popular tourist destination on the Central Coast, hosting notable attractions such as the Monterey Bay Aquarium, Cannery Row, Fisherman's Wharf, California Roots Music and Arts Festival, and the annual Monterey Jazz Festival. The city is also an important hub for the military and higher education, home to the Defense Language Institute, the Naval Postgraduate School, the Middlebury Institute of International Studies at Monterey and California State University, Monterey Bay.",
  "error": null,
  "fetched_at": "2026-01-17T22:59:58Z"
}
