{
  "search_query": "Museum of Anthropology, Wake Forest University Winston-Salem museum",
  "found": true,
  "page_title": "Wake Forest University",
  "page_url": "https://en.wikipedia.org/wiki/Wake_Forest_University",
  "extract": "Wake Forest University (Wake or WFU) is a private research university in Winston-Salem, North Carolina, United States. Established in 1834, the university received its name from its original location in Wake Forest, north of Raleigh, North Carolina. The Reynolda Campus, the university's main campus, has been located north of downtown Winston-Salem since the university moved there in 1956. Wake Forest also maintains other academic campuses or facilities in Charlotte, North Carolina; Washington, D.C.; Venice; Vienna; and London. Wake Forest's undergraduate and graduate schools include the School of Business, School of Arts and Sciences, School of Professional Studies, School of Divinity, School of Law, and School of Medicine. The university is affiliated with Atrium Health Wake Forest Baptist. There are over 250 student clubs and organizations at the university, including fraternities and sororities, intramural sports, a student newspaper and a radio station. Wake Forest's undergraduate admissions is considered highly selective with an admission rate of 22%. As of 2024, eighteen Rhodes Scholars, including thirteen since 1986, five Marshall Scholars, eighteen Truman Scholars and sixty-two Fulbright recipients since 1993 have been affiliated with Wake Forest. Alumni of Wake Forest include nine college founders and presidents, seven U.S. governors, members of the United States Congress, five U.S. federal officials, five U.S. diplomats, three billionaires, a Pulitzer Prize winner, Olympic athletes and many U.S. district judges. Wake Forest athletic teams are known as the Demon Deacons and compete in eighteen NCAA Division I intercollegiate sports. Those teams have won eleven NCAA team championships and the university is a founding member of the Atlantic Coast Conference (ACC).",
  "error": null,
  "fetched_at": "2026-01-24T20:32:45Z"
}
