{
  "search_query": "South Bend Museum of Art South Bend museum",
  "found": true,
  "page_title": "South Bend, Indiana",
  "page_url": "https://en.wikipedia.org/wiki/South_Bend,_Indiana",
  "extract": "South Bend is a city in St. Joseph County, Indiana, United States, and its county seat. It lies along the St. Joseph River near its southernmost bend, from which it derives its name. It is the fourth-most populous city in Indiana with a population of 103,453 at the 2020 census. Located directly south of Indiana's northern border with Michigan, South Bend anchors the broader Michiana region. Its metropolitan area had a population of 324,501 in 2020, while its combined statistical area had 812,199 residents. The area was first settled in the early 19th century by fur traders and was established as a city in 1865. The St. Joseph River shaped South Bend's economy through the mid-20th century. River access assisted heavy industrial development such as that of the Studebaker Corporation and the Oliver Chilled Plow Company. Like other Rust Belt cities, South Bend has been affected by population and industrial decline since the 1960s. This has been chiefly due to the demise of Studebaker, migration to suburban areas, and the loss of other heavy industry. However, in recent years, there have been successful efforts to invest in and revitalize blighted areas of the city, such as during the mayoralty of Pete Buttigieg. Today, the largest industries in South Bend are health care, education, small business, and tourism. The city is home to manufacturer AM General and financial services company 1st Source. A major draw for visitors is the nearby University of Notre Dame, which also plays an important role in the local economy and culture. The city is served by the South Bend International Airport and by the South Shore Line commuter railway, connecting South Bend to downtown Chicago, which is 72 miles (116 km) to the west.",
  "error": null,
  "fetched_at": "2026-01-17T23:01:34Z"
}
