{
  "search_query": "Santa Barbara Historical Museum Santa Barbara County museum",
  "found": true,
  "page_title": "Mission Santa Barbara",
  "page_url": "https://en.wikipedia.org/wiki/Mission_Santa_Barbara",
  "extract": "Mission Santa Barbara (Spanish: Misión de Santa Bárbara) is a Spanish mission in Santa Barbara, California, United States. Often referred to as the 'Queen of the Missions', it was founded by Padre Fermín Lasuén for the Franciscan order on December 4, 1786, the feast day of Saint Barbara, as the tenth mission of what would later become 21 missions in Alta California. Mission Santa Barbara, like other California missions, was built as part of a broader effort to consolidate the Spanish claim on Alta California in the face of threats from rival empires. In attempting to do this, Spain sought to turn local indigenous tribes into good Spanish citizens (for Mission Santa Barbara, this was the Chumash-Barbareño tribe). This required religious conversion and integration into the Spanish colonial economy – for the local Chumash people, the environmental changes wrought by the Mission's large herd of livestock, combined with epidemics and military force, meant that tribal members often had little choice but to join the mission system, resulting in a type of forced servitude. The mission is the namesake of the city of Santa Barbara as well as of Santa Barbara County and comes from the legend of Saint Barbara, a girl who was beheaded by her father for following the Christian faith. The Mission grounds occupy a rise between the Pacific Ocean and the Santa Ynez Mountains, and were consecrated by Father Fermín Lasuén, who had taken over the presidency of the California mission chain upon the death of Father Junípero Serra. Mission Santa Barbara is, along with mission San Luis Rey, the only mission to remain under the leadership of the Franciscan Friars since its founding, and today is a parish church of the Archdiocese of Los Angeles.",
  "error": null,
  "fetched_at": "2026-01-24T20:23:58Z"
}
