{
  "search_query": "Joel Lane Museum House Raleigh museum",
  "found": true,
  "page_title": "Joel Lane House",
  "page_url": "https://en.wikipedia.org/wiki/Joel_Lane_House",
  "extract": "The Joel Lane House, also known as Wakefield, was built in 1769 and is now a restored historic home and museum in Raleigh, North Carolina. It is the oldest dwelling in Wake County and contains collections of 18th century artifacts and period furnishings. The museum grounds include a detached middle-class home built circa 1790, a formal city garden, and a period herb garden. The house is named after Joel Lane, the \"Father of Raleigh\" and \"Father of Wake County.\" In the late 1760s, Lane settled at Wake Cross Roads located in colonial Johnston County (now in present day central Wake County). Lane and his house played a key role in North Carolina's transition from colony to state and in the establishment of Raleigh as the state capital. Joel Lane's plantation manor stood on a small hill overlooking the future site of Raleigh. Lane owned thousands of acres, which enabled him to be influential in politics. Lane was a member of the colonial General Assembly, and successfully lobbied to create Wake County in 1770, which was, at the time, a sparsely settled wilderness. The county was named \"Wake\" in honor of Margaret Wake, wife of colonial Governor William Tryon. In 1771, Wake County's first county court is believed to have convened at his home. Lane was appointed a member of the court, a position he held until his death. During the Revolutionary War, Wake Cross Roads was the site of important government meetings, both formal and informal. In 1776, Lane hosted the colony Council of Safety; the following year, he obtained a license for a small inn. From May to June 1781, Lane's property was the setting for a session of the state General Assembly. Lane served in the state Senate in 11 of the 14 sessions from 1782 to 1794. He was also a delegate to the 1789 convention in Halifax that ratified the United States Constitution. Lane was directly involved in the decision to locate the permanent capital of the state in Wake County. In 1792, the legislature authorized the purchase of ...",
  "error": null,
  "fetched_at": "2026-01-24T20:32:40Z"
}
