{
  "search_query": "Gibbs Museum of Art Charleston museum",
  "found": true,
  "page_title": "Gibbes Museum of Art",
  "page_url": "https://en.wikipedia.org/wiki/Gibbes_Museum_of_Art",
  "extract": "The Gibbes Museum of Art, formerly known as the Gibbes Art Gallery, is an art museum in Charleston, South Carolina. Established as the Carolina Art Association in 1858, the museum moved into a new Beaux Arts building at 135 Meeting Street, in the Charleston Historic District, in 1905. The Gibbes houses a premier collection of over 10,000 works of fine art, principally American works, many with a connection to Charleston or the South. The benefactor, James Shoolbred Gibbes, donated $100,000 to the Carolina Arts Association for the \"erection of a suitable building for the exhibitions of paintings.\" The city did not receive the money until after the resolution of a will contest filed by nieces and nephews of Gibbes. Their case was heard in the state court of New York during 1900 and 1901. On December 6, 1901, the New York Supreme Court (the state's trial-level court) issued an opinion declaring that the gift to Charleston was valid. After receiving the money in 1903, the Association hired Frank Pierce Milburn to design the gallery. He planned a Tiffany-style dome, Doric columns, and pediment-capped windows and doors. Milburn completed the drawings of the building in mid-1903, and a drawing of the proposed building was published in the Charleston Evening Post on June 5, 1903. Notices were published seeking contractors' bids for the work starting in August 1903. In September 1903, H.T. Zacharias was selected as the contractor and received a contract for $73,370 for the building. Zacharias started work on September 28, 1903, removing the remains of the South Carolina Agricultural Hall that had occupied the lot. Although work on the foundations had begun already, a ceremony was held on December 8, 1903, to lay the cornerstone of the building at the northeast corner. The museum formally opened on April 11, 1905. The collection on display on the opening day included more than 300 pictures, many bronzes, and about 200 miniatures in addition to an \"instructive collection\" of J...",
  "error": null,
  "fetched_at": "2026-01-24T20:37:59Z"
}
