{
  "search_query": "Jewish Museum Milwaukee Milwaukee museum",
  "found": true,
  "page_title": "Milwaukee",
  "page_url": "https://en.wikipedia.org/wiki/Milwaukee",
  "extract": "Milwaukee is the most populous city in the state of Wisconsin. Located on the western shore of Lake Michigan, it is the 31st-most populous city in the United States and the fifth-most populous city in the Midwest with a population of 577,222 at the 2020 census. The Milwaukee metropolitan area, with over 1.57 million residents, is the 40th-largest metropolitan area in the nation. It is the county seat of Milwaukee County. Milwaukee was inhabited by many indigenous cultures, particularly the Potawatomi, Menominee, and Ho-Chunk. In the early 19th century, European settlers established the city as a hub for trade and industry, capitalizing on its location as a port. Its history was heavily influenced by Central European immigrants, and it remains a center of German-American culture. Milwaukee grew into a major brewing center, with the Miller, Pabst, and Schlitz breweries shaping its industrial identity. The city also became known for its strong labor movement. While it is an ethnically and culturally diverse city, it continues to be one of the most racially segregated cities in the U.S. as a result of early-20th century redlining. Milwaukee is rated as a \"Sufficiency\" city by the Globalization and World Cities Research Network, with a regional GDP of over $130 billion in 2023. The city is home to Fortune 500 companies Northwestern Mutual, Fiserv, ManpowerGroup, Rockwell Automation, and WEC Energy Group. Its cultural institutions include the Harley-Davidson Museum, Milwaukee Art Museum, Milwaukee Public Museum, and Summerfest, one of the world's largest music festivals. It is home to several higher education institutions, such as Marquette University, Milwaukee School of Engineering, and the University of Wisconsin–Milwaukee. The city's major league professional sports teams include the Milwaukee Brewers (MLB) and Milwaukee Bucks (NBA).",
  "error": null,
  "fetched_at": "2026-01-24T20:40:50Z"
}
