{
  "search_query": "Hopewell Museum/Historic Paris Bourbon County Paris museum",
  "found": true,
  "page_title": "Bourbon County Courthouse (Kentucky)",
  "page_url": "https://en.wikipedia.org/wiki/Bourbon_County_Courthouse_(Kentucky)",
  "extract": "The current Bourbon County Courthouse, on Courthouse Square in Paris, Kentucky, was built in 1905. This is the fourth courthouse to be built on this land. It was designed by architect Frank P. Milburn in Beaux Arts style. It was listed on the National Register of Historic Places in 1974. The first courthouse was built in 1787. There are very few details on this courthouse and for reason's unknown, it was rebuilt in 1799. The first courthouse was built when Bourbon County was formed, then part of Virginia. Courthouse Number 2 was completed in 1799, seven years after Kentucky became a state. The second courthouse was designed and built by John & Thomas Metcalfe. Thomas Metcalfe (Kentucky politician) was the 10th governor of Kentucky, but was also a particularly skilled stonemason, earning the name \"Old Stonehammer\". This courthouse was destroyed by fire in 1872, reportedly at the hands of arsonists. Courthouse Number 3 was constructed rather quickly in 1873, this time in French-Renaissance style building. Once completed, it was equipped with a clock and bell tower rising 113 feet into the sky. Its construction included a mansard roof, and was constructed of brick with iron cornices. Its size proved to be a disadvantage when a fire broke out in 1901. The size prevented ladders and water from reaching to the upper floors where the fire began. An important note about this particular courthouse is that all of the documents survived the fire due to being locked in fireproof vaults. During this fire, many courthouse workers reportedly ran into the burning building and moved carts, and shelves of important documents into the large vaults and locked them so they would be safe. The vaults had, up until that day been locked each night, but for some reason had not been the night of the fire. The cause of this fire is still a mystery. Courthouse number 4, the courthouse that stands today, was completed in 1905 and is said to be the grandest of all Kentucky County Courthouses. The...",
  "error": null,
  "fetched_at": "2026-01-24T20:29:10Z"
}
