{
  "search_query": "Naples Art Association Naples museum",
  "found": true,
  "page_title": "Erotic art in Pompeii and Herculaneum",
  "page_url": "https://en.wikipedia.org/wiki/Erotic_art_in_Pompeii_and_Herculaneum",
  "extract": "Erotic art in Pompeii and Herculaneum has been both exhibited as art and censored as pornography. The Roman cities of Pompeii and Herculaneum around the bay of Naples were destroyed by the eruption of Mount Vesuvius in 79 AD, thereby preserving their buildings and artefacts until extensive archaeological excavations began in the 18th century. These digs revealed the cities to be rich in erotic artefacts such as statues, frescoes, and household items decorated with sexual themes. The ubiquity of such imagery and items indicates that the treatment of sexual iconography in ancient Rome was more relaxed than in current Western culture. The creation of erotic art in ancient Rome is thought to have occurred over seven centuries from the first century BCE to the fifth or sixth century CE. Much of what might strike modern viewers as erotic imagery, such as oversized phalluses, could arguably be fertility imagery. Depictions of the phallus, for example, could be used in gardens to encourage the production of fertile plants. This clash of cultures led to many erotic artefacts from Pompeii being locked away from the public for nearly 200 years. In 1819, when King Francis I of Naples visited the Pompeii exhibition at the Naples National Archaeological Museum with his wife and daughter, he was embarrassed by the erotic artwork and ordered it to be locked away in a \"secret cabinet\", accessible only to \"people of mature age and respected morals\". Re-opened, closed, re-opened again and then closed again for nearly 100 years, the Secret Museum, Naples was briefly made accessible at the end of the 1960s (the time of the sexual revolution) and was finally re-opened for viewing in 2000. Minors are still only allowed entry to the once-secret cabinet in the presence of a guardian, or with written permission.",
  "error": null,
  "fetched_at": "2026-01-24T20:26:30Z"
}
