{
  "search_query": "Revs Institute for Automotive Research Inc. museum",
  "found": true,
  "page_title": "Lincoln Motor Company",
  "page_url": "https://en.wikipedia.org/wiki/Lincoln_Motor_Company",
  "extract": "Lincoln Motor Company, or simply Lincoln, is the luxury vehicle division of American automobile manufacturer Ford Motor Company. Marketed among the top luxury vehicle brands in the United States, Lincoln is positioned closely against its General Motors counterpart Cadillac. Starting with the 2021 model year, the brand solely offers SUV and crossover vehicles. The division helped to establish the personal luxury car segment with the 1940 Lincoln Continental. Lincoln Motor Company was founded in 1917 by Henry M. Leland, naming it after Abraham Lincoln. In February 1922, the company was acquired by Ford, its parent company to this day. Following World War II, Ford formed the Lincoln-Mercury Division, pairing Lincoln with its mid-range Mercury brand; the pairing lasted until the 2010 closure of Mercury. At the end of 2012, Lincoln reverted to its original name, Lincoln Motor Company. Following the divestiture of Premier Automotive Group (Jaguar, Land Rover, Aston Martin, and Volvo) and the closure of Mercury, Lincoln remains the sole luxury nameplate of Ford Motor Company. Originally founded as a freestanding division above Lincoln, Continental was integrated within Lincoln in 1959. For 1969, the Continental-branded Mark series was marketed through Lincoln, adopting the Lincoln name for 1986. The Lincoln four-point star emblem is derived from a badge introduced on the 1956 Continental Mark II; the current version was introduced in 1980. The current product range of Lincoln consists of luxury crossovers and sport-utility vehicles. Throughout its entire prior existence Lincoln also produced luxury car-based vehicles for limousine and livery use; several examples have served as official state limousines for Presidents of the United States. Today, this niche is filled from its crossover and SUV lineup. In 2017, Lincoln sold 188,383 vehicles globally. Outside of North America, Lincoln vehicles are officially sold in the Middle East (except Iran and Syria), China (except Hong...",
  "error": null,
  "fetched_at": "2026-01-24T20:26:56Z"
}
