{
  "search_query": "Washington Crossing Historic Park Upper Makefield Township museum",
  "found": true,
  "page_title": "Washington Crossing Historic Park",
  "page_url": "https://en.wikipedia.org/wiki/Washington_Crossing_Historic_Park",
  "extract": "Washington Crossing Historic Park is a 500-acre (2 km2) state park operated by the Pennsylvania Department of Conservation and Natural Resources in partnership with the Friends of Washington Crossing Park. The park is divided into two sections. One section of the park, the \"lower park,\" is headquartered in the village of Washington Crossing located in Upper Makefield Township in Bucks County, Pennsylvania. It marks the location of George Washington's crossing of the Delaware River during the American Revolutionary War. The lower park includes 13 historic buildings including McConkey's Ferry Inn, where General George Washington and his aides ate dinner and made plans prior to the crossing. Among the historic buildings is a 20th-century barn that houses 5 replica Durham Boats. Durham boats were large, open boats that were used to transport pig iron along the Delaware River at the time of the Revolution and these boats, along with the ferries and others, were used to transport soldiers, horses, and equipment across the river on the night of December 25–26, 1776. The replica boats are used each year when the nighttime crossing is reenacted in the park. Located 4.5 miles away in Solebury Township, Bucks County, Pennsylvania, is the park's northern section, the \"upper park.\" In its 100-acre area it contains (0.4 km2) Bowman's Hill Tower and the Thompson-Neely House, which was used as a military hospital during Washington's encampment in the area, and the graves of an estimated 40 to 60 soldiers who died there. The exact location of the graves is unknown, though they were partially unearthed during the construction of the nearby Delaware Canal in the early 19th century and during other nearby construction projects. Presently there are 23 memorial headstones as a reminder that the area is a gravesite. The lower park contains a visitor center, which was renovated from July 2011 to March 2013. The newly renovated visitor center was opened March 10, 2013. It features a small e...",
  "error": null,
  "fetched_at": "2026-01-24T20:37:19Z"
}
