{
  "search_query": "Butler Institute of American Art Youngstown museum",
  "found": true,
  "page_title": "Butler Institute of American Art",
  "page_url": "https://en.wikipedia.org/wiki/Butler_Institute_of_American_Art",
  "extract": "The Butler Institute of American Art (BIAA), located on Wick Avenue in Youngstown, Ohio, United States, was the first museum dedicated exclusively to American art. Established by local industrialist and philanthropist Joseph G. Butler, Jr., the museum has been operating pro bono since 1919. Dedicated in 1919, the original structure is a McKim, Mead and White work listed on the National Register of Historic Places. Among the most celebrated works in the Butler's permanent collection is Winslow Homer's Snap the Whip, a famed tribute to the era of the one-room schoolhouse. Winslow, however, painted two versions of Snap the Whip, with the other version residing in the Metropolitan Museum of Art. The two paintings differ, with the Butler's version of Snap the Whip having mountains in the background, while the Metropolitan's does not. In 2007, the museum acquired the Norman Rockwell painting Lincoln the Railsplitter for $1.6 million. The previous owner of the 84.5 by 44.5 inch painting was businessman and former presidential candidate Ross Perot. Other aspects of the nation's past are captured in a unique collection of paintings featuring southwestern Native Americans, which were once part of Joseph Butler's personal collection. Additional highlights include an iconic depiction of George Washington's wedding, William Gropper's celebrated Youngstown Strike, an interpretation of the area's violent 1937 Little Steel Strike, and Albert Bierstadt's The Oregon Trail, 1869. Meanwhile, the gallery of modern art features a striking, life-sized painting by Alfred Leslie titled, Americans: Youngstown, Ohio, which depicts personalities connected with the Butler as they appeared in the 1970s. The museum also holds a significant collection of works by the Abstract Expressionist painter Robert Motherwell. In recent years, the Butler has expanded significantly. A 19,000-square-foot (1,800 m2) south wing, the Beecher Center, was constructed in conjunction with Youngstown State University ...",
  "error": null,
  "fetched_at": "2026-01-17T23:04:14Z"
}
