{
  "search_query": "Sacramento History Museum Sacramento museum",
  "found": true,
  "page_title": "Sacramento River",
  "page_url": "https://en.wikipedia.org/wiki/Sacramento_River",
  "extract": "The Sacramento River (Spanish: Río Sacramento) is the principal river of Northern California in the United States and is the largest river in California. Rising in the Klamath Mountains, the river flows south for 400 miles (640 km) before reaching the Sacramento–San Joaquin River Delta and San Francisco Bay. The river drains about 26,500 square miles (69,000 km2) in 19 California counties, mostly within the fertile agricultural region bounded by the Coast Ranges and Sierra Nevada known as the Sacramento Valley, but also extending as far as the volcanic plateaus of Northeastern California. Historically, its watershed has reached as far north as south-central Oregon where the now, primarily, endorheic (closed) Goose Lake rarely experiences southerly outflow into the Pit River, the most northerly tributary of the Sacramento. The Sacramento and its wide natural floodplain were once abundant in fish and other aquatic creatures, notably one of the southernmost large runs of chinook salmon in North America. For about 12,000 years, humans have depended on the vast natural resources of the watershed, which had one of the densest Native American populations in California. The river has provided a route for trade and travel since ancient times. Hundreds of tribes sharing regional customs and traditions have inhabited the Sacramento Valley, first coming into contact with European explorers in the late 1700s. The Spanish explorer Gabriel Moraga named the river Rio de los Sacramentos in 1808, later shortened and anglicized into Sacramento. In the 19th century, gold was discovered on a tributary of the Sacramento River, starting the California Gold Rush and an enormous population influx to the state. Overland trails such as the California Trail and Siskiyou Trail guided hundreds of thousands of people to the gold fields. By the late part of the century mining had ceased to be a major part of the economy, and many immigrants turned to farming and ranching. Many populous communities...",
  "error": null,
  "fetched_at": "2026-01-24T20:23:48Z"
}
