{
  "search_query": "Shelburne Museum Shelburne museum",
  "found": true,
  "page_title": "Shelburne Museum",
  "page_url": "https://en.wikipedia.org/wiki/Shelburne_Museum",
  "extract": "Shelburne Museum is a museum of art, design, and Americana located in Shelburne, Vermont, United States. Over 150,000 works are exhibited in 39 exhibition buildings, 25 of which are historic and were relocated to the museum grounds. It is located on 45 acres (18 ha) near Lake Champlain. Impressionist paintings, folk art, quilts and textiles, decorative arts, furniture, American paintings, and an array of 17th- to 20th-century artifacts are on view. Shelburne is home to collections of 19th-century American folk art, quilts, 19th- and 20th-century decoys, and carriages. Electra Havemeyer Webb was a pioneering collector of American folk art, and founded Shelburne Museum in 1947. The daughter of Henry Osborne Havemeyer and Louisine Elder Havemeyer, important collectors of Impressionism, European and Asian art, she exercised an independent eye and passion for art, artifacts, and architecture celebrating a distinctly American aesthetic. When creating the museum, she took the step of collecting 18th and 19th century buildings from New England and New York in which to display the museum's holdings, relocating 20 historic structures to Shelburne. These include houses, barns, a meeting house, a one-room schoolhouse, a lighthouse, a jail, a general store, a covered bridge, and the 220-foot steamboat Ticonderoga. In Shelburne Mrs. Webb sought to create \"an educational project, varied and alive.\" Shelburne's collections are exhibited in a village-like setting of historic New England architecture, accented by a landscape that includes over 400 lilacs, a circular formal garden, herb and heirloom vegetable gardens, and perennial gardens. In 2013, the Pizzagalli Center for Art and Education was opened with two galleries, an auditorium, and a classroom, transforming the institution from seasonal (mid-May through October) to year-round operation. In 2023, the Native American Initiative was announced, aiming to construct a building to display and interpret both the materials already in...",
  "error": null,
  "fetched_at": "2026-01-24T20:39:52Z"
}
