{
  "search_query": "Baltimore Museum of Art Baltimore museum",
  "found": true,
  "page_title": "Baltimore Museum of Art",
  "page_url": "https://en.wikipedia.org/wiki/Baltimore_Museum_of_Art",
  "extract": "The Baltimore Museum of Art (BMA) in Baltimore, Maryland, is an art museum that was founded in 1914. The BMA's collection of 95,000 objects encompasses more than 1,000 works by Henri Matisse anchored by the Cone Collection of modern art, as well as one of the nation's finest holdings of prints, drawings, and photographs. The galleries currently showcase collections of art from Africa; works by established and emerging contemporary artists; European and American paintings, sculpture, and decorative arts; ancient Antioch mosaics; art from Asia, and textiles from around the world. The 210,000-square-foot (20,000 m2) museum is distinguished by a neoclassical building designed in the 1920s by American architect John Russell Pope and two landscaped gardens with 20th-century sculpture. The museum is located between Charles Village, to the east, Remington, to the south, Hampden, to the west; and south of the Roland Park neighborhoods, immediately adjacent to the Homewood campus of Johns Hopkins University, though the museum is an independent institution and not affiliated with the university. The highlight of the museum is the Cone Collection, brought together by Baltimore sisters Claribel (1864–1929) and Etta Cone (1870–1949). Accomplished collectors, the sisters amassed a wealth of works by artists including Henri Matisse, Pablo Picasso, Paul Cézanne, Edgar Degas, Paul Gauguin, Vincent van Gogh, and Pierre-Auguste Renoir, nearly all of which were donated to the museum. The museum is also home to 18,000 works of French mid-19th-century art from the George A. Lucas collection, which has been acclaimed by the museum as a cultural \"treasure\" and \"among the greatest single holdings of French art in the country.\" The BMA is currently led by Dr. Asma Naeem, who was appointed in January 2023 by the Board of Trustees after a 10-month international search. She joined the BMA in 2018 as the Eddie C. and C. Sylvia Brown Chief Curator and previously held curatorial positions at the Sm...",
  "error": null,
  "fetched_at": "2026-01-17T23:02:10Z"
}
