{
  "search_query": "Baltimore Museum of Industry Baltimore museum",
  "found": true,
  "page_title": "Baltimore",
  "page_url": "https://en.wikipedia.org/wiki/Baltimore",
  "extract": "Baltimore, also known as Baltimore City, is the most populous city in the U.S. state of Maryland. It is the 30th-most populous U.S. city with a population of 585,708 at the 2020 census and estimated at 568,271 in 2024, while the Baltimore metropolitan area at 2.86 million residents is the 22nd-largest metropolitan area in the nation. The city is also part of the Washington–Baltimore combined statistical area, which had a population of 9.97 million in 2020. Baltimore was designated as an independent city by the Constitution of Maryland in 1851. Though not located under the jurisdiction of any county in the state, it forms part of the Central Maryland region together with the surrounding county that shares its name. The land that is present-day Baltimore was once used as hunting ground by Paleo-Indians. In the early 1600s, the Susquehannock began to hunt there. People from the Province of Maryland established the Port of Baltimore in 1706 to support the tobacco trade with Europe and established the Town of Baltimore in 1729. During the American Revolutionary War, the Second Continental Congress briefly moved its deliberations to the Henry Fite House from December 1776 to February 1777 prior to the capture of Philadelphia to British troops, which permitted Baltimore to serve briefly as the nation's capital before it returned to Philadelphia. The Battle of Baltimore was pivotal during the War of 1812, culminating in the British bombardment of Fort McHenry, during which Francis Scott Key wrote a poem that became \"The Star-Spangled Banner\", which was designated as the national anthem in 1931. During the Pratt Street Riot of 1861, the city was the site of some of the earliest violence associated with the American Civil War. The Baltimore and Ohio Railroad, the nation's oldest, was built in 1830 and reinforced Baltimore's status as a transportation hub, giving producers in the Midwest and Appalachia access to the city's port. Baltimore's Inner Harbor was the second-leading ...",
  "error": null,
  "fetched_at": "2026-01-24T20:30:34Z"
}
