{
  "search_query": "South Carolina State Museum Columbia museum",
  "found": true,
  "page_title": "South Carolina State Museum",
  "page_url": "https://en.wikipedia.org/wiki/South_Carolina_State_Museum",
  "extract": "The South Carolina State Museum is a museum dedicated to the history of South Carolina. It has four floors of permanent and changing exhibits, a digital dome planetarium, 4D interactive theater, and an observatory (all opened in 2014). The State Museum is located along the banks of the Congaree River in downtown Columbia, South Carolina. It is the largest museum in the state, and is a Smithsonian Affiliate and part of the American Alliance of Museums. Positioned on an old shipping canal (Columbia Canal) that dates back to pre-Civil War times, the museum is widely recognized as a resource for South Carolina history and lifestyle. The museum opened on October 29, 1988, and is housed in what it calls its largest artifact: the former Columbia Mills Building, listed on the National Register of Historic Places in 1982. When the mill opened in 1894, manufacturing cotton duck cloth (a canvas-like material), it was the first completely electric textile mill in the world. It was also the first major industrial installation for the General Electric corporation. On certain levels of the museum, the original flooring has been kept intact, distinguishable by the textile brads and rings (that carried the threads during the spinning process) that became embedded in the floor while it was still being used as a mill. The South Carolina Confederate Relic Room & Military Museum is located within the Columbia Mills Building and is the oldest museum exhibit (est. 1896) in Columbia. The museum represents four distinct sections of South Carolina history: art, cultural history, science and technology, and natural history. Exhibits include life-size replicas of the Best Friend of Charleston- the first American-built locomotive in 1830, and the Civil War's H.L. Hunley, the first submarine to sink an enemy ship in combat. The second floor on natural history is notable for its recreation of a 3.6-million-year-old megalodon, named Finn, suspended mid-air just around a corner, and for a life-size...",
  "error": null,
  "fetched_at": "2026-01-24T20:37:56Z"
}
