{
  "search_query": "Concord Museum Concord museum",
  "found": true,
  "page_title": "Battles of Lexington and Concord",
  "page_url": "https://en.wikipedia.org/wiki/Battles_of_Lexington_and_Concord",
  "extract": "The Battles of Lexington and Concord on April 19, 1775, were the first major military actions between the British Army and Patriot militias from British America's Thirteen Colonies during the American Revolutionary War. The opposing forces fought day-long running battles in Middlesex County in the Province of Massachusetts Bay, in the towns of Lexington, Concord, Lincoln, Menotomy (present-day Arlington), and Cambridge. After the Boston Tea Party (1773), the British Parliament passed the Intolerable Acts (early 1774), including the restrictive Massachusetts Government Act. Patriot (Colonial) leaders in Suffolk County, Massachusetts, adopted the Suffolk Resolves in resistance to the acts. The leaders formed a Patriot provisional government, the Massachusetts Provincial Congress, and called for local militias to train for possible hostilities. The Provincial Congress effectively controlled the colony outside of Boston. On September 17, the First Continental Congress endorsed the Suffolk Resolves. In response, in February 1775, the British government declared Massachusetts to be in a state of rebellion. On April 18, 1775, about 700 British Regulars in Boston, under Lieutenant Colonel Francis Smith, received secret orders to capture and destroy colonial military supplies reportedly stored at Concord. Through effective intelligence gathering, Patriot leaders received word weeks before the British expedition that their supplies might be at risk and had moved most of them to other locations. On the night before the battles, several riders, including Paul Revere, William Dawes and Samuel Prescott, warned area militias of the British plans and approaching British Army expedition from Boston. The first shots between Patriot militiamen and Regulars at Lexington were fired at sunrise on April 19. Eight militiamen were killed and ten wounded. Only one British soldier was wounded. The outnumbered militia quickly fell back and the Regulars proceeded to Concord, where they split in...",
  "error": null,
  "fetched_at": "2026-01-24T20:29:39Z"
}
