{
  "search_query": "Catalina Island Museum Avalon museum",
  "found": true,
  "page_title": "Santa Catalina Island (California)",
  "page_url": "https://en.wikipedia.org/wiki/Santa_Catalina_Island_(California)",
  "extract": "Santa Catalina Island (Spanish: Isla Santa Catalina; Tongva: Pimu) often shortened to Catalina Island or Catalina, is a rocky island, part of the Channel Islands, off the coast of Southern California in the Gulf of Santa Catalina. The island covers an area of about 75 square miles (194 square kilometers), measuring 22 miles (35 km) long and 8 miles (13 km) across at its widest point. The island's highest peak is Mount Orizaba, rising to an elevation of 2,097 feet (639 meters). The island is situated in the Pacific Ocean, 29 mi (47 km) south-southwest of Long Beach, California. Politically, Catalina Island is part of Los Angeles County in District 4. Most of the island's land is unincorporated and is thus governed by the county. Catalina was originally inhabited and used by many different Southern California Tribes. The first European colonists to arrive on the island claimed it for the Spanish Empire. Over the years, territorial claims to the island transferred ownership to Mexico and then to the United States of America. The island was used for otter hunting and gold-digging, before successfully being developed into a tourist destination in the 1920s. Since the 1970s, most of the island has been administered by the Catalina Island Conservancy. In the 2020 census, Santa Catalina Island's population was 3,715 people, 93 percent of whom live in the island's only incorporated city, Avalon. The second center of population is the unincorporated village of Two Harbors at the island's isthmus. Development also occurs at the smaller settlements of Rancho Escondido and Middle Ranch. The remaining population is scattered over the island between the two population centers. Today, it can be reached via ferry services from mainland California, with the most common departure point being the city of Long Beach. The island also has an airport, the Catalina Airport in the Sky. Catalina Island is known for its diverse ecosystems, which include coastal scrub, chaparral, oak woodlands,...",
  "error": null,
  "fetched_at": "2026-01-24T20:22:49Z"
}
