{
  "search_query": "John and Mable Ringling Museum of Art Sarasota museum",
  "found": true,
  "page_title": "John and Mable Ringling Museum of Art",
  "page_url": "https://en.wikipedia.org/wiki/John_and_Mable_Ringling_Museum_of_Art",
  "extract": "The John and Mable Ringling Museum of Art is the official art museum of the state of Florida, located in Sarasota, Florida, United States. It was established in 1927 as the legacy of Mable Burton Ringling and John Ringling for the people of Florida. Florida State University assumed governance of the museum in 2000. The institution offers 21 galleries of European paintings as well as Cypriot antiquities and Asian, American, and contemporary art. The museum's art collection consists of more than 10,000 objects, including paintings, sculpture, drawings, prints, photographs, and decorative arts from ancient through contemporary periods. Notable holdings include 16th–20th-century European paintings, especially a significant collection of works by Peter Paul Rubens. Other artists represented include Benjamin West, Marcel Duchamp, Mark Kostabi, Diego Velázquez, Paolo Veronese, Rosa Bonheur, Gianlorenzo Bernini, Giuliano Finelli, Lucas Cranach the Elder, Frans Hals, Nicolas Poussin, Joseph Wright of Derby, Thomas Gainsborough, Eugène Boudin, and Benedetto Pagni. In all, more than 150,000 square feet (14,000 m2) have been added to the campus, which includes the art museum, the Circus Museum, Ca' d'Zan, and the historic Asolo Theater. New additions to the campus include the McKay Visitor's Pavilion, the Kotler-Coville Glass Pavilion exhibiting studio glass art, the Johnson-Blalock Education Building housing The Ringling Art Library and Cuneo Conservation Lab, the Tibbals Learning Center complete with a miniature circus, the Searing Wing, a 30,000-square-foot (2,800 m2) gallery for special exhibitions attached to the art museum, the Chao Center for Asian Art, and the Monda Gallery for Contemporary Art.",
  "error": null,
  "fetched_at": "2026-01-17T23:01:10Z"
}
