{
  "search_query": "GumTree Museum of Art Tupelo museum",
  "found": true,
  "page_title": "Tupelo, Mississippi",
  "page_url": "https://en.wikipedia.org/wiki/Tupelo,_Mississippi",
  "extract": "Tupelo ( TOO-pə-loh) is a city in and the county seat of Lee County, Mississippi, United States. Founded in 1860, the population was 37,923 at the 2020 census. It is the seventh-most populous city in Mississippi and is considered a commercial, industrial, and cultural hub of northern Mississippi. Tupelo was incorporated in 1870. The area had earlier been settled as \"Gum Pond\" along the Mobile and Ohio Railroad. On February 7, 1934, Tupelo became the first city to receive power from the Tennessee Valley Authority, thus giving it the nickname \"The First TVA City\". Much of the city was devastated by a major tornado in 1936 that still ranks as one of the deadliest tornadoes in American history. Following electrification, Tupelo boomed as a regional manufacturing and distribution center and was once considered a hub of the American furniture manufacturing industry. Although many of Tupelo's manufacturing industries have declined since the 1990s, the city has continued to grow due to strong healthcare, retail, and financial service industries. Tupelo is the smallest city in the United States that is the headquarters of more than one bank with over $10 billion in assets. Tupelo has a deep connection to Mississippi's music history, being known as the birthplace of Elvis Presley. The city is home to multiple art and cultural institutions, including the Elvis Presley Birthplace and the 10,000-seat Cadence Bank Arena, the largest multipurpose indoor arena in Mississippi. Tupelo is the only city in the Southern United States to be named an All-America City five times, most recently in 2015. Its Main Street program, Downtown Tupelo Main Street Association, was the winner of the national Main Street's Great American Main Street Award in 2020. The Tupelo micropolitan area contains Lee, Itawamba, and Pontotoc counties and had a population of 140,081 in 2017.",
  "error": null,
  "fetched_at": "2026-01-17T23:02:56Z"
}
