{
  "search_query": "Mutter Museum Philadelphia museum",
  "found": true,
  "page_title": "Mütter Museum",
  "page_url": "https://en.wikipedia.org/wiki/M%C3%BCtter_Museum",
  "extract": "The Mütter Museum is a medical history and science museum located in the Center City Philadelphia. It contains a collection of anatomical and pathological specimens, wax models, and antique medical equipment. The museum is part of The College of Physicians of Philadelphia. The original purpose of the museum, founded with a gift from Dr. Thomas Dent Mütter on December 11, 1858, was for the education of medical professionals, medical students, and invited guests of College Fellows, and did not become open to non-Fellows until the mid-1970s. The College of Physicians of Philadelphia is itself not a teaching organization, but rather a member organization or \"scientific body dedicated to the advancement of science and medicine\". The museum has a collection of over 37,000 specimens, of which about 10% were on display as of 2023. This does not include the large literary collection contained within the Historical Medical Library, which is also housed within the College of Physicians of Philadelphia. Collection items, artifacts, and specimens were acquired globally, and as Ella Wade (curator from 1939 to 1957) says, \"The Mütter Museum Committee, as the minutes show, proceeded to spend Dr. Mütter's money like sailors on shore leave\". In other words, some museum material was purchased by College Fellows as they travelled the world, and they were reimbursed for each purchase and any expenses incurred in connection with acquisitions. Other collection items were donated from the private collections of physicians. In October 2023, the Mütter Museum was awarded a grant from the Pew Center for Arts and Heritage to research the history of the collection of human remains to better understand how each body and specimen came into the museum collections and to conduct discussions with members of the public to discuss the future of the museum. The first Town Hall discussion took place on November 17, 2023.",
  "error": null,
  "fetched_at": "2026-01-24T20:37:33Z"
}
