{
  "search_query": "Cultural Council of Palm Beach County WEST PALM BEACH museum",
  "found": true,
  "page_title": "Palm Beach, Florida",
  "page_url": "https://en.wikipedia.org/wiki/Palm_Beach,_Florida",
  "extract": "Palm Beach is an incorporated town in Palm Beach County, Florida, United States. Located on a barrier island in east-central Palm Beach County, the town is separated from West Palm Beach and Lake Worth Beach by the Intracoastal Waterway to its west and a small section of the Intracoastal Waterway and South Palm Beach to its south. It is part of the South Florida metropolitan area. As of the 2020 census, Palm Beach had a year-round population of 9,245. White Americans began to live in the area as early as 1872. Elisha Newton \"Cap\" Dimick, later the town's first mayor, established Palm Beach's first hotel, the Cocoanut Grove House, in 1880, but Standard Oil tycoon Henry Flagler became instrumental in transforming the island's tropical landscape into a winter resort for the wealthy. Flagler and his workers constructed the Royal Poinciana Hotel in 1894, The Breakers in 1896, and Whitehall in 1902; extended the Florida East Coast Railway southward to the area by 1894; and developed a separate city to house the hotel workers and other laborers. This later became West Palm Beach. Addison Mizner also contributed significantly to the town's history, designing 67 structures between 1919 and 1924, including El Mirasol, the Everglades Club, La Querida, the William Gray Warden House, and Via Mizner, which is a section of Worth Avenue. Forbes reported in 2017 that Palm Beach had at least 30 billionaires, with the town ranking as the 27th-wealthiest place in the United States in 2016, according to Bloomberg News. Many high-profile individuals have resided in the town, including United States presidents John F. Kennedy and Donald Trump. Palm Beach is known for upscale shopping districts, such as Worth Avenue, Royal Poinciana Plaza, and the Royal Poinciana Way Historic District.",
  "error": null,
  "fetched_at": "2026-01-24T20:26:14Z"
}
