{
  "search_query": "Taller Puertorriqueno Philadelphia museum",
  "found": true,
  "page_title": "Puerto Rico",
  "page_url": "https://en.wikipedia.org/wiki/Puerto_Rico",
  "extract": "Puerto Rico (abbreviated PR), officially the Commonwealth of Puerto Rico, is a self-governing Caribbean archipelago and island organized as an unincorporated territory of the United States under the designation of commonwealth. Located about 1,000 miles (1,600 km) southeast of Miami, Florida, between the Dominican Republic in the Greater Antilles and the U.S. Virgin Islands in the Lesser Antilles, it consists of the eponymous main island and numerous smaller islands, including Vieques, Culebra, and Mona. With approximately 3.2 million residents, it is divided into 78 municipalities, of which the most populous is the capital municipality of San Juan, followed by those within the San Juan metropolitan area. Spanish and English are the official languages of the government, though Spanish predominates. Puerto Rico was settled by a succession of Amerindian peoples beginning 2,000 to 4,000 years ago; these included the Ortoiroid, Saladoid, and Taíno. It was claimed by Spain following the arrival of Christopher Columbus in 1493 and subsequently colonized by Juan Ponce de León in 1508. Puerto Rico was contested by other European powers into the 18th century but remained a Spanish possession for the next 400 years. The decline of the Indigenous population, followed by an influx of Spanish settlers, primarily from the Canary Islands and Andalusia, and African slaves vastly changed the cultural and demographic landscape of the archipelago. Within the Spanish Empire, Puerto Rico played a secondary but strategically significant role compared to larger and wealthier colonies like Peru and New Spain. By the late 19th century, a distinct Puerto Rican identity began to emerge, centered on a fusion of European, African, and Indigenous elements. In 1898, following the Spanish–American War, Puerto Rico was acquired by the United States. Puerto Ricans have been U.S. citizens since 1917 and can move freely between the archipelago and the mainland. However, residents of Puerto Rico are di...",
  "error": null,
  "fetched_at": "2026-01-24T20:37:15Z"
}
