{
  "search_query": "William Benton Museum of Art, University of Connecticut Storrs museum",
  "found": true,
  "page_title": "William Benton Museum of Art",
  "page_url": "https://en.wikipedia.org/wiki/William_Benton_Museum_of_Art",
  "extract": "The William Benton Museum of Art is a public fine arts museum located on the University of Connecticut's main campus in Storrs, Connecticut. The Benton houses a permanent collection of over 6,500 artistic works and hosts special exhibitions, concerts, campus art walks, and other events. The museum is named in honor of the prominent U.S. senator and university trustee William Benton. The Benton has a cafe (The Beanery) and a gift store. In 2024 the museum opened a new education center. Admission to the museum is free for all. Constructed in 1920 and used for twenty years as University's main dining hall, the Benton opened officially as an art museum in 1967. The museum building is designed in the Collegiate Gothic style and is one of the core campus buildings in the University of Connecticut Historic District-Connecticut Agricultural School, which is listed on the National Register of Historic Places. The Benton's collection originated with former Connecticut Agricultural College president Charles Lewis Beach, who began the college's art collection, bequeathed his personal collection of American art to the college in 1933, and left a trust fund for the college to continue acquiring art. Developed over the ensuing decades, the museum's permanent collection includes works by Childe Hassam, Henry Ward Ranger, Emil Carlson, Charles Harold Davis, Ernest Lawson, Ellen Emmet Rand, Guy Wiggins, Mary Cassatt, Thomas Hart Benton, Fairfield Porter, George Bellows, Gustav Klimt, Rembrandt Peale, Georges Braque, Edward Burne-Jones, Reginald Marsh, Käthe-Kollwitz, Arthur Bowen Davies, Maurice Prendergast and Kiki Smith. The collection is strongest in modern and American art, but some works date to the Renaissance, and exhibits are highly diverse.",
  "error": null,
  "fetched_at": "2026-01-24T20:25:47Z"
}
