{
  "search_query": "Green Hill Center for North Carolina Art Greensboro museum",
  "found": true,
  "page_title": "Greensboro, North Carolina",
  "page_url": "https://en.wikipedia.org/wiki/Greensboro,_North_Carolina",
  "extract": "Greensboro ( ; locally ) is a city in Guilford County, North Carolina, United States, and its county seat. Its population was 299,035 in the 2020 census and estimated at 307,381 in 2024, making it the third-most populous city in North Carolina and the 69th-most populous city in the U.S. The Greensboro–High Point metropolitan area has an estimated 801,000 residents. It is the most populous city in North Carolina's Piedmont Triad region, home to about 1.7 million residents. In 1808, Greensboro was planned around a central courthouse square to succeed Guilford Court House as the county seat. The county courts were thus placed closer to the county's geographical center, a location more easily reached at the time by the majority of the county's citizens, who traveled by horse or on foot. Three major Interstate Highways (Interstate 40, Interstate 85, and Interstate 73) in the Piedmont region of central North Carolina were built to intersect at this city. Among Greensboro's many notable attractions, some of the most popular are the Greensboro Science Center, the International Civil Rights Museum (site of the historic Woolworth's sit-ins), the Steven Tanger Center for the Performing Arts, the Weatherspoon Art Museum, the Greensboro Symphony, and the Greensboro Ballet. Annual events in the city include the North Carolina Folk Festival, First Fridays in Downtown Greensboro, Fun Fourth of July Festival, North Carolina Comedy Festival, and Winter Wonderlights. From 2015 to 2017, Greensboro hosted the National Folk Festival. The Greensboro Coliseum Complex hosts a variety of major sporting events, concerts, and other events, including the ACC men's basketball tournament and women's basketball tournament. Local professional teams include the Greensboro Grasshoppers of the South Atlantic Baseball League, the Greensboro Swarm of the NBA G League, the Greensboro Gargoyles of the ECHL, and the semi-professional Carolina Dynamo soccer club of USL League Two. Amateur teams include Gree...",
  "error": null,
  "fetched_at": "2026-01-24T20:32:38Z"
}
