{
  "search_query": "Museum of Art, Shaw Center for the Arts, Louisiana State University Baton Rouge museum",
  "found": true,
  "page_title": "Baton Rouge, Louisiana",
  "page_url": "https://en.wikipedia.org/wiki/Baton_Rouge,_Louisiana",
  "extract": "Baton Rouge ( BAT-ən ROOZH; French: Bâton-Rouge, pronounced [bɑtɔ̃ ʁuʒ] ) is the capital city of the U.S. state of Louisiana. It had a population of 227,470 at the 2020 United States census, making it Louisiana's second-most populous city. It is the seat of Louisiana's most populous parish, East Baton Rouge Parish, and the center of Louisiana's second-largest metropolitan area, Greater Baton Rouge, which had 870,569 residents in 2020. Located on the eastern bank of the Mississippi River, the Baton Rouge area owes its historical importance to its strategic site upon the Istrouma Bluff, the first natural bluff upriver from the Mississippi River Delta at the Gulf of Mexico. This allowed the development of a business quarter safe from seasonal flooding. In addition, it built a levee system stretching from the bluff southward to protect the riverfront and low-lying agricultural areas. Baton Rouge has developed as a culturally rich center, settled by immigrants from European nations and African peoples brought to North America as slaves or indentured servants. It was ruled by seven different nations: the French, Spanish and British in the colonial era; briefly the Republic of West Florida; the United States as a territory and a state; the Confederate States of America; and the United States again since the end of the American Civil War. The city developed as a multicultural region practicing many religious traditions from Catholicism to Protestantism and Louisiana Voodoo. Baton Rouge is a major industrial, petrochemical, medical, research, motion picture, and technology center of the Southern United States. It is the location of Louisiana State University, the LSU system's flagship university and the state's largest institution of higher education. It is also the location of Southern University, the flagship institution of the Southern University System—the nation's only historically black college system. The Port of Greater Baton Rouge is the tenth-largest in the U.S. by...",
  "error": null,
  "fetched_at": "2026-01-24T20:29:24Z"
}
