{
  "search_query": "Aspen Art Museum Aspen museum",
  "found": true,
  "page_title": "Aspen, Colorado",
  "page_url": "https://en.wikipedia.org/wiki/Aspen,_Colorado",
  "extract": "Aspen is the home rule city that is the county seat of, and most populous municipality in, Pitkin County, Colorado, United States. The city population was 7,004 at the 2020 United States census. Aspen is in a remote area of the Rocky Mountains' Sawatch Range and Elk Mountains, along the Roaring Fork River at an elevation just below 8,000 feet (2,400 m) on the Western Slope, 11 miles (18 km) west of the Continental Divide. Aspen is now a part of the Rifle, CO Micropolitan Statistical Area. Founded as a mining camp during the Colorado Silver Boom and later named Aspen for the abundance of aspen trees in the area, the city boomed during the 1880s, its first decade. The boom ended when the Panic of 1893 led to a collapse of the silver market. For the next half-century, known as \"the quiet years\", the population steadily declined, reaching a nadir of fewer than 1000 by 1930. Aspen's fortunes recovered in the mid-20th century when neighboring Aspen Mountain was developed into a ski resort, and industrialist Walter Paepcke bought many properties in the city in the 1950s and redeveloped them. Today it is home to three institutions, two of which Paepcke helped found, having international importance: the Aspen Music Festival and School, the Aspen Institute, and the Aspen Center for Physics. In the late 20th century, the town became a popular retreat for celebrities. Gonzo journalist Hunter S. Thompson worked out of a downtown hotel and ran unsuccessfully for county sheriff. Singer John Denver wrote two songs about Aspen after settling there. Both figures popularized Aspen among the counter-cultural youth of the 1970s as an ideal place to live, and the city continued to grow even as it gained notoriety for some of the era's hedonistic excesses (particularly its drug culture). Aspen remains popular as a year-round destination for locals, second-home buyers and tourists. Outdoor recreation in the surrounding White River National Forest serves as a summertime counterpart to the c...",
  "error": null,
  "fetched_at": "2026-01-24T20:25:12Z"
}
