{
  "search_query": "Madison Museum of Contemporary Art Madison museum",
  "found": true,
  "page_title": "945 Madison Avenue",
  "page_url": "https://en.wikipedia.org/wiki/945_Madison_Avenue",
  "extract": "945 Madison Avenue, also known as the Breuer Building and formerly the Whitney Museum Building, is located on the Upper East Side of Manhattan, New York City. Built from 1964 to 1966 as the third home of the Whitney Museum of American Art, it subsequently held a branch of the Metropolitan Museum of Art and the Frick Collection before becoming the headquarters of Sotheby's auction house. Marcel Breuer and Hamilton P. Smith were the primary architects, with Michael H. Irving as the consulting architect and Paul Weidlinger as the structural engineer. 945 Madison Avenue was Breuer's most significant design in New York City and one of the most important of his career. It was also his first museum commission, and his first and only remaining work in Manhattan. The building sits on a 13,000-square-foot (1,200 m2) site at Madison Avenue and 75th Street that was once occupied by six 1880s rowhouses. The building is usually described as part of the Modernist art and architecture movement, and is often described as part of the narrower Brutalist style. The structure has exterior faces of variegated granite and exposed concrete and makes use of stark angular shapes, including cantilevered floors progressively extending atop its entryway, resembling an inverted ziggurat. Ideas for the building began in the 1960s, when the Whitney Museum sought a new building three times the size of its existing facility. The Whitney occupied the building until 2014, during which, the surrounding area evolved from an elegant residential neighborhood to an upscale commercial hub. In 2016, the museum building was leased to the Metropolitan Museum of Art and became the Met Breuer; the new museum contributed to the neighborhood's transformation but closed in 2020. From 2021 to March 2024, the building became the Frick Madison, the temporary home of the Frick Collection while the Henry Clay Frick House underwent renovation. In 2023, Sotheby's purchased 945 Madison Avenue and announced plans to use the...",
  "error": null,
  "fetched_at": "2026-01-17T23:05:26Z"
}
