{
  "search_query": "Anna Maria Island Historical Museum Anna Maria museum",
  "found": true,
  "page_title": "Antonio López de Santa Anna",
  "page_url": "https://en.wikipedia.org/wiki/Antonio_L%C3%B3pez_de_Santa_Anna",
  "extract": "Antonio de Padua María Severino López de Santa Anna y Pérez (21 February 1794 – 21 June 1876), often known as Santa Anna, was a Mexican general, politician, and caudillo who served as the 8th president of Mexico on multiple occasions between 1833 and 1855. He also served as vice president of Mexico from 1837 to 1839. He was a controversial and pivotal figure in Mexican politics during the 19th century, to the point that he has been called an \"uncrowned monarch\", and historians often refer to the three decades after Mexican independence as the \"Age of Santa Anna\". Santa was in charge of the garrison at Veracruz at the time Mexico won independence in 1821. He would go on to play a notable role in the fall of the First Mexican Empire, the fall of the First Mexican Republic, the promulgation of the Constitution of 1835, the establishment of the Centralist Republic of Mexico, the Texas Revolution, the Pastry War, the promulgation of the Constitution of 1843, and the Mexican–American War. He became well known in the United States due to his role in the Texas Revolution and in the Mexican–American War. Throughout his political career, Santa Anna was known for switching sides in the recurring conflict between the Liberal Party and the Conservative Party. He managed to play a prominent role in both discarding the liberal Constitution of 1824 in 1835 and in restoring it in 1847. He came to power as a liberal twice in 1832 and in 1847 respectively, both times sharing power with the liberal statesman Valentín Gómez Farías, and both times Santa Anna overthrew Gómez Farías after switching sides to the conservatives. Santa Anna was also known for his ostentatious and dictatorial style of rule, making use of the military to dissolve Congress multiple times and referring to himself by the honorific title of His Most Serene Highness. His intermittent periods of rule, which lasted from 1832 to 1853, witnessed the loss of Texas, a series of military failures during the Mexican–American...",
  "error": null,
  "fetched_at": "2026-01-24T20:26:10Z"
}
