{
  "search_query": "New Brunswick Museum Saint John museum",
  "found": true,
  "page_title": "Saint John, New Brunswick",
  "page_url": "https://en.wikipedia.org/wiki/Saint_John,_New_Brunswick",
  "extract": "Saint John (French: Saint-Jean) is a seaport city located on the Bay of Fundy in the province of New Brunswick, Canada. It is Canada's oldest incorporated city, established by royal charter on May 18, 1785, during the reign of George III. The Port of Saint John is Canada's third-largest by tonnage with a cargo base that includes dry and liquid bulk, break bulk, containers, and cruise. The city has a strong industrial base, including oil refining and manufacturing, as well as significant finance and tourism sectors and research institutions such as the New Brunswick Museum and the University of New Brunswick. Saint John was the most populous city in New Brunswick for more than 230 years until the 2016 census, when it was overtaken by Moncton. It is currently the second-largest city in the province, with a population of 69,895 over an area of 315.59 km2 (121.85 sq mi). French explorer Samuel de Champlain landed at Saint John Harbour on June 24, 1604, the feast of St. John the Baptist, and named the Saint John River in his honour; the indigenous Mi'kmaq and Wolastoqiyik peoples called the river \"Wolastoq\". The Saint John area was an important location for trade and defence in Acadia during the French colonial era, and Fort La Tour, in the city's harbour, was a pivotal battleground during the Acadian Civil War. After more than a century of ownership disputes between the French and English over the land surrounding Saint John, the British government deported the Acadians in 1755 following the destruction of Fort Menagoueche, which was reconstructed as Fort Frederick. Following the pillaging and burning of Fort Frederick by American privateers, Fort Howe was constructed across the river above the harbour in 1779. In 1785, the City of Saint John was established by uniting the two communities of Parr-town and Carleton on opposite sides of the harbour after the arrival of thousands of refugees from the newly founded United States who wished to remain British after the Americ...",
  "error": null,
  "fetched_at": "2026-01-24T20:41:24Z"
}
