{
  "search_query": "Santa Barbara Museum of Art Santa Barbara County museum",
  "found": true,
  "page_title": "Santa Barbara, California",
  "page_url": "https://en.wikipedia.org/wiki/Santa_Barbara,_California",
  "extract": "Santa Barbara (Spanish: Santa Bárbara, meaning 'Saint Barbara') is a coastal city in Santa Barbara County, California, of which it is also the county seat. Situated on a south-facing section of coastline, the longest such section on the West Coast of the United States excepting Alaska, the city lies between the steeply rising Santa Ynez Mountains and the Pacific Ocean. Santa Barbara's climate is often described as Mediterranean, and the city has been dubbed \"The American Riviera\". According to the 2020 U.S. census, the city's population was 88,665. In addition to being a popular tourist and resort destination, the city has a diverse economy that includes a large service sector, education, technology, health care, finance, agriculture, manufacturing, and local government. In 2004, the service sector accounted for 35% of local employment. In 2024, the biggest employer in Santa Barbara County was government, followed by private education and healthcare, then leisure and hospitality. Together, these accounted for 50.5% of all employment. Area institutions of higher learning include the University of California, Santa Barbara, Santa Barbara City College, Westmont College, The Colleges of Law, and Antioch University Santa Barbara. The city is served by Santa Barbara Municipal Airport and train service is provided by Amtrak, which operates the Pacific Surfliner, which runs from San Diego to San Luis Obispo. The Santa Barbara area is connected via U.S. Highway 101 to Los Angeles 100 mi (160 km) to the southeast and San Francisco 325 mi (525 km) to the northwest. Behind the city, in and beyond the Santa Ynez Mountains, is the Los Padres National Forest, which contains several remote wilderness areas. Channel Islands National Park and Channel Islands National Marine Sanctuary are located approximately 20 miles (30 km) offshore.",
  "error": null,
  "fetched_at": "2026-01-17T23:00:09Z"
}
