{
  "search_query": "Longue Vue House and Gardens New Orleans museum",
  "found": true,
  "page_title": "Longue Vue House and Gardens",
  "page_url": "https://en.wikipedia.org/wiki/Longue_Vue_House_and_Gardens",
  "extract": "Longue Vue House and Gardens, also known as Longue Vue, is a historic house museum and associated gardens in the Lakewood neighborhood of New Orleans, Louisiana, United States. The former home of philanthropists Edgar Stern and Edith Rosenwald Stern (daughter of Julius Rosenwald), the current house is the second on the property. The original house and gardens began in 1924. In 1934, landscape architect Ellen Biddle Shipman began to work with the Sterns on the designs of their gardens. Through the re-working of the gardens the Sterns decided that their house did not allow them to fully enjoy their new grounds, and the original house was subsequently moved and a new one erected in its place starting in 1939, completed in 1942. This new house was designed by architects William and Geoffrey Platt whose father, Charles A. Platt, was Shipman's mentor. The four facades of the house have four different appearances and out each of the four sides there is a different garden. It has 20 rooms on three stories, with original furnishings. The gardens include Arecaceae, Asclepias tuberosa, azaleas, caladium, Callicarpa americana, camellia, Canna, Chionanthus retusus, chrysanthemum, crape myrtle, cyclamen, Delphinium, Ficus carica, Gossypium, hydrangea, Koelreuteria bipinnata, Louisiana irises, Lycoris aurea, Narcissus, Passiflora incarnata, Phytolacca americana, Euphorbia pulcherrima, roses, Stigmaphyllon ciliatum, tulips, vitex, and Zingiber zerumbet. Longue Vue was listed on the National Register of Historic Places in 1991, and was declared a National Historic Landmark in 2005. It was deemed nationally significant for its association with Shipman, and as the only major work of Shipman's where she exerted complete creative control over the landscape. Following damage by Hurricane Katrina, volunteer and staff labor later enabled the house to reopen for tours.",
  "error": null,
  "fetched_at": "2026-01-24T20:29:15Z"
}
