{
  "search_query": "Los Angeles County Museum of Art Los Angeles museum",
  "found": true,
  "page_title": "Los Angeles International Airport",
  "page_url": "https://en.wikipedia.org/wiki/Los_Angeles_International_Airport",
  "extract": "Los Angeles International Airport (IATA: LAX, ICAO: KLAX, FAA LID: LAX) is the primary international airport serving Los Angeles and its surrounding metropolitan area, in the U.S. state of California. LAX is located in the Westchester neighborhood of the city of Los Angeles, 18 miles (29 km; 16 nmi) southwest of downtown Los Angeles, with the commercial and residential areas of Westchester to the north, the city of El Segundo to the south, and the city of Inglewood to the east. LAX is the closest airport to the Westside and the South Bay. The airport is operated by Los Angeles World Airports (LAWA), a branch of the Los Angeles city government, that also operates the Van Nuys Airport for general aviation. The airport covers 3,500 acres (1,400 ha) of land and has four parallel runways. In 2023, LAX handled 75,050,875 passengers, making it the world's eleventh-busiest airport, according to the Airports Council International rankings. In 2024, LAX served 76,587,980 passengers, a 2.04% increase from 2023. As the largest and busiest international airport on the West Coast of the United States, LAX is a major international gateway for the country, serving as a connection point for passengers traveling internationally (such as East and Southeast Asia, Australasia, Mexico, and Central America). The airport holds the record for the world's busiest origin and destination airport, because relative to other airports, many more travelers begin or end their trips in Los Angeles than use it as a connection. In 2019, LAWA reported approximately 88% of travelers at LAX were origination and destination passengers, and 12% were connecting. It is also the only airport to rank among the top five U.S. airports for both passenger and cargo traffic. LAX serves as a hub, focus city, or operating base for more passenger airlines than any other airport in the United States. Although LAX is the busiest airport in the Greater Los Angeles area, several other airports serve the region including Bu...",
  "error": null,
  "fetched_at": "2026-01-24T20:22:33Z"
}
