{
  "search_query": "Newark Museum Newark museum",
  "found": true,
  "page_title": "Newark Liberty International Airport",
  "page_url": "https://en.wikipedia.org/wiki/Newark_Liberty_International_Airport",
  "extract": "Newark Liberty International Airport (IATA: EWR, ICAO: KEWR, FAA LID: EWR) is a major international airport serving the New York metropolitan area. The airport is located in both Newark and neighboring Elizabeth, straddling the boundary between Essex and Union Counties in the U.S. state of New Jersey. Located approximately 4.5 miles (7.2 km) south of downtown Newark and 9 miles (14 km) west-southwest of Manhattan, it is a major gateway to destinations in Europe, South America, Asia, and Oceania. It is jointly owned by the two cities, and the airport itself is leased to its operator, the Port Authority of New York and New Jersey. It is the second-busiest airport in the New York airport system behind John F. Kennedy International Airport and ahead of LaGuardia Airport. The airport is near the Newark Airport Interchange, the junction between both Interstate 95 and Interstate 78 (both of which are components of the New Jersey Turnpike), and U.S. Routes 1 and 9, which has junctions with U.S. Route 22, Route 81, and Route 21. AirTrain Newark connects the terminals with the Newark Liberty International Airport Railway Station. The station is served by NJ Transit's Northeast Corridor Line and North Jersey Coast Line. Amtrak's Northeast Regional and Keystone Service routes also make stops at the station. The City of Newark built the airport on 68 acres (28 ha) of marshland in 1928, and the Army Air Corps operated the facility during World War II. The airport was constructed adjacent to Port Newark and U.S. Route 1. After the Port Authority took over the facility in 1948, an instrument runway, a terminal building, a control tower, and an air cargo center were constructed. The airport's Building One from 1935 was added to the National Register of Historic Places in 1980. During 2022, the airport served 43.4 million passengers, which made it the 13th-busiest airport in the nation, and the 23rd-busiest airport in the world. The busiest year to date was 2023, when it served 49.1 ...",
  "error": null,
  "fetched_at": "2026-01-24T20:33:08Z"
}
