{
  "search_query": "Noah Webster House & West Hartford Historical Society West Hartford museum",
  "found": true,
  "page_title": "Hartford, Connecticut",
  "page_url": "https://en.wikipedia.org/wiki/Hartford,_Connecticut",
  "extract": "Hartford is the capital city of the U.S. state of Connecticut. The city, located in Hartford County, had a population of 121,054 at the 2020 census and was estimated at 124,006 in 2025. Hartford is the most populous city in the Capitol Planning Region and the core city of the Greater Hartford metropolitan area with 1.17 million residents. Founded in 1635, Hartford is among the oldest cities in the United States of America. It is home to the country's second oldest public art museum (Wadsworth Atheneum), the second oldest publicly funded park (Bushnell Park), the oldest continuously published newspaper (the Hartford Courant), the second-oldest secondary school (Hartford Public High School), and the oldest school for deaf children (American School for the Deaf), founded by Thomas Hopkins Gallaudet in 1817. It is the location of the Mark Twain House, in which the author Mark Twain wrote his most famous works and raised his family. He wrote in 1868, \"Of all the beautiful towns it has been my fortune to see this is the chief.\" Hartford alternated with New Haven as dual capitals of Connecticut from 1664, and Hartford has been the sole capital since 1875. Hartford was the richest city in the United States for several decades following the American Civil War. Since 2015, it has been one of the poorest cities in the country, with three out of ten families living below the poverty threshold. In sharp contrast, the Greater Hartford metropolitan statistical area was ranked 32nd of 318 metropolitan areas in total economic production and 8th out of 280 metropolitan statistical areas in per capita income in 2015. Nicknamed the \"Insurance Capital of the World\" and \"America's filing cabinet\", the city holds high sufficiency as a global city, as home to the headquarters of many insurance companies, the region's major industry. Other prominent industries include the services, education and healthcare industries. Hartford coordinates certain Hartford–Springfield regional development ma...",
  "error": null,
  "fetched_at": "2026-01-24T20:25:49Z"
}
