{
  "search_query": "Cape Fear Museum Wilmington museum",
  "found": true,
  "page_title": "Wilmington, North Carolina",
  "page_url": "https://en.wikipedia.org/wiki/Wilmington,_North_Carolina",
  "extract": "Wilmington is a port city in New Hanover County, North Carolina, United States. With a population of 115,451 as of the 2020 census, it is the eighth-most populous city in the state. The county seat of New Hanover County, it is the principal city of the Wilmington metropolitan area, which includes New Hanover, Brunswick, and Pender counties. As of 2023, the region had an estimated population of 467,337. Wilmington's residential area lies between the Cape Fear River and the Atlantic Ocean, and the city developed as a commercial port in the colonial era. The city was founded in the 1730s. After going through a series of different names (New Carthage, New London, Newton), its name became Wilmington. In 1739, Col. William Bartram, the uncle of the naturalist, introduced a bill to establish Wilmington, named for one of his patrons, Spencer Compton, Earl of Wilmington. Toward the end of the 19th century, Wilmington was a majority-black, racially integrated, prosperous city – and the largest in North Carolina. It suffered what became known as the Wilmington massacre in 1898 when white supremacists launched a coup that overthrew the legitimately elected local Fusionist government. It resulted in the expulsion of opposition black and white political leaders from the city, destruction of the property and businesses of black citizens, including the city's only black newspaper, and deaths ranging from an estimated 60 to more than 300 people. By 1910, Charlotte overtook Wilmington as North Carolina's largest city. Wilmington's downtown includes a 1.75-mile (2.82 km) riverwalk, developed as a tourist attraction in the late 20th century. In 2003, the city was designated by the U.S. Congress as a \"Coast Guard City\", one of 29 cities that currently bear that designation. It was formerly the home port for the USCGC Diligence, a United States Coast Guard medium-endurance cutter. Wilmington was declared the first World War II Heritage City in the country in 2020. The World War II battle...",
  "error": null,
  "fetched_at": "2026-01-24T20:32:24Z"
}
