{
  "search_query": "Old Stone Fort Museum Schoharie museum",
  "found": true,
  "page_title": "Old Stone Fort (Schoharie, New York)",
  "page_url": "https://en.wikipedia.org/wiki/Old_Stone_Fort_(Schoharie,_New_York)",
  "extract": "Located in the village of Schoharie, Schoharie County New York, the Old Stone Fort was originally built as a Reformed Dutch Church in 1772. With the coming of the American Revolutionary War, the church was enclosed by a log stockade in 1777. On October 17, 1780, a force of approximately 800 loyalists and Native Americans under Sir John Johnson and Mohawk Capt. Joseph Brant raided the valley and briefly attacked the fort before proceeding north toward the Mohawk Valley. A cannonball hole can still be seen in a cornice at the rear of the building. The stockade was removed in 1785 and the building continued service as a church until 1844 when it was replaced by the present Reformed Church in the village. In 1857, the former fort was sold to the State of New York for $800. Through the American Civil War and until 1873, it was used as an armory. Then, it was given to the county for historical use. In 1888, the Schoharie County Historical Society was formed to operate a museum at the old fort and by 1899, a catalog of 2,500 items was published. The fort is part of the Old Stone Fort Museum complex, which also comprises: the William Badgely Museum and carriage house, built in 1972; the Warner house, a Greek Revival home housing the Scribner Exhibit of 20th Century Communications; the 1830 Jackson law office; the Oliver one-room school house furnished circa 1900; and the Schaeffer-Ingold Dutch barn. Experts on the Dutch Barn have included Harold Zoch (1927–2018), who was Schoharie County Historian. In 2014, the Old Stone Fort Museum opened a special exhibit to celebrate the 125th anniversary of the Schoharie County Historical Society, highlighting its 37 charter members and their role in preserving the historic site. The exhibit featured artifacts connected to the founders, including the original church steeple’s rooster-shaped weathervane. The research library is available to historians and genealogists. The facility is open to the public from May through October. It was l...",
  "error": null,
  "fetched_at": "2026-01-24T20:35:24Z"
}
