{
  "search_query": "Center for Photographic Art Carmel museum",
  "found": true,
  "page_title": "Barbara Crane",
  "page_url": "https://en.wikipedia.org/wiki/Barbara_Crane",
  "extract": "Barbara Crane (March 19, 1928 – August 7, 2019) was an American artist photographer born in Chicago, Illinois. Crane worked with a variety of materials including Polaroid, gelatin silver, and platinum prints among others. She was known for her experimental and innovative work that challenges the straight photograph by incorporating sequencing, layered negatives, and repeated frames. Naomi Rosenblum notes that Crane \"pioneered the use of repetition to convey the mechanical character of much of contemporary life, even in its recreational aspects.\" Crane was the recipient of fellowships and grants, such as the Illinois Arts Council Artists Fellowship (2001), National Endowment for the Arts Grant (1988, 1974), Polaroid Corporation Materials Grants (1979–1995), and John Simon Guggenheim Memorial Fellowship in Photography (1979). Crane has also been an honored educator for the National Society for Photographic Education (1993); a distinguished artist at the Union League Club in Chicago, Illinois (2006); and a distinguished artist at Brown University, Providence, Rhode Island (2006). Her awards also include the YWCA Outstanding Achievement Award (1987) and the Ruth Horwich Award to a Famous Chicago Artist (Chicago, Illinois, 2009). In 2013, Barbara Crane was named artist honoree at the Hyde Park Art Center in Chicago, Illinois. Crane's work is represented in numerous public collections including the International Center for Photography, New York City; the George Eastman Museum, Rochester, NY; the Art Institute of Chicago; the J. Paul Getty Museum, Los Angeles; the National Museum of Modern Art, Kyoto; the Museum of Contemporary Art, Chicago; the Museum of Fine Arts, Houston; and the WestLicht Museum of Photography, Vienna, Austria. Crane's archive resides at the Center for Creative Photography at the University of Arizona in Tucson, AZ.",
  "error": null,
  "fetched_at": "2026-01-24T20:22:50Z"
}
