{
  "search_query": "Donkey Mill Art Center Holualoa museum",
  "found": true,
  "page_title": "History of agriculture",
  "page_url": "https://en.wikipedia.org/wiki/History_of_agriculture",
  "extract": "Agriculture began independently in different parts of the globe, and included a diverse range of taxa. At least eleven separate regions of the Old and New World were involved as independent centers of origin. The development of agriculture about 12,000 years ago changed the way humans lived. They switched from nomadic hunter-gatherer lifestyles to permanent settlements and farming. Wild grains were collected and eaten from at least 104,000 years ago. However, domestication did not occur until much later. The earliest evidence of small-scale cultivation of edible grasses is from around 21,000 BC with the Ohalo II people on the shores of the Sea of Galilee. By around 9500 BC, the eight Neolithic founder crops – emmer wheat, einkorn wheat, hulled barley, peas, lentils, bitter vetch, chickpeas, and flax – were cultivated in the Levant. Rye may have been cultivated earlier, but this claim remains controversial. Regardless, rye's spread from Southwest Asia to the Atlantic was independent of the Neolithic founder crop package. Rice was domesticated in China by 6200 BC with earliest known cultivation from 5700 BC, followed by mung, soy and azuki beans. Rice was also independently domesticated in West Africa and cultivated by 1000 BC. Pigs were domesticated in Mesopotamia around 11,000 years ago, followed by sheep. Cattle were domesticated from the wild aurochs in the areas of modern Turkey and India around 8500 BC. Camels were domesticated late, perhaps around 3000 BC. In subsaharan Africa, sorghum was domesticated in the Sahel region of Africa by 3000 BC, along with pearl millet by 2000 BC. Yams were domesticated in several distinct locations, including West Africa (unknown date), and cowpeas by 2500 BC. Rice (African rice) was also independently domesticated in West Africa and cultivated by 1000 BC. Teff and likely finger millet were domesticated in Ethiopia by 3000 BC, along with noog, ensete, and coffee. Other plant foods domesticated in Africa include watermelon, okra,...",
  "error": null,
  "fetched_at": "2026-01-24T20:27:50Z"
}
