{
  "search_query": "Coachella Valley History Museum Indio museum",
  "found": true,
  "page_title": "Coachella Valley",
  "page_url": "https://en.wikipedia.org/wiki/Coachella_Valley",
  "extract": "The Coachella Valley ( koh-CHEL-ə, KOH-ə-) is an arid rift valley in the Colorado Desert of Southern California in Riverside County. The valley has been referred to as Greater Palm Springs and occasionally the Palm Springs Area due to the historic prominence of the city of Palm Springs. The valley extends approximately 45 mi (72 km) southeast from the San Gorgonio Pass to the northern shore of the Salton Sea and the neighboring Imperial Valley, and is approximately 15 mi (24 km) wide along most of its length. It is bounded on the northeast by the San Bernardino and Little San Bernardino Mountains, and on the southwest by the San Jacinto and Santa Rosa Mountains. The Coachella Valley is notable as the location of several wintertime resort cities that have become popular destinations for full time retirees and seasonal residents known as snowbirds. The valley is also known for a number of annual events, including the Coachella Valley Music and Arts Festival, the Stagecoach Country Music Festival, and the Riverside County Fair and National Date Festival, all held in Indio. Other events include the Palm Springs Modernism Week, Palm Springs International Film Festival, the ANA Inspiration and Desert Classic golf tournaments, and the Indian Wells Open tennis tournament. The Coachella Valley is home to the cities of Cathedral City, Coachella, Desert Hot Springs, Indian Wells, Indio, La Quinta, Palm Desert, Palm Springs, and Rancho Mirage. Summers in the valley are extremely hot and valley winters are mild. As such, the valley's population tends to fluctuate; from nearly 500,000 in April, to around 300,000 in July and August, to around 600,000 by January. It was stated in 2013 by the Riverside County HR Department that \"Palm Springs and the Desert Communities\" were being visited by 3.5 million conventioneers and tourists annually. The Coachella Valley connects with the Greater Los Angeles area to the west via the San Gorgonio Pass, a major transportation corridor, traversed...",
  "error": null,
  "fetched_at": "2026-01-24T20:24:31Z"
}
