{
  "search_query": "Institute of Texan Cultures San Antonio museum",
  "found": true,
  "page_title": "Institute of Texan Cultures",
  "page_url": "https://en.wikipedia.org/wiki/Institute_of_Texan_Cultures",
  "extract": "The Institute of Texan Cultures (referred to as The ITC or The Institute) is a museum and library operating as a component of The University of Texas at San Antonio. The building which housed the institute is a striking example of Brutalist architecture, and was listed on the National Register of Historic Places in 2024. It serves as the state's primary center for multicultural education, with exhibits, programs, and events like the Texas Folklife Festival, an annual celebration of the many ethnicities that make up the population of Texas. It has been held yearly since 1972. The facility, established by the Texas Legislature on May 27, 1965, originally served as the Texas Pavilion at HemisFair '68 before being turned over to the University of Texas System in 1969. UTSA assumed administrative control of the museum in 1973. In 1986, the system designated the institute as a campus of the University of Texas at San Antonio. The ITC, through its research, collections, exhibits and programs, serves as the forum for the understanding and appreciation of Texas and Texans. The 182,000-square-foot (16,900 m2) complex had 65,000-square-foot (6,000 m2) of interactive exhibits and displays. The library on the third floor contained manuscripts, rare books, personal papers, over 3 million historical photos and over 700 oral histories. Funding for the museum comes primarily from three sources: biennial legislative appropriations; exhibit floor and special event admissions; grants, contributions, and other locally generated funds such as the rental of the museum's facilities, and the sale of its publications, audiovisuals, library services, and merchandise from The Museum Store. Major support is provided by the museum's Development Board. The Texas Legislature cut appropriations for the institute by 25% in 2011 causing the institute to rely more on private donations and corporate sponsorship. The ITC fulfills its mandate as the state's center for multicultural education by investiga...",
  "error": null,
  "fetched_at": "2026-01-24T20:38:37Z"
}
