{
  "search_query": "Chippewa Valley Museum Eau Claire museum",
  "found": true,
  "page_title": "Chippewa Valley Regional Airport",
  "page_url": "https://en.wikipedia.org/wiki/Chippewa_Valley_Regional_Airport",
  "extract": "Chippewa Valley Regional Airport (IATA: EAU, ICAO: KEAU, FAA LID: EAU) is a public use airport in Chippewa County, Wisconsin, United States. Chippewa Valley Regional Airport (EAU) is a non-hub primary commercial service airport owned by Eau Claire County and located three miles north of downtown Eau Claire, Wisconsin. It serves as the largest airport in northwestern Wisconsin, covering 1,100 acres with two runways and providing facilities for general aviation, air cargo, and commercial flights. The airport offers scheduled service to Chicago O'Hare through United Express, operated by SkyWest Airlines, and seasonal service to Florida through Sun Country Airlines. It is the largest airport in the 30-county northern Wisconsin area and serves primarily the Chippewa Valley region, operating on a budget approved by a commission equally representing the interests of Chippewa, Dunn and Eau Claire counties. The airport is mainly used for general aviation and business travel; the Eau Claire-based Menards corporation uses CVRA to base their fleet of aircraft to serve their stores throughout the Midwest. It is occasionally used as an alternative landing site for flights bound for Minneapolis-Saint Paul International Airport. As of December 2022, only one commercial airline, Sun Country Airlines, provides service for CVRA to Minneapolis International. In December 2024, United Airlines announced the start of regional service to its hub at Chicago O'Hare. The airport is included in the Federal Aviation Administration (FAA) National Plan of Integrated Airport Systems for 2025–2029, in which it is categorized as a non-hub primary commercial service facility. It is the eighth busiest of eight commercial airports in Wisconsin in terms of passengers served.",
  "error": null,
  "fetched_at": "2026-01-24T20:40:46Z"
}
