{
  "search_query": "National Black Doll Museum of History & Culture North Attleborough museum",
  "found": true,
  "page_title": "List of Ghost Hunters episodes",
  "page_url": "https://en.wikipedia.org/wiki/List_of_Ghost_Hunters_episodes",
  "extract": "Ghost Hunters is an American paranormal reality television series. The original series aired from October 6, 2004, until October 26, 2016, on Syfy. The original program spanned eleven seasons with 230 episodes, not including 10 specials. The series was revived in early 2019 and aired its twelfth and thirteenth seasons from August 21, 2019, to May 27, 2020, on A&E. The series moved to Discovery+ in 2021 for its fourteenth season, starting on October 31, 2021. The first run featured Jason Hawes and Grant Wilson of The Atlantic Paranormal Society (TAPS) investigating places that are reported to be haunted. The two originally worked as plumbers for Roto-Rooter as a day job while doing paranormal investigations of reportedly haunted locations at night. In its first iteration, Ghost Hunters aired on Wednesdays, usually around 9 pm Eastern Time, 8 pm Central Time. For the twelfth and thirteenth seasons (2019–2020), the revived show featured Grant and a new investigatory team that had no discernible connection to TAPS, although the series still maintained the same format and producers and referenced past episodes. Brandon Alvis announced in October 2020 that the show would not be returning for another season at A&E. On May 18, 2021, it was announced that Ghost Hunters was sold to Discovery+, and once again revived for its fourteenth season. Wilson (mentioned in Keeper of the Light) and the new team were not featured, instead, Jason Hawes, Steve Gonsalves, Dave Tango, and Sheri DeBenedetti, who featured as the last cast of the original run of the show (and at the time of the purchase, the cast of Ghost Nation) returned using the TAPS moniker and methods featured previously. It airs on Discovery+ as season 14 of Ghost Hunters, but uses TAPS Returns as a subtitle in marketing. Seasons 1–11, as well as seasons 12 and 13, which aired on A&E, are now subtitled Ghost Hunters (Classic).",
  "error": null,
  "fetched_at": "2026-01-24T20:29:52Z"
}
