{
  "search_query": "Tacoma Art Museum Tacoma museum",
  "found": true,
  "page_title": "Seattle–Tacoma International Airport",
  "page_url": "https://en.wikipedia.org/wiki/Seattle%E2%80%93Tacoma_International_Airport",
  "extract": "Seattle–Tacoma International Airport (IATA: SEA, ICAO: KSEA, FAA LID: SEA) is the primary international airport serving Seattle and its surrounding metropolitan area in the U.S. state of Washington. It is in the city of SeaTac, which was named after the airport's nickname Sea–Tac, approximately 14 miles (23 km) south of downtown Seattle and 18 miles (29 km) north-northeast of downtown Tacoma. The airport is the busiest in the Pacific Northwest region of North America and is owned by the Port of Seattle. The entire airport covers an area of 2,500 acres (1,000 hectares) and has three parallel runways. It is the primary hub for Alaska Airlines, whose headquarters are near the airport. The airport is also a hub and international gateway for Delta Air Lines, which has expanded at the airport since 2011. As of 2022, 31 airlines operate at Sea–Tac, serving 91 domestic and 28 international destinations in North America, Oceania, Europe, the Middle East, and Asia. Sea–Tac was developed in the 1940s to replace Boeing Field, which had been converted to military use during World War II. A site near Bow Lake was chosen in 1942 and construction began the following year with funding from the federal government, Port of Seattle, and the City of Tacoma. The airport opened on October 31, 1944. The first scheduled commercial flights from the airport began in September 1947 and the terminal was dedicated on July 9, 1949. Sea–Tac was expanded in 1961 to accommodate jetliners and added new concourses and satellite terminals by 1973. The main runway was extended several times and twinned in 1970; the third runway opened in 2008 following several decades of planning due to local opposition. Several major concourse expansions and renovations were initiated in the 2010s to accommodate passenger growth at Sea–Tac, which had become a new hub for Delta Air Lines. A new international arrivals facility opened in 2022 as part of the program. In 2023, Sea–Tac served 50,887,260 passengers, 2% below ...",
  "error": null,
  "fetched_at": "2026-01-24T20:40:18Z"
}
