{
  "search_query": "El Paso Museum of Art El Paso museum",
  "found": true,
  "page_title": "El Paso, Texas",
  "page_url": "https://en.wikipedia.org/wiki/El_Paso,_Texas",
  "extract": "El Paso is a city in and the county seat of El Paso County, Texas, United States. It is the 22nd-most populous city in the U.S., sixth-most populous city in Texas, and the most populous city in West Texas with a population of 678,815 at the 2020 census, while the El Paso metropolitan area has an estimated 879,000 residents. El Paso stands on the Rio Grande across the Mexico–United States border from Ciudad Juárez, the most populous city in the Mexican state of Chihuahua. On the U.S. side, the El Paso metropolitan area forms part of the larger El Paso–Las Cruces combined statistical area with Las Cruces, New Mexico. These three cities form a combined international metropolitan area sometimes referred to as the Paso del Norte or the Borderplex, a region of 2.7 million people which constitutes the largest bilingual and binational workforce in the Western Hemisphere. The city is home to three publicly traded companies, and is also home to the Medical Center of the Americas, the only medical research and care provider complex in West Texas, and the University of Texas at El Paso, the city's primary university. The city hosts the annual Sun Bowl college football postseason game, the second-oldest bowl game in the country. El Paso has a strong federal and military presence. William Beaumont Army Medical Center, Biggs Army Airfield, and Fort Bliss are located in the area. The Drug Enforcement Administration domestic field division 7, El Paso Intelligence Center, Joint Task Force North, United States Border Patrol El Paso Sector, and the U.S. Border Patrol Special Operations Group are also headquartered in El Paso. El Paso is a five-time All-America City Award winner, winning in 1969, 2010, 2018, 2020, and 2021, and Congressional Quarterly ranked it in the top-three safest large cities in the United States between 1997 and 2014, including holding the title of the safest city between 2011 and 2014. El Paso is also the second-largest absolute-majority-Hispanic city in the Unit...",
  "error": null,
  "fetched_at": "2026-01-24T20:38:29Z"
}
