{
  "search_query": "UICA (Urban Institute for Contemporary Arts) Grand Rapids museum",
  "found": true,
  "page_title": "Grand Rapids, Michigan",
  "page_url": "https://en.wikipedia.org/wiki/Grand_Rapids,_Michigan",
  "extract": "Grand Rapids is a city in and the county seat of Kent County, Michigan, United States. It is the second-most populous city in Michigan, with a population of 198,917 at the 2020 census (estimated at 200,117 in 2024). The Grand Rapids metropolitan area, with over 1.18 million residents, is the 49th-largest metropolitan area in the U.S. Grand Rapids is situated along the Grand River approximately 25 miles (40 km) east of Lake Michigan and is the economic and cultural hub of West Michigan. Originally inhabited by the Hopewell and later Odawa people, the area was settled by European Americans in the early 19th century and incorporated in 1850. Grand Rapids gained prominence in the late 19th Century as the \"Furniture City\" due to its thriving furniture manufacturing industry, a legacy that continues to influence the region's industrial profile. Its economy is diversified, encompassing healthcare, education, manufacturing, and technology, with major employers such as Corewell Health, Meijer, and Steelcase anchoring its economic landscape. Culturally, Grand Rapids is home to several museums, including the Grand Rapids Art Museum and Grand Rapids Public Museum. The city also hosts the annual ArtPrize, an international art competition, and the Frederik Meijer Gardens & Sculpture Park, a premier horticultural and artistic destination. As a result of the numerous craft breweries in the city, including Founders Brewing Company, Grand Rapids is also known as \"Beer City USA\". Grand Rapids was the childhood home of U.S. President Gerald Ford, who is buried with his wife Betty on the grounds of the Gerald R. Ford Presidential Museum in the city. The city's Gerald R. Ford International Airport and Gerald R. Ford Freeway are named after him.",
  "error": null,
  "fetched_at": "2026-01-24T20:31:26Z"
}
