{
  "search_query": "Powerhouse Science Center Discovery Campus Durango museum",
  "found": true,
  "page_title": "Colorado",
  "page_url": "https://en.wikipedia.org/wiki/Colorado",
  "extract": "Colorado is a landlocked state in the Western United States. It is one of the Mountain states, and part of the Southwestern United States, sharing the Four Corners region with Arizona, New Mexico, and Utah. It is also bordered by Wyoming to the north, Nebraska to the northeast, Kansas to the east, and Oklahoma to the southeast. Colorado is noted for its landscape of mountains, forests, high plains, mesas, canyons, plateaus, rivers, and desert lands. It encompasses most of the Southern Rocky Mountains, as well as the northeastern portion of the Colorado Plateau and the western edge of the Great Plains. Colorado is the eighth-largest U.S. state by area and the 21st by population. The United States Census Bureau estimated the population of Colorado to be 5,957,493 as of July 1, 2024, a 3.2% increase from the 2020 United States census. The region has been inhabited by Native Americans and their Paleo-Indian ancestors for at least 13,500 years and possibly much longer. The eastern edge of the Rocky Mountains was a major migration route for early peoples who spread throughout the Americas. In 1848, much of the Nuevo México region was annexed to the United States with the Treaty of Guadalupe Hidalgo. The Pike's Peak Gold Rush of 1858–1862 created an influx of settlers. On February 28, 1861, U.S. president James Buchanan signed an act creating the Territory of Colorado, and on August 1, 1876, president Ulysses S. Grant signed Proclamation 230, admitting Colorado to the Union as the 38th state. Denver is the capital, the most populous city, and the center of the Front Range Urban Corridor. Colorado Springs is the second-most populous city of the state. Residents of the state are known as Coloradans, although the antiquated \"Coloradoan\" is occasionally used. Colorado generally ranks as one of the top U.S. states for education attainment, employment, and healthcare quality. Major parts of its economy include government and defense, mining, agriculture, tourism, and manufacturi...",
  "error": null,
  "fetched_at": "2026-01-24T20:23:41Z"
}
