{
  "search_query": "University of California Davis Arboretum and Public Garden Riverside museum",
  "found": true,
  "page_title": "University of California, Davis",
  "page_url": "https://en.wikipedia.org/wiki/University_of_California,_Davis",
  "extract": "The University of California, Davis (UC Davis, UCD, or Davis) is a public land-grant research university in the Davis, California area, United States. It is the northernmost of the ten campuses of the University of California system. The institution was first founded as an agricultural branch of the system in 1905 and became the sixth campus of the University of California in 1959. Founded as a primarily agricultural campus, the university has expanded over the past century to include graduate and professional programs in medicine (which includes the UC Davis Medical Center), engineering, science, law, veterinary medicine, education, nursing, and business management, in addition to 90 research programs offered by UC Davis Graduate Studies. The UC Davis School of Veterinary Medicine is the largest veterinary school in the United States. UC Davis also offers certificates and courses, including online classes, for adults and non-traditional learners through its Division of Continuing and Professional Education. It is classified among \"R1: Doctoral Universities – Very high research activity\". The UC Davis Aggies athletic teams compete in NCAA Division I, primarily as members of the Big West Conference with additional sports in the Big Sky Conference (football only) and the Mountain Pacific Sports Federation. Athletes from UC Davis have won a total of 10 Olympic medals. University faculty, alumni, and researchers have been the recipients of two Nobel Prizes, one Fields Medal, a Presidential Medal of Freedom, three Pulitzer Prizes, three MacArthur Fellowships, and a National Medal of Science. Of the current faculty, 30 have been elected to the National Academy of Sciences, 36 to the American Academy of Arts and Sciences, and 13 to the National Academy of Medicine.",
  "error": null,
  "fetched_at": "2026-01-24T20:24:14Z"
}
