{
  "search_query": "Highfield Hall & Gardens Falmouth museum",
  "found": true,
  "page_title": "University of Oxford",
  "page_url": "https://en.wikipedia.org/wiki/University_of_Oxford",
  "extract": "The University of Oxford is a collegiate research university in Oxford, England. There is evidence of teaching as early as 1096, making it the oldest university in the English-speaking world and the world's second-oldest university in continuous operation. It grew rapidly from 1167, when Henry II prohibited English students from attending the University of Paris. After escalating conflict between students and the Oxford townspeople, some Oxford academics fled northeast to Cambridge, where they established the University of Cambridge in 1209. The two universities share many common features and are jointly referred to as Oxbridge. The University of Oxford is made up of 43 colleges – of which 36 are chartered colleges (independent bodies), four are permanent private halls (owned by religious organisations), and three are societies (controlled by the university) – and a range of academic departments that are organised into four divisions. Colleges control their own membership and activities. Typically social life for students is centred around fellow college members. All students are members of a college. Oxford does not have a main campus. Its buildings and facilities are scattered throughout the city centre and around the town. Undergraduate teaching at the university consists of lectures, small-group tutorials at the colleges and halls, seminars, laboratory work and tutorials provided by the central university faculties and departments. Postgraduate teaching is provided in a predominantly centralised fashion. Oxford operates the Ashmolean Museum, the world's oldest university museum; Oxford University Press, the largest university press in the world; and the largest academic library system nationwide. In the fiscal year ending 31 July 2024, the university had a total consolidated income of £3.05 billion, of which £778.9 million was from research grants and contracts. In 2024, Oxford ranked first nationally for undergraduate education. Oxford has educated a wide range...",
  "error": null,
  "fetched_at": "2026-01-24T20:30:19Z"
}
