{
  "search_query": "McNay Art Museum San Antonio museum",
  "found": true,
  "page_title": "McNay Art Museum",
  "page_url": "https://en.wikipedia.org/wiki/McNay_Art_Museum",
  "extract": "The McNay Art Museum, founded in 1954 in San Antonio, is the first modern art museum in Texas. The museum was created by Marion Koogler McNay's original bequest of most of her fortune, her important art collection and her 24-room Spanish Colonial Revival-style mansion that sits on 23 acres (9.3 ha) that are landscaped with fountains, broad lawns as well as a Japanese-inspired garden and fishpond. McNay was an American painter and art teacher who inherited a substantial oil fortune upon the death of her father. The museum was named after her, and has been expanded to include galleries of medieval and Renaissance artwork and a larger collection of 20th-century European and American modernist work. She built a home in 1927 designed by Atlee Ayres and his son Robert M. Ayres. When she died, the house was bequeathed to the City of San Antonio to house the museum. The museum focuses primarily on 19th- and 20th-century European and American art by artists including Paul Cézanne, Pablo Picasso, Paul Gauguin, Henri Matisse, Georgia O'Keeffe, Diego Rivera, Mary Cassatt, and Edward Hopper. The collection today consists of over 20,000 objects and is one of the finest collections of contemporary art and sculpture in the Southwestern United States. The museum also is home to the Tobin Collection of Theatre Arts, which is one of the premiere collections of its kind in the U.S., and a research library with over 30,000 volumes. The McNay Art Museum added the Jane and Arthur Stieren Center for Exhibitions in 2008, built by architect Jean-Paul Viguier, to display their Modern collection. The 45,000-square-foot structure houses light-filled galleries for special exhibitions, a glass-fronted gallery for sculpture from the museum's collection, a gallery for paper works, wall cases for small objects, a lecture hall, and learning centers. The center's design, materials, and architectural details both contrast with and complement the original Spanish Colonial Revival-style residence, which ...",
  "error": null,
  "fetched_at": "2026-01-24T20:39:15Z"
}
