{
  "search_query": "Claremont Museum of Art Claremont museum",
  "found": true,
  "page_title": "Claremont, California",
  "page_url": "https://en.wikipedia.org/wiki/Claremont,_California",
  "extract": "Claremont () is a suburban city in eastern Los Angeles County, California, United States, 30 miles (48 km) east of Los Angeles. It lies in the Pomona Valley at the foothills of the San Gabriel Mountains. As of the 2010 census, it had a population of 34,926, and in 2020 the population was 37,266. Claremont is home to the seven Claremont Colleges and several other educational institutions and is known for its tree-lined streets with numerous historic buildings. Because of this, it is sometimes referred to as \"The City of Trees and Ph.Ds.\" It was named the best suburb in the West by Sunset Magazine in 2016, which described it as a \"small city that blends worldly sophistication with small-town appeal.\" In 2018, Niche rated Claremont as the 17th-best place to live in the Los Angeles area out of 658 communities it evaluated, based on crime, cost of living, job opportunities, and local amenities. The city is primarily residential, with a significant portion of its commercial activity located in \"The Village,\" a popular collection of street-front small stores, boutiques, art galleries, offices, and restaurants adjacent to and west of the Claremont Colleges. The Village was expanded in 2007, adding a controversial multi-use development that includes an indie cinema, a boutique hotel, retail space, offices, and a parking structure on the site of an old citrus packing plant west of Indian Hill Boulevard. Claremont also hosts several large retirement communities. Claremont has been a winner of the National Arbor Day Association's Tree City USA award for 22 consecutive years. When the city incorporated in 1907, local citizens started what has become the city's tree-planting tradition. Claremont is one of the few remaining places in North America with American elm trees that have not been exposed to Dutch elm disease. The stately trees line Indian Hill Boulevard in the vicinity of the city's Memorial Park.",
  "error": null,
  "fetched_at": "2026-01-17T22:59:48Z"
}
