{
  "search_query": "Edward Hopper House Art Center Nyack museum",
  "found": true,
  "page_title": "Edward Hopper",
  "page_url": "https://en.wikipedia.org/wiki/Edward_Hopper",
  "extract": "Edward Hopper (July 22, 1882 – May 15, 1967) was an American realist painter and printmaker. He is one of America's most renowned artists and known for his skill in depicting modern American life and landscapes. Born in Nyack, New York, to a middle-class family, Hopper's early interest in art was supported by his parents. He studied at the New York School of Art under William Merritt Chase and Robert Henri, where he developed a signature style characterized by its emphasis on solitude, light, and shadow. Hopper's work, spanning oil paintings, watercolors, and etchings, predominantly explores themes of loneliness and isolation within American urban and rural settings. His most famous painting, Nighthawks (1942), exemplifies his focus on quiet, introspective scenes from everyday life. Though his career advanced slowly, Hopper achieved recognition by the 1920s, with his works featured in major American museums. Hopper's technique, marked by a composition of form and use of light to evoke mood, has been influential in the art world and popular culture. His paintings, often set in the architectural landscapes of New York or the serene environments of New England, convey a sense of narrative depth and emotional resonance, making him a pivotal figure in American Realism. Hopper created subdued drama out of commonplace subjects layered with a poetic meaning, inviting narrative interpretations. He was praised for \"complete verity\" in the America he portrayed. In 1924, Hopper married fellow artist Josephine Nivison, who played a significant role in managing his career and modeling for many of his works. The couple lived modestly in New York City and spent summers on Cape Cod, which influenced much of Hopper's later art. Despite critical acclaim, Hopper remained private and introspective, dedicated to exploring the subtleties of human experience and the American landscape. His depiction of American life, with its emphasis on isolation and contemplation, remains a defining aspe...",
  "error": null,
  "fetched_at": "2026-01-24T20:34:10Z"
}
