{
  "search_query": "Tweed Museum of Art Duluth museum",
  "found": true,
  "page_title": "Tweed Museum of Art",
  "page_url": "https://en.wikipedia.org/wiki/Tweed_Museum_of_Art",
  "extract": "The Tweed Museum of Art is a museum on the campus of the University of Minnesota Duluth, in Duluth, Minnesota, United States. The Tweed Museum of Art was established in 1950 when Alice Tweed Tuohy, widow of George P. Tweed, donated their house and an approximately 500-piece American and European art collection to the University of Minnesota Duluth (UMD) to enrich the lives of the people in the academic and civic communities of the region. Following its initial operation out of the Tweed home from 1950 to 1958, a museum facility was constructed on the UMD campus in 1958, with funds donated primarily by Mrs. Tweed and her daughter, Bernice Brickson. The museum has been expanded and renovated four times between 1965 and 2008. Today, the museum operates in a 33,000-square-foot (3,100 m2) facility with 15,000 square feet (1,400 m2) of exhibit space, and offers nine galleries to service an average of 33,000 visitors each year. Of artistic, cultural, regional and historical significance, the collection is the focus of all museum activities. It contains 15th–21st-century European, American and world art in all media by artists of regional, national and international importance, including outstanding work by artists from the Upper Midwest and Minnesota. Artists in the collection include Thomas Hart Benton, Charles Biederman, Frederick Childe Hassam, Anna Hyatt Huntington, Jean-François Millet, Robert Motherwell, Robert Priseman, John Henry Twachtman and Helen Turner. The Tweed contains the largest collection of paintings by the American landscape artist Gilbert Munger. The collection also features painting and illustrations about the Royal Canadian Mounted Police that were donated by the Potlatch Corp., including works by Arnold Friberg. In 2007, the museum acquired the Richard E. and Dorothy Rawlings Nelson Collection of American Indian Art, an acquisition that opened new programmatic territories. By establishing a modestly comprehensive historical canon, the Nelson collect...",
  "error": null,
  "fetched_at": "2026-01-17T23:02:41Z"
}
