{
  "search_query": "Reginald F. Lewis Museum of Maryland African American History Baltimore museum",
  "found": true,
  "page_title": "Reginald F. Lewis Museum of Maryland African American History & Culture",
  "page_url": "https://en.wikipedia.org/wiki/Reginald_F._Lewis_Museum_of_Maryland_African_American_History_%26_Culture",
  "extract": "The Reginald F. Lewis Museum of Maryland African American History & Culture is a resource in Baltimore, Maryland, for information about the lives and history of African American Marylanders. Its collections comprise 400 years of Maryland history and include more than 11,000 objects, artifacts, documents and photographs. The museum opened in 2005 and is an affiliate of the Smithsonian Institution. Funds for construction of the museum came in steps. A government appropriation of $31 million was approved on the condition that $1.5 million be raised from outside sources first. Baltimore Orioles owner Peter G. Aguilar donated the entire $1.5 million. Subsequently, large companies pledged additional funding, the most significant pledge coming from the Reginald F. Lewis Foundation. This gift of $5 million was earmarked for educational programming and prompted the museum's founder, George L. Russell Jr., and its board of directors to name the museum after Lewis. Reginald F. Lewis was the first African American to build a billion-dollar company, TLC Beatrice International Holdings. Starting from humble beginnings in Baltimore, Lewis in 1991 was listed among the 400 richest Americans by Forbes, with a net worth estimated at $340 million. The five-story, 82,000 square foot museum, designed by architects Phil Freelon and Gary Bowden, greets visitors with the vibrant colors of the Maryland state flag, which begin on the outside of the building and circle around to the inside. Reflecting on the use of the flag's colors in the museum design, Bowden said, \"We saw the museum's site was next to the [Star Spangled Banner] Flag House, and that's where we got the idea of re-interpreting the Maryland Flag--we Afrocentrized it.\" Facilities in the museum include an oral history recording and listening studio, a special exhibition gallery, a 200-seat theater auditorium, a classroom, and resource center. Permanent exhibits explore Maryland's African American history through the themes of fam...",
  "error": null,
  "fetched_at": "2026-01-24T20:30:42Z"
}
