{
  "search_query": "Tampa Bay History Center Tampa museum",
  "found": true,
  "page_title": "Tampa Bay",
  "page_url": "https://en.wikipedia.org/wiki/Tampa_Bay",
  "extract": "Tampa Bay is a large natural harbor and shallow estuary connected to the Gulf of Mexico on the west-central coast of Florida, comprising Hillsborough Bay, McKay Bay, Old Tampa Bay, Middle Tampa Bay, and Lower Tampa Bay. The largest freshwater inflow into the bay is the Hillsborough River, which flows into Hillsborough Bay in downtown Tampa. Many other smaller rivers and streams also flow into Tampa Bay, resulting in a large watershed area. The shores of Tampa Bay were home to the Weeden Island Culture and then the Safety Harbor culture for thousands of years. These cultures relied heavily on Tampa Bay for food, and the waters were rich enough that they were one of the few Native American cultures that did not have to farm. The Tocobaga was likely the dominant chiefdom in the area when Spanish explorers arrived in the early 1500s, but there were likely smaller chiefdoms on the eastern side of the bay which were not well documented. The indigenous population had been decimated by disease and warfare by the late 1600s, and there were no permanent human settlements in the area for over a century. The United States took possession of Florida in 1821 and established Fort Brooke at the mouth of the Hillsborough River in 1824. The communities surrounding Tampa Bay grew tremendously during the 20th century. Today, the area is home to about 4 million residents, making Tampa Bay a heavily used commercial and recreational waterway and subjecting it to increasing amounts of pollutants from industry, agriculture, sewage, and surface runoff. The bay's water quality was seriously degraded by the early 1980s, resulting in a sharp decline in sea life and decreased availability for recreational use. Greater care has been taken in recent decades to mitigate the effects of human habitation on Tampa Bay, most notably upgraded sewage treatment facilities and several sea grass restoration projects, resulting in improved water quality over time. However, occasional red tide and other algae ...",
  "error": null,
  "fetched_at": "2026-01-24T20:26:37Z"
}
