{
  "search_query": "African Center for the Sacred Arts, Museum of African Art & Culture Portland museum",
  "found": true,
  "page_title": "Indianapolis Museum of Art",
  "page_url": "https://en.wikipedia.org/wiki/Indianapolis_Museum_of_Art",
  "extract": "The Indianapolis Museum of Art (IMA) is an encyclopedic art museum located at Newfields, a 152-acre (62 ha) campus that also houses Lilly House, The Virginia B. Fairbanks Art & Nature Park, the Garden at Newfields and more. It is located at the corner of North Michigan Road and West 38th Street, about three miles north of downtown Indianapolis, northwest of Crown Hill Cemetery. There are exhibitions, classes, tours, and events, many of which change seasonally. The entire campus and organization was previously referred to as the Indianapolis Museum of Art. In 2017 the campus and organization were renamed \"Newfields\" as part of a rebranding campaign while the \"Indianapolis Museum of Art\" now specifically refers to the main art museum building that acts as the cornerstone of the campus, as well as the legal name of the organization doing business as Newfields. The Indianapolis Museum of Art is the ninth oldest and eighth largest encyclopedic art museum in the United States. The permanent collection comprises over 54,000 works, including African, American, Asian, and European pieces. Significant areas of the collection include: Neo-Impressionist paintings; Japanese paintings of the Edo period; Chinese ceramics and bronzes; paintings, sculptures, and prints by Paul Gauguin and the Pont-Aven School; a large number of works by J. M. W. Turner; and a contemporary art and design collection. Other areas of emphasis include textiles and fashion arts as well as a focus on modern design. Founded in 1883 as the Art Association of Indianapolis, the first permanent museum was opened in 1906 as part of the John Herron Art Institute. In 1969, the Art Association of Indianapolis changed its name to the Indianapolis Museum of Art, and in 1970 the museum moved to its current location. Among the Art Association's founders was May Wright Sewall (1844–1920), known for her work in the women's suffrage movement. Other supporters have included Booth Tarkington (1869–1946), Eli Lilly (1885–197...",
  "error": null,
  "fetched_at": "2026-01-24T20:31:00Z"
}
