{
  "search_query": "Glynn Art Association St Simons Island museum",
  "found": true,
  "page_title": "St. Simons, Georgia",
  "page_url": "https://en.wikipedia.org/wiki/St._Simons,_Georgia",
  "extract": "St. Simons Island (or simply St. Simons) is a barrier island and census-designated place (CDP) located on St. Simons Island in Glynn County, Georgia, United States. The names of the community and the island are interchangeable, known simply as \"St. Simons Island\" or \"SSI\", or locally as \"The Island\". St. Simons is part of the Brunswick metropolitan statistical area, and according to the 2020 U.S. census, the CDP had a population of 14,982. Located on the southeast Georgia coast, midway between Savannah and Jacksonville, St. Simons Island is both a seaside resort and residential community. It is the largest of Georgia's Golden Isles (along with Sea Island, Jekyll Island, and privately owned Little St. Simons Island). Visitors are drawn to the Island for its warm climate, beaches, variety of outdoor activities, shops and restaurants, historical sites, and natural environment. In addition to its base of permanent residents, the island enjoys an influx of visitors and part-time residents throughout the year. The 2010 census noted that 26.8% of total housing units were for \"seasonal, recreational, or occasional use\". The vast majority of commercial and residential development is located on the southern half of the island. Much of the northern half remains marsh or woodland. A large tract of land in the northeast has been converted to a nature preserve containing trails, historical ruins, and an undisturbed maritime forest. The tract, Cannon's Point Preserve, is open to the public on specified days and hours. Originally inhabited by the Muscogee, the Spanish, British and French contested the area of South Georgia which included St. Simons Island. After establishing the Province of Georgia in 1732, Anglo-American colonists established rice and cotton plantations worked by African slaves, who created the unique Gullah culture that survives to this day. The primary mode of travel to the island is by automobile via F.J. Torras Causeway. Malcolm McKinnon Airport (IATA: SSI) se...",
  "error": null,
  "fetched_at": "2026-01-24T20:27:48Z"
}
