{
  "search_query": "Great Explorations Children’s Museum St. Petersburg museum",
  "found": true,
  "page_title": "Great Explorations Children's Museum",
  "page_url": "https://en.wikipedia.org/wiki/Great_Explorations_Children%27s_Museum",
  "extract": "Great Explorations Children's Museum (formerly Great Explorations - The Hands-On Museum) is a children's museum, program center, and pre-school in St Petersburg, Florida. It was founded in 1986 by The Junior League of St. Petersburg and Hands-On, Inc. Great Explorations - The Hands-On Museum was formerly housed in a warehouse type location in Downtown St. Petersburg with similar building architecture to the Salvador Dalí Museum and P. Buckley Moss Museum. Its parking lot featured a to-scale replica of a Tyrannosaurus rex made entirely out of recycled scrap metal. Inside, the exhibits were divided into large, themed rooms with individual rooms being devoted to sight, sound, or touch exhibits. The touch room featured one of the more distinctive exhibits, the \"Touch Tunnel.\" This 90-foot-long (27 m), completely blacked out tunnel encouraged children to navigate the fun house-like path using only their sense of touch. The original museum also had a small branch located in a hallway of the St. Petersburg Pier that included smaller versions of some of the museum's popular exhibits. Eventually, the museum was taken over by new management and was moved to its current location adjacent to the re-opened and refurbished Sunken Gardens. At this time, the name was also changed to Great Explorations Children's Museum dropping the \"Hands-On\" title. Designs for the new museum included more offices and school rooms as the museum intended to expand out their staffing and education capabilities. The museum also petitioned for and was given a grant from AmeriCorps and had Americorps members on staff for several years until the last of them graduated the program in September 2010.",
  "error": null,
  "fetched_at": "2026-01-24T20:27:18Z"
}
