{
  "search_query": "Whitney Museum of American Art New York museum",
  "found": true,
  "page_title": "Whitney Museum",
  "page_url": "https://en.wikipedia.org/wiki/Whitney_Museum",
  "extract": "The Whitney Museum of American Art, known informally as \"The Whitney\", is a modern and contemporary American art museum located in the Meatpacking District and West Village neighborhoods of Manhattan in New York City. The institution was founded in 1930 by Gertrude Vanderbilt Whitney (1875–1942), a prominent American socialite, sculptor, and art patron after whom it is named. The Whitney focuses on collecting and preserving 20th- and 21st-century American art. Its permanent collection, spanning the late-19th century to the present, comprises more than 25,000 paintings, sculptures, drawings, prints, photographs, films, videos, and artifacts of new media by more than 3,500 artists. It places particular emphasis on exhibiting the work of living artists as well as maintaining institutional archives of historical documents pertaining to modern and contemporary American art, including the Edward and Josephine Hopper Research Collection (the museum is the largest repository of Edward Hopper's artwork and archival materials in the world), the Sanborn Hopper Archive, and the Arshile Gorky Research Collection, among others. From 1966 to 2014, the Whitney was located at 945 Madison Avenue on Manhattan's Upper East Side in a building designed by Marcel Breuer and Hamilton P. Smith. The museum closed in October 2014 to relocate to its current building, which was designed by Renzo Piano, at 99 Gansevoort Street and opened on May 1, 2015, expanding the museum exhibition space to 50,000 square feet (4,600 m2). The museum organizes the Whitney Biennial, a bi-annual exhibition showcasing the work of emerging American artists, considered the longest-running and most important survey of contemporary art in the United States. The museum also heads the Whitney Independent Study Program, which began in 1968, to support artists, critics and art historians by \"encouraging the theoretical and critical study of the practices, institutions, and discourses that constitute the field of culture\"....",
  "error": null,
  "fetched_at": "2026-01-17T23:03:52Z"
}
