{
  "search_query": "The Masterworks Museum of Bermuda Art Paget museum",
  "found": true,
  "page_title": "Masterworks Museum of Bermuda Art",
  "page_url": "https://en.wikipedia.org/wiki/Masterworks_Museum_of_Bermuda_Art",
  "extract": "Masterworks Museum of Bermuda Art (MMOBA) is a nonprofit organization dedicated to art made in and inspired by Bermuda. MMOBA was founded in 1987 by Tom Butterfield, MBE (born 1948) and has been located in the Bermuda Botanical Gardens in Paget Parish, Bermuda since 2008. The building was originally an arrowroot factory built in the mid 1800s that was renovated between 2004 and 2008 into a 16,000 square foot purpose-built museum. Part of the remaining original structure is home to the Arrowroot Gift Shop, which features art and crafts created by local artisans. Homer's Café which offers baked goods and lunch items, and also serves as a space to exhibit and sell local artists' work. The museum averages of 15,000 visitors per year from all over the world. MMOBA's official patron is the Prince of Wales, KG, KT, GCB, OM. MMOBA's core collection consists of paintings and drawings dating from the early 1800s to the present. The museum also holds objects relating to Bermuda's history and culture in the form of vernacular and fine-art photographs, sculpture, and historic documents and ephemera. Notable holdings include works by Winslow Homer, Georgia O'Keeffe, Albert Gleizes, Henry Moore, Marsden Hartley and Yousuf Karsh. Exhibits drawn from the permanent collection are on view in the main gallery and are rotated twice per year. Smaller exhibits in the Rick Fairies and Mezzanine Galleries, often featuring local artists or artists in residence, rotate more frequently. The Artist in Residence program allows international artists to create and exhibit new works inspired by their time in Bermuda. Educational programs include classes and workshops for both children and adults, and a free family-oriented art workshop, Super Saturday, takes place on the last Saturday of every month. The Charman Prize, which was established in 2008, is funded by British businessman and resident of Bermuda John Charman. It is a biannual exhibit and juried competition open to local artists.",
  "error": null,
  "fetched_at": "2026-01-24T20:41:12Z"
}
