{
  "search_query": "LA Plaza de Cultura y Artes Los Angeles museum",
  "found": true,
  "page_title": "LA Plaza de Cultura y Artes",
  "page_url": "https://en.wikipedia.org/wiki/LA_Plaza_de_Cultura_y_Artes",
  "extract": "LA Plaza de Cultura y Artes, also called LA Plaza, is a Mexican-American museum and cultural center in Los Angeles, California, USA that opened in April 2011. Housed in two historic buildings in downtown Los Angeles it includes a museum, a 30,000-square-foot outdoor space with a performance stage, an edible garden, and LA Cocina de Gloria Molina, a teaching kitchen and flexible event space. Through its two permanent exhibitions L.A. Starts Here! and Calle Principal: Mi México en Los Ángeles, along with rotating displays in two temporary galleries, LA Plaza’s exhibitions engage in an ongoing dialogue with the past, present, and future of Los Angeles. L.A. Starts Here! presents an alternative to traditional interpretations of Los Angeles history, aiming to change what the public knows about Mexicans and Mexican Americans in the city. On October 10, 2024, Los Angeles County Supervisor Hilda L. Solis announced a $2 million contribution to LA Plaza de Cultura y Artes to expand and renovate this exhibition. The renovation, expected to take three years to complete at a total cost of $5 million, will incorporate stories from Central and South America as well as Indigenous communities. The project will enhance access to research and information, foster greater community engagement, and introduce state-of-the-art interactive audiovisual technology, creating a more inclusive and welcoming experience for visitors. Calle Principal: Mi México en Los Ángeles is a reconstruction of 1920s Main Street and was designed by experienced design expert Tali Krakowsky. LA Plaza programming shares the history, cultures, values, and traditions of Mexicans, Mexican Americans, and all Latinos in Los Angeles and Southern California. It includes a series of salsa concerts, book talks, family days, poetry readings, dance performances, film screenings, workshops, tours, themed markets, and panel discussions. LA Plaza's public programs amplify several voices and identities, including Chicano, Afro-L...",
  "error": null,
  "fetched_at": "2026-01-24T20:24:41Z"
}
