{
  "search_query": "Rockford Area Museum Rockford museum",
  "found": true,
  "page_title": "Rockford, Illinois",
  "page_url": "https://en.wikipedia.org/wiki/Rockford,_Illinois",
  "extract": "Rockford is a city in Winnebago and Ogle counties in the U.S. state of Illinois. It is located in far northern Illinois on the banks of the Rock River. The fifth-most populous city in Illinois with a population of 148,655 at the 2020 census, it anchors the Rockford metropolitan area with 337,000 residents. Rockford is the county seat of Winnebago County and the most populous city in Illinois outside the Chicago metropolitan area. Settled in the mid-1830s as Midway, Rockford became strategic for industrial development, stemming from its location roughly equidistant between Lake Michigan and the Mississippi River. During the second half of the 19th century, it became notable for its production of heavy machinery, hardware, and tools. At the beginning of the 20th century, the city was the second leading center of furniture manufacturing in the U.S. During the second half of the 20th century, Rockford struggled alongside many Rust Belt cities to maintain its previous industrial presence. Since the late 1990s, efforts in economic diversification have led to the growth of automotive, aerospace, and healthcare industries, as well as the undertaking of various tourism and downtown revitalization efforts. Nicknamed \"the Forest City\" for its heavily forested residential neighborhoods during the 20th century, Rockford is known for various venues of cultural or historical significance, including Anderson Japanese Gardens, Klehm Arboretum, Tinker Swiss Cottage, the BMO Harris Bank Center, the Coronado Theatre, the Laurent House, and the Burpee Museum of Natural History. Its contributions to music are noted in the Mendelssohn Club, the oldest music club in the U.S., and performers such as Cheap Trick and Phantom Regiment Drum and Bugle Corps.",
  "error": null,
  "fetched_at": "2026-01-24T20:31:20Z"
}
