{
  "search_query": "Fort Wayne Museum of Art Fort Wayne museum",
  "found": true,
  "page_title": "Fort Wayne, Indiana",
  "page_url": "https://en.wikipedia.org/wiki/Fort_Wayne,_Indiana",
  "extract": "Fort Wayne is a city in Allen County, Indiana, United States, and its county seat. Located in northeastern Indiana, the city is 18 miles (29 km) west of the Ohio border and 50 miles (80 km) south of the Michigan border. The city's population was 263,886 at the 2020 census, making it the 2nd-most populous city in Indiana after Indianapolis, and the 83rd-most populous city in the U.S. The Fort Wayne metropolitan area, consisting of Allen and Whitley counties, has an estimated population of 463,000. Fort Wayne is the cultural and economic center of northeastern Indiana. Fort Wayne was built in 1794 by the United States Army under the direction of American Revolutionary War general Anthony Wayne, the last in a series of forts built near the Miami village of Kekionga. Named in Wayne's honor, the European-American settlement developed at the confluence of the St. Joseph, St. Marys, and Maumee rivers, known originally as Fort Miami, a trading post constructed by Jean Baptiste Bissot, Sieur de Vincennes around 1706. The modern city was platted in 1823 following its revitalization after the War of 1812 and its siege. It underwent tremendous growth after completion of the Wabash and Erie Canal and advent of the railroad. Once a booming manufacturing town located in what became known as the Rust Belt, Fort Wayne's economy in the 21st century is based upon distribution, transportation and logistics; healthcare, professional and business services; leisure and hospitality, and financial services. Home to the Fort Wayne Air National Guard Base, the city is a center for the defense industry, which employs 1–2% of the population. Fort Wayne was an All-America City Award recipient in 1983, 1998, 2009, and 2021. The city also received an Outstanding Achievement City Livability Award by the U.S. Conference of Mayors in 1999.",
  "error": null,
  "fetched_at": "2026-01-17T23:01:31Z"
}
