{
  "search_query": "Mark Twain House & Museum Hartford museum",
  "found": true,
  "page_title": "Mark Twain House",
  "page_url": "https://en.wikipedia.org/wiki/Mark_Twain_House",
  "extract": "The Mark Twain House and Museum in Hartford, Connecticut, was the home of Samuel Langhorne Clemens (Mark Twain) and his family from 1874 to 1891. The Clemens family had it designed by Edward Tuckerman Potter and built in the America High Gothic style. Clemens biographer Justin Kaplan has called it \"part steamboat, part medieval fortress and part cuckoo clock.\" Clemens wrote many of his best-known works while living there, including The Adventures of Tom Sawyer, The Prince and the Pauper, Life on the Mississippi, Adventures of Huckleberry Finn, A Tramp Abroad, and A Connecticut Yankee in King Arthur's Court. Poor financial investments prompted the Clemens family to move to Europe in 1891. The Panic of 1893 further threatened their financial stability, and Clemens, his wife Olivia, and their middle daughter, Clara, spent the year 1895–96 traveling so that he could lecture and earn the money to pay off their debts. He recounted the trip in Following the Equator (1897). Their other two daughters, Susy and Jean, had stayed behind during this time, and Susy died at home on August 18, 1896, of spinal meningitis before the family could be reunited. They could not bring themselves to reside in the house after this tragedy and spent most of their remaining years living abroad. They sold the house in 1903. The building later functioned as a school, an apartment building, and a public library branch. In 1929, it was rescued from possible demolition and put under the care of the newly formed non-profit group Mark Twain Memorial. The building was declared a National Historic Landmark in 1962. A restoration effort led to its being opened as a house museum in 1974. In 2003, a multimillion-dollar, LEED-certified visitors' center was built that included a museum dedicated to showcasing Twain's life and work. The house faced serious financial trouble in 2008 due partly to construction cost overruns related to the new visitors' center, but the museum was helped through publicity about ...",
  "error": null,
  "fetched_at": "2026-01-24T20:25:44Z"
}
