{
  "state": "District of Columbia",
  "state_code": "DC",
  "last_updated": "2026-01-16T20:07:00.511679+00:00Z",
  "museums": [
    {
      "museum_id": "usa-dc-unknown-american-university-museum",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "American University Museum",
      "alternate_names": null,
      "website": "http://www.american.edu/cas/museum",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 38.93694,
      "longitude": -77.08947,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.american.edu/cas/museum",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: Access forbidden (403) for http://www.american.edu/cas/museum",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:35:15Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "2028851300",
      "is_scoreable": false,
      "content_summary": "The American University Museum in Washington, D.C. is a vibrant hub of contemporary art and culture, making it a must-visit destination for art enthusiasts and travelers alike. Nestled within the heart of the university campus, this unique museum offers a dynamic blend of exhibitions, workshops, and cultural events that truly celebrate the diversity of artistic expression.",
      "content_description": "**American University Museum** is not just a place to view art; it’s an immersive experience that intertwines academia with the vibrant world of contemporary art. Established as part of American University, this museum showcases a diverse range of exhibitions that highlight both local and international artists. Visitors can explore works spanning various mediums, from *painting* and *sculpture* to *mixed media* installations that challenge traditional boundaries. Each exhibition is carefully curated, reflecting themes that resonate with contemporary social issues, cultural dialogues, and innovative artistic practices.  Moreover, the museum regularly hosts artist talks, workshops, and panel discussions, providing an enriching experience that fosters a deeper understanding of the artworks on display.  In addition to the exhibits, the museum's architecture is noteworthy with its open, inviting spaces that encourage exploration and contemplation. The gallery layout enhances the interactive experience, allowing visitors to connect with the art in a meaningful way.  Whether you are an art aficionado or simply curious, your visit to **American University Museum** will leave you inspired by the compelling narratives expressed through art. Don’t miss the chance to engage with thought-provoking works that speak to the complexities of today's world.  Experience creativity, inspiration, and dialogue in this extraordinary space.",
      "content_highlights": [
        "Diverse exhibitions of contemporary art from local and international artists",
        "Engaging public programs, including artist talks and workshops",
        "Strategic integration of art and academia",
        "Inviting architectural design enhancing visitor interaction",
        "Dynamic curatorial themes addressing social issues"
      ],
      "content_generated_at": "2026-01-25T01:35:15Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-corcoran-gallery-of-art",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "Corcoran Gallery of Art",
      "alternate_names": null,
      "website": "http://www.corcoran.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "500 SEVENTEENTH ST NW",
      "address_line2": null,
      "postal_code": "20006",
      "latitude": 38.89616,
      "longitude": -77.03946,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 1,
      "collection_tier": 1,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 2,
      "modern_contemporary_strength": 3,
      "primary_art": "Modern/Contemporary",
      "historical_context_score": 3,
      "priority_score": 16,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The Corcoran Gallery of Art is no longer operational, and its collection has been distributed to other institutions, leading to a score of 0 for collection-based strength. Its reputation remains as a national art destination, as indicated by the prior reputation score of 1.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.corcoran.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 5,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: Network error accessing http://www.corcoran.org: HTTP 500 for http://www.corcoran.org; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:35:25Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 2,
      "phone": "2026391700",
      "is_scoreable": true,
      "content_summary": "A landmark in Washington, D.C.’s cultural history, the Corcoran Gallery of Art is best known for its legacy as one of America’s earliest major art museums and a champion of American artists. Though the Corcoran’s collection is no longer displayed on-site, the building remains an architectural and institutional touchstone—especially for visitors interested in the city’s museum story beyond the Smithsonian. Come for the history of patronage, the spirit of ambitious exhibitions, and a sense of how Washington became an art capital.",
      "content_description": "**The Corcoran Gallery of Art** occupies a distinctive place in Washington’s art life: founded in the 19th century by banker and philanthropist William Wilson Corcoran, it helped set a precedent for private patronage shaping a national cultural scene. For generations, the Corcoran was closely associated with advancing **American art**, mounting influential exhibitions and presenting ambitious surveys that broadened what Washington audiences could see. While the museum no longer operates in its original form and its holdings are not presented there as a single, intact collection, the Corcoran name still resonates with art lovers as a signpost in the evolution of museum culture in the United States.\n\nArchitecturally, the Corcoran’s historic home is itself a work of civic artistry—an elegant, grand-scale museum building designed to feel ceremonial, with an emphasis on **monumental galleries** and a dignified sense of procession. Visiting the site is rewarding for travelers who appreciate museum architecture: the experience evokes the 19th-century ideal of the art museum as a temple-like public space, where light, proportion, and decorative detail heighten the act of looking.\n\nFor today’s art-focused traveler, a Corcoran visit is less about “checking off” a permanent collection and more about engaging with Washington’s cultural infrastructure—pair it with nearby institutions to trace the city’s shifting art map. Come with an eye for the building’s atmosphere, the legacy of exhibition-making, and the wider story of how *American art* has been promoted, debated, and displayed in the capital.",
      "content_highlights": [
        "A pivotal 19th-century institution that helped define Washington, D.C. as a serious center for American art and exhibitions",
        "Historic museum architecture with a grand, ceremonial gallery layout designed to elevate the viewing experience",
        "A legacy tied to major American art patronage and the development of non-Smithsonian cultural life in the capital",
        "An ideal stop for travelers interested in museum history—how collections, donors, and exhibitions shape public taste",
        "Best experienced as part of an art itinerary linking nearby D.C. museums and galleries to contextualize the Corcoran’s influence"
      ],
      "content_generated_at": "2026-01-25T01:35:25Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "overall_quality_score": 13,
      "collection_based_strength": 0
    },
    {
      "museum_id": "usa-dc-unknown-dumbarton-house",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "Dumbarton House",
      "alternate_names": null,
      "website": "http://dumbartonhouse.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "1703 32ND STREET NW",
      "address_line2": null,
      "postal_code": "20007",
      "latitude": 38.91465,
      "longitude": -77.06352,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "Botanical Garden",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: blocked by robots.txt",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:35:33Z",
      "notes": "CSV: museum type 'ARBORETUM, BOTANICAL GARDEN, OR NATURE CENTER' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 2,
      "is_scoreable": false,
      "content_summary": "Dumbarton House is a hidden gem in Washington, D.C., where history entwines beautifully with nature. This elegant estate, set within a stunning botanical garden, offers visitors a unique glimpse into early American life, making it a must-visit for history buffs and nature lovers alike.",
      "content_description": "**Dumbarton House** not only stands as a magnificent example of Federal architecture but also serves as a vibrant botanical garden, providing visitors with a serene escape in the heart of Washington, D.C. Built in 1799, this house has been meticulously preserved, allowing you to step back into a world of early American elegance. As you stroll through its lush gardens, you’ll discover a curated collection of historical plants that reflect the gardening practices of the early 19th century, showcasing both native and exotic species that tell stories of exploration and cultural exchange. The garden's design enhances the historical atmosphere of the house, giving visitors a picturesque setting to ponder the past while enjoying the present’s calming beauty. In addition to the breathtaking flora, the house itself is a trove of finely crafted *Federal-style* furnishings and art, which captivates visitors with its rich history and charming ambiance.  Often overlooked, this museum also hosts a range of educational programs and special events that highlight its role in the community, making each visit unique and enriching. Whether you are enjoying a seasonal garden tour, attending a workshop, or simply wandering its scenic paths, **Dumbarton House** offers a delightful intersection of culture and nature that will leave a lasting impression on every visitor.  Prepare to be enchanted by this remarkable venue, where every leaf and historical artifact adds depth to your experience.  ",
      "content_highlights": [
        "Exquisite Federal-style architecture",
        "Lush botanical garden featuring historical plant species",
        "Unique educational programs blending history and horticulture",
        "Scenic waterfront views alongside the garden paths",
        "Engaging special events throughout the year"
      ],
      "content_generated_at": "2026-01-25T01:35:33Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-international-arts-and-artists-hillyer-art-space",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "NW Washington",
      "museum_name": "International Arts and Artists’ Hillyer Art Space",
      "alternate_names": null,
      "website": "http://www.artsandartists.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "9 Hillyer Court",
      "address_line2": null,
      "postal_code": "20008",
      "latitude": 38.91184,
      "longitude": -77.04839,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "General Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": "https://www.facebook.com/artsandartists",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 2,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.artsandartists.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:35:41Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "2023380680",
      "is_scoreable": false,
      "content_summary": "The **International Arts and Artists’ Hillyer Art Space** in NW Washington is a dynamic platform for innovative contemporary art that aims to connect artists and the public. Visitors can immerse themselves in unique exhibitions and engage with a diverse array of artistic expressions, making it a must-see for anyone interested in the heartbeat of today's art scene.",
      "content_description": "**International Arts and Artists’ Hillyer Art Space** stands out as a vibrant hub for contemporary art in the heart of Washington, DC. This general museum isn't just a gallery; it embodies a commitment to promoting international artists who push the boundaries of creativity and challenge perceptions. The space, both intimate and inviting, showcases rotating exhibitions that spotlight the bold, thought-provoking work of emerging and underrepresented artists from around the globe. As visitors walk through its thoughtfully curated spaces, they can expect to encounter a diverse spectrum of artistic mediums, including painting, sculpture, photography, and installation art. Each exhibition invites dialogue and introspection, making the experience deeply personal and communal at once. Now situated in an architecturally appealing setting, the museum encourages exploration and encourages the gravity of the displayed works to resonate with guests.  \n\nIn addition to its stunning exhibitions, **Hillyer Art Space** offers a range of public programs, including artist talks, workshops, and community engagement initiatives that further bridge the gap between artists and audiences. This interactive approach to art is what sets **Hillyer** apart from typical museums: visitors are not just passive observers but active participants in the gallery's mission. Whether you are a seasoned art connoisseur or a curious newcomer, **Hillyer Art Space** provides an enriching environment that fosters appreciation for contemporary creativity and cultural exchange, making it a genuinely unique destination in Washington's cultural landscape.",
      "content_highlights": [
        "Dynamic rotating exhibitions of contemporary art",
        "Focus on underrepresented and emerging international artists",
        "Interactive public programs, workshops, and discussions",
        "Inviting and intimate gallery space fostering engagement",
        "Contribution to the local arts community through unique collaborations"
      ],
      "content_generated_at": "2026-01-25T01:35:41Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-jewish-historical-society-of-greater-washington-lilian-albert-small-jewish-museum",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington",
      "museum_name": "Jewish Historical Society of Greater Washington/Lilian & Albert Small Jewish Museum",
      "alternate_names": null,
      "website": "http://www.jhsgw.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "575 3rd St NW, Washington, DC 20001, USA",
      "address_line2": null,
      "postal_code": "20001",
      "latitude": 38.8972102,
      "longitude": -77.0148742,
      "place_id": "ChIJRSJWXom3t4kRzZklOUS4c8k",
      "address_source": "google_places",
      "address_last_verified": "2026-01-17",
      "museum_type": "General Museum",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.jhsgw.org",
        "museums_csv",
        "google_places_api"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: DNS lookup failed for http://www.jhsgw.org; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:35:49Z",
      "notes": "CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "(202) 789-0900",
      "website_google": "http://www.capitaljewishmuseum.org/",
      "business_status": "OPERATIONAL",
      "opening_hours_structured": {
        "open_now": true,
        "periods": [
          {
            "close": {
              "day": 0,
              "time": "1700"
            },
            "open": {
              "day": 0,
              "time": "1000"
            }
          },
          {
            "close": {
              "day": 3,
              "time": "1700"
            },
            "open": {
              "day": 3,
              "time": "1000"
            }
          },
          {
            "close": {
              "day": 4,
              "time": "1700"
            },
            "open": {
              "day": 4,
              "time": "1000"
            }
          },
          {
            "close": {
              "day": 5,
              "time": "1700"
            },
            "open": {
              "day": 5,
              "time": "1000"
            }
          },
          {
            "close": {
              "day": 6,
              "time": "1700"
            },
            "open": {
              "day": 6,
              "time": "1000"
            }
          }
        ],
        "weekday_text": [
          "Monday: Closed",
          "Tuesday: Closed",
          "Wednesday: 10:00 AM – 5:00 PM",
          "Thursday: 10:00 AM – 5:00 PM",
          "Friday: 10:00 AM – 5:00 PM",
          "Saturday: 10:00 AM – 5:00 PM",
          "Sunday: 10:00 AM – 5:00 PM"
        ]
      },
      "open_now": true,
      "google_rating": 4.6,
      "google_reviews_count": 134,
      "google_reviews": [
        {
          "author_name": "aki okuda",
          "author_url": "https://www.google.com/maps/contrib/105844850958720822491/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVycpyTlKoEKeQM3gKKIMlzjCWZY-_CBx-9xsksZvLYGHbQHA=s128-c0x00000000-cc-rp-mo-ba7",
          "rating": 5,
          "relative_time_description": "2 months ago",
          "text": "While Washington D.C. does not host a dedicated National Museum of American Jewish History (that museum is in Philadelphia), the city's United States Holocaust Memorial Museum (USHMM) is crucial for understanding a pivotal chapter in Jewish history. Its mission is to preserve the memory of the Holocaust, ensuring that visitors grasp the terrifying results of antisemitism and the need to defend democratic values. The museum's historical narrative and extensive archives are vital for educating the world about this dark period, serving as a powerful, permanent reminder of the ultimate cost of indifference.",
          "time": 1762822847,
          "translated": false
        },
        {
          "author_name": "Pablo Reinoso Amaro",
          "author_url": "https://www.google.com/maps/contrib/112665966710484454150/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwUIiGCoM0Ra9sCAQ7P2Y0eKnLKXkoqPNgQj8iGsk-myQl4JY=s128-c0x00000000-cc-rp-mo-ba4",
          "rating": 5,
          "relative_time_description": "a month ago",
          "text": "A very moving and well-curated museum. The exhibits are thoughtfully designed and tell powerful stories about Jewish history, culture, and resilience, with a strong connection to Washington, D.C. The space is modern, informative, and easy to navigate, and the staff was welcoming and knowledgeable. I left with a deeper understanding and appreciation of the community’s contributions and experiences. Highly recommended for anyone interested in history, culture, and education.",
          "time": 1765758602,
          "translated": false
        },
        {
          "author_name": "Adam Fagen",
          "author_url": "https://www.google.com/maps/contrib/104198283518659207849/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUe9QthVQ_d9ZfsUj3b1chAl8McHakUVbaVjcxlTaq4CxQ2jd_o=s128-c0x00000000-cc-rp-mo-ba5",
          "rating": 5,
          "relative_time_description": "in the last week",
          "text": "Great museum to learn about the Jewish community in and around DC. Engaging exhibits, historic synagogue, even a gift shop and cafe.",
          "time": 1768345317,
          "translated": false
        },
        {
          "author_name": "Lav Kelley",
          "author_url": "https://www.google.com/maps/contrib/109869437627075167542/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwdshNWnDIR5mJqTzNEPrOUT4sOHg_iHAKJLX6MSqo1_hQT7d26w=s128-c0x00000000-cc-rp-mo-ba5",
          "rating": 5,
          "relative_time_description": "7 months ago",
          "text": "Museums should definitely share history and impart an understanding of their particular specialty. Capital Jewish Museum definitely does that. However, it does far more. I find the exhibits engaging and thoughtful in ways that matter especially in a world that wants to flatten experiences to short sound bites. I also love the wonderful events they host and specialized exhibits. What's most fascinating, is learning about the historic synagogue building that's part of the museum and has been moved multiple times to preserve it. Like all of Washington DC, it represents the way this city is always changing and welcomes people to move and change with it.",
          "time": 1749500370,
          "translated": false
        },
        {
          "author_name": "Maya",
          "author_url": "https://www.google.com/maps/contrib/103108152791336908603/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInlnENn6_Uef2sc7n3YJTwVHnK3aDF8XSEjTm4Za9b8ju1iw=s128-c0x00000000-cc-rp-mo-ba4",
          "rating": 5,
          "relative_time_description": "a year ago",
          "text": "Accessibility Audit:\n\nThe Capital Jewish Museum opened in 2023 and has been very deliberate about accessibility and diversity.\n\nThe first 2 floors are free to visitors.\n\nThere is a ramp to enter with accessible door openers on F street where they have wand security. You can request a complimentary wheelchair (wide-based manual chair with no cushion).\n\nThe 1st floor exhibit weaves together the intersections between Indigenous, black, Jewish, LGBTQIA+ and mainstream local and national American history from 1790-2023. The exhibit was at the perfect height for a wheelchair user. The door to enter the exhibit (as shown in the pictures) seemed quite narrow, but did perfectly fit the wide-based manual wheelchair and someone's stroller. People standing had to look down since most of the timeline was at hip height. There is one bench in the space. I'd recommend 2 hours here if you like to read everything thoroughly.\n\nThere did not seem to be a Braille or audio option in this space, so it would not currently be accessible to people who are blind or low vision. Someone who works here though said they are exploring options to address this though.\n\nThere is a functional elevator to the second floor. All exhibits either had the doors propped open or had touchless accessible door openers. The 2nd and 3rd floors had an AED and water fountains available. The air conditioning made it nice and cool even with all the natural light and it being a 100 degree day outside. There was a lip threshold to enter the bathroom that was tricky to maneuver while also pushing open the door. The 2nd floor spaces were wide enough to maneuver. There were some great interactive sections and ways to advocate for things like DC Statehood by personalizing templated letters that they would mail. I'd recommend about an hour and a half here.\n\nThe third floor had the paid Deli Special Exhibit and a rooftop. The rooftop accessibility button worked, but you'd have to nudge the door after pressing the button to help it get started (both inside and outside).\n\nI would highly recommend this museum. The attention to accessibility made it feel like people with disabilities are welcome. It was such a relief to be able to enjoy like anyone else.\n\nBtw this and other accessible reviews are on the Roll Mobility app! This is not an ad. I just stumbled upon the app and use it.\nhttps://rollappinc.page.link/TXwW",
          "time": 1718927376,
          "translated": false
        }
      ],
      "is_scoreable": false,
      "content_summary": "The **Jewish Historical Society of Greater Washington/Lilian & Albert Small Jewish Museum** offers an intimate yet profound exploration of the Jewish experience in the nation's capital. Through its unique collection and engaging exhibitions, visitors gain insights into the cultural, historical, and social contributions of Jewish communities in Washington, DC. This museum promises a meaningful journey through shared stories and heritage that connects the past to the present.",
      "content_description": "**The Jewish Historical Society of Greater Washington/Lilian & Albert Small Jewish Museum** is a hidden gem nestled in the heart of Washington, DC. This captivating museum not only chronicles the rich history of Jewish life in the capital but also highlights the significant contributions of Jewish Americans to the broader American narrative. Visitors are welcomed into an engaging space that beautifully melds historical artifacts, photographs, and oral histories, inviting them to connect deeply with the stories encapsulated within its walls. The museum's collections, including rare documents and photographs, illustrate the vibrancy and resilience of the Jewish community, making it an essential stop for history buffs and cultural enthusiasts alike.   \n\nGuests are often captivated by the museum's exquisite architecture, featuring elements reflective of the early 20th-century design that create a warm and welcoming atmosphere. The exhibits provide a thoughtful commentary on the immigrant experience, anti-Semitism, and the enduring strength of faith and community. Furthermore, the museum offers interactive programming and special events that enrich the visitor experience. Whether you're enjoying a guided tour or participating in a thought-provoking lecture, the museum cultivates an environment where learning and dialogue flourish. Overall, the **Jewish Historical Society of Greater Washington/Lilian & Albert Small Jewish Museum** is more than a place of artifacts; it is a celebration of culture, resilience, and history that inspires all who enter.",
      "content_highlights": [
        "Intriguing exhibits on the history of Jewish communities in Washington, DC",
        "Rare photographs and historical documents detailing the Jewish immigrant experience",
        "Engaging storytelling through oral histories from local Jewish residents",
        "Special programming and events that foster community dialogue",
        "Beautiful early 20th-century architecture enhancing the visitor experience"
      ],
      "content_generated_at": "2026-01-25T01:35:49Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-kreeger-museum",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "Kreeger Museum",
      "alternate_names": null,
      "website": "http://www.kreegermuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "2401 FOXHALL ROAD NW",
      "address_line2": null,
      "postal_code": "20007",
      "latitude": 38.92284,
      "longitude": -77.08888,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.kreegermuseum.org/visit",
      "tickets_url": "http://www.kreegermuseum.org/visit/reservations",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.kreegermuseum.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:35:55Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 2,
      "phone": "2023373050",
      "is_scoreable": false,
      "content_summary": "Nestled in the heart of Washington, D.C., the **Kreeger Museum** offers a unique blend of art, architecture, and natural beauty. Its intimate setting and impressive collection make it a hidden gem worth exploring for both art lovers and casual visitors alike.",
      "content_description": "**The Kreeger Museum** is more than just a place to view art; it's an immersive experience that harmonizes visual artistry with architectural elegance. Founded by David and Carmen Kreeger, the museum opened its doors in 1994 and is celebrated for its unique blend of *Impressionist* and *Post-Impressionist* paintings, along with notable works of *modern* and *contemporary* art. The collections include pieces by renowned artists such as *Picasso*, *Monet*, and *Matisse*, showcasing a diverse array of styles and mediums that invite visitors to engage with the evolution of art across different periods. The museum's intimate atmosphere allows for a contemplative experience, where every corner reveals something intriguing, encouraging visitors to linger and reflect. In addition to its art, the museum is set within a stunning building designed by architect *Philip Johnson*, celebrated for both its aesthetics and its seamless integration with the surrounding landscape. The lush gardens, featuring sculptures and tranquil pathways, compel you to wander and enjoy the interplay of nature and artistry. Here, you can find inspiration in every step, whether you’re viewing a striking *abstract sculpture* or enjoying the serene views of the adjoining gardens. Each visit is a personal journey through artistic expression and architectural brilliance, making the **Kreeger Museum** a must-see destination in the nation's capital.",
      "content_highlights": [
        "Impressive collection of Impressionist and Post-Impressionist art",
        "Architecturally stunning building designed by Philip Johnson",
        "Renowned works by artists such as Picasso and Monet",
        "Beautifully landscaped gardens featuring outdoor sculptures",
        "Intimate atmosphere enhancing the visitor experience"
      ],
      "content_generated_at": "2026-01-25T01:35:55Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-national-building-museum",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "National Building Museum",
      "alternate_names": null,
      "website": "http://www.nbm.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 38.89779,
      "longitude": -77.01752,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://nbm.org/visit/buy-tickets/",
      "tickets_url": "https://nbm.org/visit/buy-tickets/",
      "reservation_required": null,
      "accessibility_url": "https://nbm.org/visit/accessibility/",
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.nbm.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:36:03Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "2022722448",
      "is_scoreable": false,
      "content_summary": "The **National Building Museum** in Washington, D.C. is a unique tribute to architecture, design, and construction. Its stunning Beaux-Arts architecture and immersive exhibitions make it a must-visit for anyone interested in the built environment. Experience hands-on activities, engaging displays, and thought-provoking themes that celebrate the art of building.",
      "content_description": "**The National Building Museum** stands as a monumental shrine to architecture and design in the heart of Washington, D.C. Housed in a former U.S. Pension Bureau building, this museum showcases stunning **Beaux-Arts** architecture characterized by its grand interior space and striking brick columns. Visitors are immediately drawn to the breathtaking Great Hall, where a magnificent atrium stretches skyward, adorned with exquisite skylights that fill the space with natural light. The museum is a celebration of the built environment, spanning the realm of architecture, urban planning, and landscape design. Through its extensive collections and dynamic displays, guests can appreciate the interconnection of these fields in shaping the world around us.   With exhibitions that range from historical architecture to modern design innovations, each visit offers something new and insightful.   Hands-on activities and interactive presentations make for a captivating experience, appealing to visitors of all ages and backgrounds. The museum encourages you to think critically about the spaces we inhabit and the impact of construction on our lives. Explore the unique perspectives on how buildings influence culture and society, complemented by seasonal exhibitions that bring fresh ideas and topics to the forefront of architectural discourse.   This journey through the architecture and construction landscape is not just educational; it's also a celebration of human creativity and ingenuity, inviting each visitor to engage, reflect, and be inspired. You won't want to miss the **National Building Museum** during your D.C. adventure!",
      "content_highlights": [
        "Stunning Beaux-Arts architecture of the museum itself",
        "The Great Hall with its impressive atrium and skylights",
        "Interactive exhibitions on architectural innovation and urban planning",
        "Seasonal features that explore contemporary design themes",
        "Family-friendly hands-on activities that engage children and adults alike"
      ],
      "content_generated_at": "2026-01-25T01:36:03Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-national-portrait-gallery",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "City of Westminster",
      "museum_name": "National Portrait Gallery",
      "alternate_names": null,
      "website": "https://npg.si.edu/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "1 Home Smithsonian Institution Museum Location National Portrait Gallery 8th and G St",
      "address_line2": null,
      "postal_code": "20001",
      "latitude": 38.90477,
      "longitude": -77.03023,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://npg.si.edu/visiting-the-museum",
      "tickets_url": "https://www.eventbrite.com/e/a-day-of-community-tickets-1977387635648",
      "reservation_required": null,
      "accessibility_url": "https://npg.si.edu/access",
      "reputation": 0,
      "collection_tier": 1,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 1,
      "modern_contemporary_strength": 3,
      "primary_art": "Modern/Contemporary",
      "historical_context_score": 3,
      "priority_score": 14,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The National Portrait Gallery provides a strong regional context through its focus on portraits of historically significant figures, but its collection is limited to this thematic scope. It does not house important works from the Impressionist or Modern/Contemporary art movements, thus scoring low on collection-based strength.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "https://npg.si.edu",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'City of Westminster' from open data; MRD: computed city_tier=3 for City of Westminster; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:36:16Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "2026338300",
      "is_scoreable": true,
      "content_summary": "In the heart of Westminster, the National Portrait Gallery offers an unusually intimate way to experience British history: through faces. From Tudor power plays to modern celebrity culture, its portraits capture the evolving ideas of identity, status, and fame. The museum is celebrated internationally for pairing iconic sitters with standout artists, making it a must for art lovers who want both aesthetic pleasure and a vivid narrative of the people who shaped Britain.",
      "content_description": "**The National Portrait Gallery** in the City of Westminster is one of London’s most rewarding stops for travelers who like their art with a strong human story. Rather than organizing the past by battles or monarchs, it builds a living timeline through portraits—images made to persuade, memorialize, and project status. Expect a compelling range of media: painted portraits, sculpture, photography, and works on paper that chart how likeness-making evolves from courtly display to modern image culture. Among the best-known treasures are the **Chandos portrait of William Shakespeare**, Hans Holbein the Younger’s sharply observed sitters from the Tudor world, and later icons such as Joshua Reynolds and Thomas Gainsborough, where *Grand Manner* ambition meets painterly bravura.\n\nArchitecturally, the gallery’s Westminster setting adds to the sense of occasion: you move through a purpose-built cultural landmark and its contemporary additions with the feeling of stepping into a national memory palace. The visitor experience is designed for looking closely—faces, fabrics, props, and gestures—so plan to slow down and compare styles: the crisp realism of *Renaissance* portraiture, the theatricality of *Baroque* and *Georgian* society painting, and the frank immediacy of modern photography.\n\nFor art enthusiasts, the pleasure lies in the mix: **canonical works you’ll recognize** alongside discoveries in quieter rooms. Allow time for curated thematic displays and temporary exhibitions, which often make surprising connections between art, politics, literature, and celebrity—and leave you seeing portraiture not as illustration, but as **a sophisticated art of identity**.",
      "content_highlights": [
        "The Chandos portrait of William Shakespeare—one of the most famous images of Britain’s playwright",
        "Tudor and Renaissance portraiture, including works associated with Hans Holbein the Younger",
        "Georgian masters such as Joshua Reynolds and Thomas Gainsborough, showcasing the *Grand Manner* tradition",
        "A strong photography presence tracing modern fame, politics, and cultural change through the portrait",
        "Rotating temporary exhibitions and themed hangings that reframe British history through art and identity"
      ],
      "content_generated_at": "2026-01-25T01:36:16Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "overall_quality_score": 14,
      "collection_based_strength": 1
    },
    {
      "museum_id": "usa-dc-unknown-phillips-collection",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "Phillips Collection",
      "alternate_names": null,
      "website": "http://www.phillipscollection.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 38.91199,
      "longitude": -77.04671,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Art Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.phillipscollection.org/visit",
      "tickets_url": "http://www.phillipscollection.org/visit",
      "reservation_required": true,
      "accessibility_url": "http://www.phillipscollection.org/about/diversity",
      "reputation": 1,
      "collection_tier": 1,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 4,
      "modern_contemporary_strength": 4,
      "primary_art": "Modern/Contemporary",
      "historical_context_score": 3,
      "priority_score": 9,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The Phillips Collection has a strong holding of Impressionist and modern works, including canonical artists like Renoir and Monet, which supports a Major Scholarly Collection score. Its historical context score reflects its role in providing a solid but not nationally defining narrative of art history, while the reputation score acknowledges its notable regional influence.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.phillipscollection.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 4,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:36:28Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "2023872151",
      "is_scoreable": true,
      "content_summary": "An essential stop for art lovers in Washington, D.C., the Phillips Collection offers an intimate, scholarly encounter with modern art in a refined townhouse setting. Founded by collector Duncan Phillips, it pairs masterworks by Renoir, Rothko, and O’Keeffe with unexpected dialogues across time and style. Its jewel-box galleries reward slow looking—close enough to see brushwork, color relationships, and daring compositions—making the experience feel personal rather than monumental, even as the collection ranks among the nation’s most influential.",
      "content_description": "Tucked into Dupont Circle, **The Phillips Collection** pioneered the idea of the American “museum of modern art” as a living, intimate space for close viewing. Founded in 1921 by Duncan Phillips, it remains deeply shaped by a collector’s eye and a scholar’s rigor—galleries are arranged to spark visual conversations rather than march through a strict timeline. That curatorial approach is one of the museum’s great pleasures: you’re invited to compare color, texture, and mood across artists and eras, and to linger with works at a human scale.\n\nThe collection is especially strong in *Impressionism* and *Post-Impressionism* through to early and mid-century modernism. Expect touchstone names—Renoir, Degas, Cézanne, Van Gogh, Bonnard, and Matisse—alongside American modernists such as Georgia O’Keeffe and Arthur Dove. A defining centerpiece is Pierre-Auguste Renoir’s **“Luncheon of the Boating Party,”** often experienced here not as a famous reproduction, but as a radiant, life-sized tableau of light, friendship, and virtuoso brushwork.\n\nArchitecturally, the museum’s historic townhouse atmosphere is part of the draw: **domestic-scale rooms**, warm materials, and carefully lit galleries encourage unhurried looking. For visitors, it’s a respite from blockbuster crowds—ideal for art enthusiasts who want to study surfaces up close, notice curatorial pairings, and leave feeling they’ve truly spent time with the art rather than simply passed it by.",
      "content_highlights": [
        "Pierre-Auguste Renoir’s “Luncheon of the Boating Party,” the museum’s signature masterpiece",
        "Intimate townhouse galleries designed for close looking and thoughtful, dialogue-based hangs",
        "Exceptional strengths in Impressionism, Post-Impressionism, and early modern art (Cézanne, Van Gogh, Bonnard, Matisse)",
        "Significant American modernism holdings, including works by Georgia O’Keeffe and Arthur Dove",
        "A scholarly, nationally respected collection presented in a calm, personal viewing experience near Dupont Circle"
      ],
      "content_generated_at": "2026-01-25T01:36:28Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "overall_quality_score": 18,
      "eca_score": 3,
      "collection_based_strength": 4,
      "primary_art_focus": "Impressionist"
    },
    {
      "museum_id": "usa-dc-unknown-smithsonian-american-art-museum-and-renwick-gallery",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "NW Washington",
      "museum_name": "Smithsonian American Art Museum and Renwick Gallery",
      "alternate_names": null,
      "website": "https://americanart.si.edu/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "00 pm Renwick Gallery Pennsylvania Avenue at 17th Street",
      "address_line2": null,
      "postal_code": "20006",
      "latitude": 38.90105,
      "longitude": -77.04009,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://americanart.si.edu/visit",
      "tickets_url": "https://americanart.si.edu/search/books",
      "reservation_required": null,
      "accessibility_url": "https://americanart.si.edu/visit/accessibility",
      "reputation": 0,
      "collection_tier": 1,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 2,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 2,
      "modern_contemporary_strength": 3,
      "primary_art": "Modern/Contemporary",
      "historical_context_score": 3,
      "priority_score": 14,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The Smithsonian American Art Museum and Renwick Gallery has limited collection presence with a score of 1, indicating small or inconsistent holdings of scholarly relevance. The historical context score of 3 reflects its moderate importance in anchoring the history of American craft and decorative arts, but it does not have a significant influence on national scholarship.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "https://americanart.si.edu",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted city 'Washington' from JSON-LD; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:36:43Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "2023571445",
      "is_scoreable": true,
      "content_summary": "In NW Washington, the Smithsonian American Art Museum and its jewel-box companion, the Renwick Gallery, offer a richly layered tour of American creativity—from iconic paintings and photographs to boundary-pushing contemporary craft. Housed in historic landmark buildings near the National Mall and the White House, they’re ideal for art lovers who want both museum “greatest hits” and surprise discoveries. Expect strong holdings in American realism, modernism, and folk traditions, plus immersive installations and impeccable architectural atmospheres.",
      "content_description": "**Smithsonian American Art Museum (SAAM)** is one of the best places in Washington to understand how American artists have pictured—and debated—the nation. Its strengths span **early portraiture and landscape**, the grit and lyricism of **American realism**, and key strands of *modernism* and *contemporary* practice. Seek out touchstones like **Edward Hopper**, **Georgia O’Keeffe**, **Winslow Homer**, **John Singer Sargent**, **Jacob Lawrence**, and **Nam June Paik**, alongside photography and deeply engaging folk and self-taught art that expands the story beyond the canon. For visitors, the pleasure is in the breadth: you can move from 19th‑century painting to time-based media in a single afternoon and come away with a sharper sense of American visual culture.\n\nA major part of the experience is architectural. SAAM shares the grand **Old Patent Office Building**, where soaring, daylit galleries and monumental staircases lend a civic scale to the art; the **Kogod Courtyard** (a glass-canopied interior courtyard) offers a calm pause between galleries. A short distance away, the **Renwick Gallery**—a historic, French Second Empire-style landmark near the White House—celebrates American craft and decorative arts with bracing ambition: think *studio craft*, sculpture-in-the-round, and often spectacular, room-filling installations that reward slow looking and repeat visits.\n\nTogether, they make an ideal two-stop itinerary: start with SAAM’s big-picture survey, then finish at the Renwick for **craft as contemporary art**, with plenty of architectural beauty in between.",
      "content_highlights": [
        "SAAM’s wide-ranging survey of American art, from early portraiture and landscapes to contemporary media",
        "Notable works by major figures such as Edward Hopper, Georgia O’Keeffe, Winslow Homer, John Singer Sargent, Jacob Lawrence, and Nam June Paik",
        "The Old Patent Office Building: landmark architecture with soaring galleries and a stately, museum-temple atmosphere",
        "Kogod Courtyard at SAAM: a glass-roofed oasis for a quiet break between galleries",
        "Renwick Gallery’s standout focus on American craft and decorative arts, often featuring immersive, large-scale installations"
      ],
      "content_generated_at": "2026-01-25T01:36:43Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "overall_quality_score": 14,
      "collection_based_strength": 1
    },
    {
      "museum_id": "usa-dc-unknown-the-george-washington-university-museum-and-the-textile-museum",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "NW Washington",
      "museum_name": "The George Washington University Museum and The Textile Museum",
      "alternate_names": null,
      "website": "https://museum.gwu.edu/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "10 a.m.-5 p.m. Closed on university holidays . 701 21st Street",
      "address_line2": null,
      "postal_code": "20052",
      "latitude": 39.05186,
      "longitude": -77.43757,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://museum.gwu.edu/visit",
      "tickets_url": "https://museum.gwu.edu/request-event-reservation",
      "reservation_required": null,
      "accessibility_url": "https://accessibility.gwu.edu/?utm_medium=link&utm_campaign=global-footer&utm_source=accessibility",
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 2,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "https://museum.gwu.edu",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:36:52Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "2029945200",
      "is_scoreable": false,
      "content_summary": "The George Washington University Museum and The Textile Museum offers an enriching glimpse into cultural heritage and artistry through its diverse collections. Located in the heart of Washington, D.C., this museum uniquely combines academic resources with stunning textile art, making it a must-visit for art enthusiasts and history buffs alike.",
      "content_description": "**The George Washington University Museum and The Textile Museum** presents a unique convergence of art, history, and education. Nestled in the vibrant academic environment of Washington, D.C., this museum is dedicated to showcasing the richness of worldwide textile traditions. With its extensive collection, visitors can explore over 1000 years of textile art, from exquisite *Navajo weavings* to intricate *Japanese kimonos* and *Persian carpets*. The museum's approach intertwines both the artistic and social narratives surrounding textiles, offering a multi-faceted experience that goes beyond visual appeal. Here's a chance to delve into the cultural stories embedded within each piece of fabric and thread.  In the museum's gallery, you can admire textiles displayed in thoughtfully curated exhibitions that highlight their historical significance and artistic techniques.  Through interactive installations and informative signage, you will gain insights into the craftsmanship and cultural practices that shape these treasured items.  Visiting **The Textile Museum** provides not only an aesthetic feast for the eyes but also an opportunity to engage with the profound narratives of global cultures.  The building itself reflects a blend of modern architecture with elements that evoke a sense of history, creating a warm and inviting atmosphere conducive to exploration and learning.  Moreover, the museum regularly hosts workshops and lectures, inviting visitors to learn about textile care, conservation, and the techniques of weaving or dyeing, making it a dynamic space for both observation and hands-on experience.",
      "content_highlights": [
        "Extensive collection of over 5,000 textiles from around the world",
        "Focus on social narratives and cultural practices behind textiles",
        "Regular workshops and lectures promoting hands-on learning",
        "Exhibitions showcasing historical significance and artistic techniques",
        "Unique architectural blend of modern and historical design elements"
      ],
      "content_generated_at": "2026-01-25T01:36:52Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-tudor-place-historic-house-and-garden",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "WASHINGTON",
      "museum_name": "Tudor Place Historic House and Garden",
      "alternate_names": null,
      "website": "http://www.tudorplace.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "1644 31ST ST NW",
      "address_line2": null,
      "postal_code": "20007",
      "latitude": 38.91288,
      "longitude": -77.06334,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "Botanical Garden",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: blocked by robots.txt; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:37:00Z",
      "notes": "CSV: museum type 'ARBORETUM, BOTANICAL GARDEN, OR NATURE CENTER' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 3,
      "is_scoreable": false,
      "content_summary": "Explore the enchanting **Tudor Place Historic House and Garden**, where history, beauty, and nature intertwine. This hidden gem in Washington, D.C. offers visitors a unique glimpse into early American life through its stunning architecture and lush gardens, combined with rich stories and vibrant plant life that will captivate any history or nature enthusiast.",
      "content_description": "**Tudor Place Historic House and Garden** stands as an exquisite example of early American architecture and landscape design, nestled in the heart of Washington, D.C. Built in 1816-1820, this Georgetown estate reflects the grandeur of its time, showcasing a blend of Federal and Georgian styles. As you stroll through the meticulously landscaped garden, you'll admire a variety of *botanical treasures*, many of which date back to the property’s beginnings. The gardens themselves tell a story, providing an oasis where visitors can connect with both history and nature. Each path you wander invites you to discover unique plant species and classic garden structures that echo the elegance of the past. From ornamental trees to vibrant flowers, the site is a testament to the art of *landscape architecture* that has been preserved through the centuries. But the experience doesn't stop at the gardens. The carefully curated interiors of the house reveal the lives of the Custis and Peter families, showcasing an impressive collection of *decorative arts*, including china, silver, and period furniture, providing a true insight into 19th-century domestic life. Here, every object has a story, and knowledgeable guides are eager to share them. Visiting **Tudor Place** is not just a stroll through a garden or a tour of a historic house; it is an immersive journey into the past, where each step resonates with history. Don't miss the opportunity to experience this enchanting site that weaves together the beauty of nature and the richness of American heritage.",
      "content_highlights": [
        "Stunning Georgian-Federal architecture of the historic house",
        "Meticulously maintained botanical gardens with rare plant species",
        "Rich history of the Custis and Peter families",
        "Curated collections of 19th-century decorative arts",
        "Guided tours that offer immersive historical narratives"
      ],
      "content_generated_at": "2026-01-25T01:37:00Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-dc-historical-society-of-washington",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "DC",
      "museum_name": "Historical Society of Washington",
      "alternate_names": null,
      "website": "http://www.historydc.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": "20002",
      "latitude": 38.89259,
      "longitude": -77.0032005,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Historic Preservation",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://www.historydc.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=2 for DC; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: DNS lookup failed for http://www.historydc.org; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:37:06Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'HISTORIC PRESERVATION' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "2023831850",
      "is_scoreable": false,
      "content_summary": "Discover the rich tapestry of Washington, DC's history at the **Historical Society of Washington**. This unique museum not only preserves artifacts and documents but also serves as a hub for engaging with the city’s diverse past. Experience history through a captivating blend of exhibitions, programs, and community events that celebrate the heritage of our nation's capital.",
      "content_description": "**The Historical Society of Washington** is not just a museum; it's a portal into the heart of the nation's capital. Nestled within the vibrant city, it showcases a fascinating collection of over 300,000 artifacts, photographs, and manuscripts that tell the story of Washington, DC, from its founding to the present day. Visitors can explore exhibitions that illuminate the city’s social, political, and cultural history, making it a treasure trove for history enthusiasts and casual visitors alike. Whether you’re walking through immersive displays or perusing exquisite portraits from the *American Realism* period, each corner invites a deeper understanding of the capital's evolution. The museum serves as a dynamic research center, inviting scholars and tourists to delve into the rich narratives that define this unique city. At various events, guests can engage with community programs that foster public dialogue about the city’s ongoing history and heritage.  \n\nBeyond its compelling collections, **The Historical Society of Washington** is housed in a beautifully preserved historic building that reflects the architectural legacy of the area. The structure itself is a prime example of late 19th-century design, offering visitors a glimpse into the craftsmanship of the era. The museum not only connects visitors with the past but also actively participates in the preservation of documents and objects, ensuring that the stories of Washington, DC endure for generations to come. A visit here is not just about observing history; it’s about experiencing the very essence of the city and understanding its future as well as its past.",
      "content_highlights": [
        "Over 300,000 artifacts showcasing DC's rich history",
        "Immersive exhibitions on social, political, and cultural themes",
        "Public programs fostering community dialogue",
        "Research center for historians and enthusiasts",
        "Beautifully preserved historic architectural setting"
      ],
      "content_generated_at": "2026-01-25T01:37:06Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-museum-and-gardens-hillwood-estate",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Museum and Gardens",
      "museum_name": "Hillwood Estate",
      "alternate_names": null,
      "website": "http://www.hillwoodmuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "4155 LINNEAN AVENUE NW",
      "address_line2": null,
      "postal_code": "20008",
      "latitude": 38.9438,
      "longitude": -77.05251,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "Botanical Garden",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.hillwoodmuseum.org/visit",
      "tickets_url": "http://www.hillwoodmuseum.org/visit/hours-tickets",
      "reservation_required": null,
      "accessibility_url": "http://www.hillwoodmuseum.org/visit/accessibility",
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.hillwoodmuseum.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=2 for Museum and Gardens; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:37:16Z",
      "notes": "CSV: museum type 'ARBORETUM, BOTANICAL GARDEN, OR NATURE CENTER' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 2,
      "is_scoreable": false,
      "content_summary": "Nestled in the heart of Washington, D.C., **Hillwood Estate, Museum & Gardens** is a hidden gem that invites visitors into the luxurious world of Marjorie Merriweather Post. This botanical garden and museum celebrate art, nature, and history, featuring breathtaking gardens, exquisite art collections, and opulent interiors that reflect the elegance of the Gilded Age. Don’t miss this unique experience that combines stunning landscapes with cultural riches.",
      "content_description": "**Hillwood Estate, Museum & Gardens** is a captivating fusion of art and nature, established by socialite and philanthropist Marjorie Merriweather Post in the mid-20th century. This stunning estate showcases a curated collection of *European and Russian art*, including fine china, intricate Fabergé eggs, and exquisite 18th-century decorative arts. The museum is housed in Post's former residence, a grand mansion reflecting the sophistication of the Gilded Age, inviting visitors to step into a world of exquisite taste and style. Visitors can explore the lavishly adorned rooms, each telling a story of Post's travels and passion for collecting beautiful objects from around the globe. The estate itself is a testament to her love for both art and nature.  Emphasizing *natural beauty*, the gardens are filled with azaleas, peonies, and a plethora of seasonal blooms, creating a serene haven that enchants guests year-round.  As you wander through the meticulously designed grounds, you'll encounter a range of themes, from the vibrant **Japanese Garden** to the lush **Moon Garden**, each offering a unique palette of colors and textures.  Whether you’re an art enthusiast, a garden lover, or simply looking for a peaceful retreat, **Hillwood** promises an unforgettable experience that enriches the soul. Engage with guided tours that reveal hidden gems within the collection and learn about the fascinating life of Marjorie Merriweather Post, leaving with a deeper appreciation for art, culture, and nature.  Don’t forget to indulge in a stroll through the charming café and gift shop that celebrate local artisanship and unique finds.  This museum is not just a visit; it’s a journey through time and beauty.",
      "content_highlights": [
        "Stunning gardens featuring seasonal blooms and unique landscapes",
        "Extensive collection of Fabergé eggs showcasing Russian craftsmanship",
        "Exquisite European and American art and decorative objects",
        "Rich history of Marjorie Merriweather Post and her contributions",
        "Serene atmosphere perfect for leisurely strolls and photography"
      ],
      "content_generated_at": "2026-01-25T01:37:16Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    }
  ],
  "updated_at": "2026-01-25T01:37:16Z"
}
