{
  "state": "District of Columbia",
  "state_code": "DC",
  "last_updated": "2026-01-16T20:07:00.511679+00:00Z",
  "museums": [
    {
      "museum_id": "usa-dc-unknown-american-university-museum",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "American University Museum",
      "alternate_names": null,
      "website": "http://www.american.edu/cas/museum",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 38.93694,
      "longitude": -77.08947,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.american.edu/cas/museum",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: Access forbidden (403) for http://www.american.edu/cas/museum",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T03:23:33Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "2028851300",
      "is_scoreable": false,
      "content_summary": "Nestled in the heart of Washington, D.C., the **American University Museum** is a hidden gem showcasing contemporary art and dynamic exhibitions. With its commitment to fostering a dialogue on critical social issues through art, this museum is a must-visit for anyone interested in the vibrant art scene and cultural narratives of our time.",
      "content_description": "**American University Museum** is an integral part of the cultural fabric of Washington, D.C., offering a unique blend of contemporary art, educational programs, and a commitment to social issues. Located on the university campus, this museum features over 5,000 square feet of exhibition space that showcases rotating exhibitions, providing visitors with an ever-evolving artistic experience. It focuses on promoting both established and emerging artists, ensuring a rich tapestry of perspectives from across the globe.  With an emphasis on interdisciplinary approaches, the museum serves as a platform for dialogue on pivotal issues such as identity, environment, and community engagement.  As you wander through its thoughtfully curated exhibitions, you will uncover how artists reflect and respond to the world around them, making it not just an art experience, but a reflective journey through time and culture.  The architecture of the museum itself is a modern marvel, merging contemporary design with thoughtful spaces that invite exploration and contemplation.  The dedicated gallery spaces highlight diverse mediums from painting to sculpture, and the museum frequently hosts artist talks, workshops, and community events that enrich the visitor experience.  Whether you're a local art enthusiast or a traveler exploring the nation's capital, it's an ideal destination to connect with innovative art while engaging in meaningful conversations.  Moreover, the proximity to various restaurants and cafés makes it a perfect stop for a full day of cultural exploration.  The **American University Museum** truly encapsulates the essence of contemporary art's power to inspire change and provoke thought, making each visit an enlightening experience.  ",
      "content_highlights": [
        "Rotating exhibitions featuring established and emerging artists",
        "Focused programming on critical social issues through art",
        "Thoughtfully designed gallery spaces for a reflective experience",
        "Diverse artistic mediums including painting, sculpture, and performance",
        "Vibrant community events and artist talks"
      ],
      "content_generated_at": "2026-01-18T03:23:33Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-corcoran-gallery-of-art",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "Corcoran Gallery of Art",
      "alternate_names": null,
      "website": "http://www.corcoran.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "500 SEVENTEENTH ST NW",
      "address_line2": null,
      "postal_code": "20006",
      "latitude": 38.89616,
      "longitude": -77.03946,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 1,
      "collection_tier": 1,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 2,
      "modern_contemporary_strength": 3,
      "primary_art": null,
      "historical_context_score": 3,
      "priority_score": null,
      "scoring_version": "phase2_v1",
      "scored_by": "gpt-5.2",
      "score_notes": "The Corcoran held an important collection largely concentrated in American art; the evidence does not indicate major Impressionist holdings, suggesting at most minor representation. As a long-running major U.S. art museum (founded 1869) with a substantial collection (19,456 works) and an associated art school, it likely had moderate modern/contemporary coverage and decent but not clearly documented historical framing. Its prominence in Washington, D.C. supports national-level reputation, though ",
      "score_last_verified": "2026-01-17",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.corcoran.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: Network error accessing http://www.corcoran.org: HTTP 500 for http://www.corcoran.org; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T00:24:12Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 2,
      "phone": "2026391700",
      "is_scoreable": true,
      "content_summary": "Once Washington, D.C.’s grand, independent art museum, the Corcoran Gallery of Art remains a landmark in the city’s cultural history—especially for lovers of American art. Founded in the 19th century, it championed living artists and ambitious exhibitions, building a collection known for 19th- and 20th-century American painting, sculpture, and photography. Even though the Corcoran no longer operates as a standalone museum, its legacy—and the works it gathered—still rewards visitors through partner institutions across D.C.",
      "content_description": "**The Corcoran Gallery of Art** holds an outsized place in Washington’s museum story: founded in 1869 by banker-philanthropist William Wilson Corcoran, it was among the nation’s earliest museums dedicated to art and to supporting American artists. For generations it served as a platform for contemporary work alongside historical masterworks, shaping taste and patronage in the capital. Although the Corcoran closed as an independent museum in 2014, its collection and institutional DNA continue to circulate through Washington’s museum ecosystem—making it an essential chapter for travelers tracing the city’s art lineage.\n\nArchitecturally, the Corcoran was prized for its **Beaux-Arts presence**—a dignified, museum-as-temple statement that matched its national ambition. Inside, visitors once moved through a classic sequence of galleries suited to slow looking: portraiture and history painting giving way to bolder modern turns. The collection’s strengths were firmly American, spanning *Realism*, *Impressionism*, and early *Modernism*, with particular resonance for those interested in how U.S. artists negotiated European influence and homegrown subjects. Historically associated with artists such as **Thomas Eakins**, **Winslow Homer**, and **John Singer Sargent**, the Corcoran also developed a strong reputation in **photography**, reflecting its willingness to treat the medium as museum-worthy art.\n\nFor art travelers today, the Corcoran experience is best approached as a **trail of masterpieces**: seek its holdings as they appear in partner venues and exhibitions around D.C., and pair that hunt with a walk-by of the building itself to appreciate the institution’s former grandeur. It’s a rewarding way to connect Washington’s contemporary museum scene to the patronage, collecting, and debates that built it.",
      "content_highlights": [
        "Historic champion of American art in Washington, D.C., founded in 1869 by William Wilson Corcoran",
        "Strong American painting and sculpture holdings associated with figures like Thomas Eakins, Winslow Homer, and John Singer Sargent",
        "Notable commitment to photography as a fine-art medium, helping legitimize the field in a major museum context",
        "Beaux-Arts architecture—an emblematic “museum monument” worth seeing even after the museum’s closure",
        "A visitor-friendly way to explore D.C.: track Corcoran works through rotating displays at partner institutions and special exhibitions"
      ],
      "content_generated_at": "2026-01-18T00:24:12Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-dumbarton-house",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "Dumbarton House",
      "alternate_names": null,
      "website": "http://dumbartonhouse.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "1703 32ND STREET NW",
      "address_line2": null,
      "postal_code": "20007",
      "latitude": 38.91465,
      "longitude": -77.06352,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "Botanical Garden",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: blocked by robots.txt",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T03:23:42Z",
      "notes": "CSV: museum type 'ARBORETUM, BOTANICAL GARDEN, OR NATURE CENTER' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 2,
      "is_scoreable": false,
      "content_summary": "Dumbarton House in Washington, D.C., offers visitors a serene escape into history with its beautifully restored Federal-style architecture and tranquil botanical gardens. This charming site provides a unique glimpse into 18th-century American life and a chance to explore meticulously curated gardens, making it a must-visit for history lovers and garden enthusiasts alike.",
      "content_description": "**Dumbarton House** is not just a museum; it's a journey back in time to the Federal period of American history. Built in 1800, this historic house museum stands as a testament to the elegance and architectural prowess of the era. As you approach the grand façade, you’ll be captivated by the *neoclassical details* that adorn the exterior, inviting you to step inside and explore the intricately furnished rooms that have been preserved to reflect their original grandeur. Inside, visitors can marvel at an exquisite collection of antiques, artworks, and decorative items that tell the story of the house’s prominent inhabitants and the social history of early Washington, D.C. The well-documented narratives provided by knowledgeable staff immerse you in the rich tapestry of the past, offering insights into how the early American elite lived and entertained.  In addition to the house itself, the surrounding botanical gardens enhance the visitor experience. The gardens cover over 1.5 acres of beautifully curated landscapes, featuring native plants and historic flowers that were popular in the 18th century. Strolling through the lush greenery, visitors can enjoy seasonal blooms, peaceful pathways, and scenic views that provide ideal spots for reflection or relaxation. **Dumbarton House** not only serves as a cultural and historical landmark but also as a beautiful urban oasis, making it a perfect stop for anyone seeking tranquility amidst the bustle of the city. As you explore, don't miss the opportunity to join one of the guided tours or special events that often highlight the intersection of horticulture and history, allowing you to truly appreciate the beauty and significance of this remarkable location.",
      "content_highlights": [
        "Stunning Federal-style architecture dating back to 1800.",
        "Meticulously curated botanical gardens featuring native and historic plants.",
        "Comprehensive collections of period furniture, antiques, and artwork.",
        "Engaging guided tours that delve into early American social history.",
        "Seasonal events and educational programs promoting historical horticulture."
      ],
      "content_generated_at": "2026-01-18T03:23:42Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-international-arts-and-artists-hillyer-art-space",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "NW Washington",
      "museum_name": "International Arts and Artists’ Hillyer Art Space",
      "alternate_names": null,
      "website": "http://www.artsandartists.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "9 Hillyer Court",
      "address_line2": null,
      "postal_code": "20008",
      "latitude": 38.91184,
      "longitude": -77.04839,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "General Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": "https://www.facebook.com/artsandartists",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 2,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.artsandartists.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T03:23:49Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "2023380680",
      "is_scoreable": false,
      "content_summary": "The **Hillyer Art Space** in NW Washington invites visitors to explore a dynamic intersection of contemporary art and community engagement. This unique museum showcases innovative exhibitions and supports emerging artists, making it a must-visit destination for art enthusiasts and curious travelers alike.",
      "content_description": "**Hillyer Art Space** is more than just a gallery; it is a vibrant hub for contemporary artistic expression. Nestled in the heart of NW Washington, this *general museum* emphasizes not only the presentation of art but also the critical dialogue surrounding it. The space is dedicated to supporting emerging artists from diverse backgrounds, offering them a platform to showcase their works and connect with the community. Visitors will find exhibitions that challenge the norm and invite reflection, sparking conversations that linger long after they leave. This is a place where art becomes a shared experience, blending creativity with accessibility. The engaging programs and unique collaborative projects add another layer to your visit, ensuring you leave with more than just memories of art on the walls. This is art that speaks to the present moment, fostering connections and broadening perspectives. With its welcoming environment, **Hillyer Art Space** encourages guests to not only view art but to also interact with it and each other, making every visit an opportunity for inspiration and discovery.  Visitors of all ages can participate in workshops, artist talks, and various community engagement initiatives, enhancing the experience and deepening their appreciation for contemporary practices. When you step into **Hillyer Art Space**, you're stepping into the future of art, capturing the pulse of creativity flowing through our communities.",
      "content_highlights": [
        "Dynamic exhibitions featuring emerging artists",
        "Interactive workshops and community engagement programs",
        "Focus on contemporary art dialogue and support",
        "Unique collaborative projects with local artists",
        "Inviting atmosphere that encourages conversation and connection"
      ],
      "content_generated_at": "2026-01-18T03:23:49Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-jewish-historical-society-of-greater-washington-lilian-albert-small-jewish-museum",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington",
      "museum_name": "Jewish Historical Society of Greater Washington/Lilian & Albert Small Jewish Museum",
      "alternate_names": null,
      "website": "http://www.jhsgw.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "575 3rd St NW, Washington, DC 20001, USA",
      "address_line2": null,
      "postal_code": "20001",
      "latitude": 38.8972102,
      "longitude": -77.0148742,
      "place_id": "ChIJRSJWXom3t4kRzZklOUS4c8k",
      "address_source": "google_places",
      "address_last_verified": "2026-01-17",
      "museum_type": "General Museum",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.jhsgw.org",
        "museums_csv",
        "google_places_api"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: DNS lookup failed for http://www.jhsgw.org; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T03:23:56Z",
      "notes": "CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "(202) 789-0900",
      "website_google": "http://www.capitaljewishmuseum.org/",
      "business_status": "OPERATIONAL",
      "opening_hours_structured": {
        "open_now": true,
        "periods": [
          {
            "close": {
              "day": 0,
              "time": "1700"
            },
            "open": {
              "day": 0,
              "time": "1000"
            }
          },
          {
            "close": {
              "day": 3,
              "time": "1700"
            },
            "open": {
              "day": 3,
              "time": "1000"
            }
          },
          {
            "close": {
              "day": 4,
              "time": "1700"
            },
            "open": {
              "day": 4,
              "time": "1000"
            }
          },
          {
            "close": {
              "day": 5,
              "time": "1700"
            },
            "open": {
              "day": 5,
              "time": "1000"
            }
          },
          {
            "close": {
              "day": 6,
              "time": "1700"
            },
            "open": {
              "day": 6,
              "time": "1000"
            }
          }
        ],
        "weekday_text": [
          "Monday: Closed",
          "Tuesday: Closed",
          "Wednesday: 10:00 AM – 5:00 PM",
          "Thursday: 10:00 AM – 5:00 PM",
          "Friday: 10:00 AM – 5:00 PM",
          "Saturday: 10:00 AM – 5:00 PM",
          "Sunday: 10:00 AM – 5:00 PM"
        ]
      },
      "open_now": true,
      "google_rating": 4.6,
      "google_reviews_count": 134,
      "google_reviews": [
        {
          "author_name": "aki okuda",
          "author_url": "https://www.google.com/maps/contrib/105844850958720822491/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVycpyTlKoEKeQM3gKKIMlzjCWZY-_CBx-9xsksZvLYGHbQHA=s128-c0x00000000-cc-rp-mo-ba7",
          "rating": 5,
          "relative_time_description": "2 months ago",
          "text": "While Washington D.C. does not host a dedicated National Museum of American Jewish History (that museum is in Philadelphia), the city's United States Holocaust Memorial Museum (USHMM) is crucial for understanding a pivotal chapter in Jewish history. Its mission is to preserve the memory of the Holocaust, ensuring that visitors grasp the terrifying results of antisemitism and the need to defend democratic values. The museum's historical narrative and extensive archives are vital for educating the world about this dark period, serving as a powerful, permanent reminder of the ultimate cost of indifference.",
          "time": 1762822847,
          "translated": false
        },
        {
          "author_name": "Pablo Reinoso Amaro",
          "author_url": "https://www.google.com/maps/contrib/112665966710484454150/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwUIiGCoM0Ra9sCAQ7P2Y0eKnLKXkoqPNgQj8iGsk-myQl4JY=s128-c0x00000000-cc-rp-mo-ba4",
          "rating": 5,
          "relative_time_description": "a month ago",
          "text": "A very moving and well-curated museum. The exhibits are thoughtfully designed and tell powerful stories about Jewish history, culture, and resilience, with a strong connection to Washington, D.C. The space is modern, informative, and easy to navigate, and the staff was welcoming and knowledgeable. I left with a deeper understanding and appreciation of the community’s contributions and experiences. Highly recommended for anyone interested in history, culture, and education.",
          "time": 1765758602,
          "translated": false
        },
        {
          "author_name": "Adam Fagen",
          "author_url": "https://www.google.com/maps/contrib/104198283518659207849/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUe9QthVQ_d9ZfsUj3b1chAl8McHakUVbaVjcxlTaq4CxQ2jd_o=s128-c0x00000000-cc-rp-mo-ba5",
          "rating": 5,
          "relative_time_description": "in the last week",
          "text": "Great museum to learn about the Jewish community in and around DC. Engaging exhibits, historic synagogue, even a gift shop and cafe.",
          "time": 1768345317,
          "translated": false
        },
        {
          "author_name": "Lav Kelley",
          "author_url": "https://www.google.com/maps/contrib/109869437627075167542/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwdshNWnDIR5mJqTzNEPrOUT4sOHg_iHAKJLX6MSqo1_hQT7d26w=s128-c0x00000000-cc-rp-mo-ba5",
          "rating": 5,
          "relative_time_description": "7 months ago",
          "text": "Museums should definitely share history and impart an understanding of their particular specialty. Capital Jewish Museum definitely does that. However, it does far more. I find the exhibits engaging and thoughtful in ways that matter especially in a world that wants to flatten experiences to short sound bites. I also love the wonderful events they host and specialized exhibits. What's most fascinating, is learning about the historic synagogue building that's part of the museum and has been moved multiple times to preserve it. Like all of Washington DC, it represents the way this city is always changing and welcomes people to move and change with it.",
          "time": 1749500370,
          "translated": false
        },
        {
          "author_name": "Maya",
          "author_url": "https://www.google.com/maps/contrib/103108152791336908603/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInlnENn6_Uef2sc7n3YJTwVHnK3aDF8XSEjTm4Za9b8ju1iw=s128-c0x00000000-cc-rp-mo-ba4",
          "rating": 5,
          "relative_time_description": "a year ago",
          "text": "Accessibility Audit:\n\nThe Capital Jewish Museum opened in 2023 and has been very deliberate about accessibility and diversity.\n\nThe first 2 floors are free to visitors.\n\nThere is a ramp to enter with accessible door openers on F street where they have wand security. You can request a complimentary wheelchair (wide-based manual chair with no cushion).\n\nThe 1st floor exhibit weaves together the intersections between Indigenous, black, Jewish, LGBTQIA+ and mainstream local and national American history from 1790-2023. The exhibit was at the perfect height for a wheelchair user. The door to enter the exhibit (as shown in the pictures) seemed quite narrow, but did perfectly fit the wide-based manual wheelchair and someone's stroller. People standing had to look down since most of the timeline was at hip height. There is one bench in the space. I'd recommend 2 hours here if you like to read everything thoroughly.\n\nThere did not seem to be a Braille or audio option in this space, so it would not currently be accessible to people who are blind or low vision. Someone who works here though said they are exploring options to address this though.\n\nThere is a functional elevator to the second floor. All exhibits either had the doors propped open or had touchless accessible door openers. The 2nd and 3rd floors had an AED and water fountains available. The air conditioning made it nice and cool even with all the natural light and it being a 100 degree day outside. There was a lip threshold to enter the bathroom that was tricky to maneuver while also pushing open the door. The 2nd floor spaces were wide enough to maneuver. There were some great interactive sections and ways to advocate for things like DC Statehood by personalizing templated letters that they would mail. I'd recommend about an hour and a half here.\n\nThe third floor had the paid Deli Special Exhibit and a rooftop. The rooftop accessibility button worked, but you'd have to nudge the door after pressing the button to help it get started (both inside and outside).\n\nI would highly recommend this museum. The attention to accessibility made it feel like people with disabilities are welcome. It was such a relief to be able to enjoy like anyone else.\n\nBtw this and other accessible reviews are on the Roll Mobility app! This is not an ad. I just stumbled upon the app and use it.\nhttps://rollappinc.page.link/TXwW",
          "time": 1718927376,
          "translated": false
        }
      ],
      "is_scoreable": false,
      "content_summary": "Discover the rich tapestry of Jewish history in the heart of Washington, D.C. The **Jewish Historical Society of Greater Washington/Lilian & Albert Small Jewish Museum** offers visitors a unique glimpse into the cultural heritage and stories that have shaped the Jewish community in this vibrant city, making it a must-visit destination for history enthusiasts and cultural explorers alike.",
      "content_description": "**The Jewish Historical Society of Greater Washington/Lilian & Albert Small Jewish Museum** stands as a beacon of cultural heritage, dedicated to preserving and sharing the rich history of Jewish life in the Greater Washington area. Nestled in the historic *Lillian and Albert Small* building, this museum invites visitors to explore a thoughtfully curated assortment of artifacts, photographs, and personal stories that embody the spirit of a community that has thrived through resilience and innovation. The museum’s collections range from early immigration documents to contemporary art pieces, showcasing the diverse experiences of Jewish individuals and families over the decades. In this engaging space, history isn't just displayed; it's brought to life through immersive exhibitions and educational programming that inspires connections to the past.  As visitors walk through the thoughtfully designed exhibits, they will gain insight into the vibrant culture, traditions, and contributions of Jewish Americans to the wider tapestry of U.S. history.  The intimate setting allows for a contemplative experience, encouraging reflection on shared values and the importance of cultural continuity.  In addition, the museum frequently hosts special events, lectures, and workshops, offering visitors interactive opportunities to delve deeper into specific topics related to Jewish history and culture.  Whether you are a resident of Washington or a traveler passing through, the **Lilian & Albert Small Jewish Museum** is more than just a museum; it is a welcoming space for learning, community engagement, and appreciation of the diverse narratives that connect us all.  Prepare to be inspired by the stories that resonate within these walls, making your visit a meaningful journey into the past.  ",
      "content_highlights": [
        "Rich collections documenting Jewish life and history in Washington, D.C.",
        "Intimate, engaging exhibits that tell personal stories",
        "Historic building with architectural significance",
        "Dynamic programming including lectures and workshops",
        "Access to unique artifacts and historical documents"
      ],
      "content_generated_at": "2026-01-18T03:23:56Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-kreeger-museum",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "Kreeger Museum",
      "alternate_names": null,
      "website": "http://www.kreegermuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "2401 FOXHALL ROAD NW",
      "address_line2": null,
      "postal_code": "20007",
      "latitude": 38.92284,
      "longitude": -77.08888,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.kreegermuseum.org/visit",
      "tickets_url": "http://www.kreegermuseum.org/visit/reservations",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.kreegermuseum.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T03:24:08Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 2,
      "phone": "2023373050",
      "is_scoreable": false,
      "content_summary": "The Kreeger Museum offers visitors a unique blend of modern and contemporary art housed within a stunning architectural masterpiece. Located in Washington, D.C., this museum is a hidden gem where art lovers can immerse themselves in a serene environment, featuring a world-class collection and beautifully landscaped grounds.",
      "content_description": "**The Kreeger Museum** is a captivating destination that seamlessly marries art, architecture, and nature. Situated in a former residence, the museum showcases the extraordinary collection of David and Carmen Kreeger, featuring over 8,000 pieces of art ranging from *Impressionism* to *Post-Impressionism*, as well as modern works by renowned artists such as *Henry Moore* and *Pablo Picasso*. The museum's emphasis on modern and contemporary art offers visitors an insightful glimpse into the evolution of artistic expression throughout the 20th century and beyond. The approach to curating these masterpieces invites contemplation, making every visit a unique experience.  As you wander through the halls, you'll encounter a thoughtfully selected array of sculptures, paintings, and ceramics that reflect the Kreeger's deep appreciation for both established and emerging artists.  The *architectural design*, created by the famous architect Philip Johnson, plays a vital role in the Kreeger experience; the building itself is a harmonious blend of indoor and outdoor spaces. The thoughtfully landscaped grounds feature *Matisse-inspired* gardens, offering moments of peace and reflection as you stroll between the artworks.  Visitors will delight in the diverse programming of guided tours, art classes, and special exhibitions that change throughout the year, ensuring there's always something new to explore. Whether you are a seasoned art aficionado or a casual admirer, **the Kreeger Museum** promises an enriching experience that will make your visit to Washington, D.C. unforgettable.",
      "content_highlights": [
        "World-class collection of modern and contemporary art",
        "Diverse sculptures and paintings by renowned artists",
        "Architectural masterpiece designed by Philip Johnson",
        "Beautifully landscaped gardens inspired by Matisse",
        "Dynamic programming with rotating exhibitions and art classes"
      ],
      "content_generated_at": "2026-01-18T03:24:08Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-national-building-museum",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "National Building Museum",
      "alternate_names": null,
      "website": "http://www.nbm.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 38.89779,
      "longitude": -77.01752,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://nbm.org/visit/buy-tickets/",
      "tickets_url": "https://nbm.org/visit/buy-tickets/",
      "reservation_required": null,
      "accessibility_url": "https://nbm.org/visit/accessibility/",
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.nbm.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T03:24:16Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "2022722448",
      "is_scoreable": false,
      "content_summary": "The National Building Museum in Washington, D.C. is a captivating tribute to the built environment, offering a unique blend of architecture, design, and history. Its colossal interior, magnificent exhibitions, and interactive programs make it a must-visit destination for anyone intrigued by the marvels of our constructed world.",
      "content_description": "The **National Building Museum**, nestled in the heart of Washington, D.C., showcases the rich history and evolving narrative of architecture, engineering, and design. Housed in a stunning Romanesque revival building completed in 1887, the museum's interior features **grand columns**, ***vaulted ceilings***, and an expansive atrium that provides a breathtaking backdrop for exhibitions and visitor experiences alike.\n\nVisitors to the museum can immerse themselves in a diverse array of exhibits, exploring topics such as urban planning, sustainable design, and the impact of architecture on society. The museum’s collections celebrate the artistry and ingenuity involved in building our environments, including models, photographs, and innovative design artifacts. One of its standout exhibits, *The Big Build*, invites families to explore construction and architecture through interactive stations and creative play.\n\nFor those who appreciate stunning architecture, the museum itself is a masterpiece, with its **magnificent Great Hall** often hosting special events, temporary installations, and engaging programming. Not only does the **National Building Museum** provide a platform for learning and inspiration, but it also encourages visitors to consider how the spaces we inhabit influence our lives. Whether you’re an architecture aficionado or a curious traveler, this museum's mix of history, culture, and interactive learning makes it an unmissable stop in D.C.",
      "content_highlights": [
        "Stunning Romanesque revival architecture",
        "The Great Hall featuring enormous columns and an open design",
        "Interactive exhibits like 'The Big Build' for families",
        "Diverse collections focusing on urban planning and sustainable design",
        "Rotating exhibitions that explore trends in architecture and engineering"
      ],
      "content_generated_at": "2026-01-18T03:24:16Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-national-portrait-gallery",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "City of Westminster",
      "museum_name": "National Portrait Gallery",
      "alternate_names": null,
      "website": "https://npg.si.edu/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "1 Home Smithsonian Institution Museum Location National Portrait Gallery 8th and G St",
      "address_line2": null,
      "postal_code": "20001",
      "latitude": 38.90477,
      "longitude": -77.03023,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://npg.si.edu/visiting-the-museum",
      "tickets_url": "https://www.eventbrite.com/e/a-day-of-community-tickets-1977387635648",
      "reservation_required": null,
      "accessibility_url": "https://npg.si.edu/access",
      "reputation": 0,
      "collection_tier": 1,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 1,
      "modern_contemporary_strength": 3,
      "primary_art": null,
      "historical_context_score": 4,
      "priority_score": null,
      "scoring_version": "phase2_v1",
      "scored_by": "gpt-5.2",
      "score_notes": "The evidence describes the London National Portrait Gallery as a major national institution focused on portraits of historically important British people, not an Impressionism-focused collection, so Impressionist strength is scored negligible. Portrait collections typically span from historical to modern figures, supporting a moderate modern/contemporary score, and the mission implies strong historical framing and interpretive context. As a long-established national gallery in London near Trafal",
      "score_last_verified": "2026-01-17",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "https://npg.si.edu",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'City of Westminster' from open data; MRD: computed city_tier=3 for City of Westminster; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T00:25:46Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "2026338300",
      "is_scoreable": true,
      "content_summary": "In the heart of Westminster, the National Portrait Gallery offers a riveting way to “meet” British history through art. Its internationally respected collection traces power, celebrity, creativity, and identity across centuries—through faces you know and stories you don’t. Expect iconic images of monarchs, writers, rebels, and cultural trailblazers, presented with the intimacy only portraiture can deliver. It’s a must for art lovers who enjoy painting, photography, and design as much as biography and storytelling.",
      "content_description": "**The National Portrait Gallery** is one of London’s most distinctive art experiences: a museum where **people**—not battles, landscapes, or still lifes—anchor the story. Set beside Trafalgar Square in the City of Westminster, it houses an internationally significant collection devoted to portraits of figures who have shaped Britain’s political, literary, scientific, and cultural life. You’ll encounter canonical works such as the **“Chandos” portrait of William Shakespeare**, dazzling Tudor imagery including **Nicholas Hilliard’s** jewel-like miniatures, and commanding state portraits that chart how image-making became a tool of authority and national myth. For many visitors, the thrill is seeing how the language of portraiture evolves from courtly *Renaissance* likeness to expressive *Romantic* character studies and onward into modern experimentation.\n\nArchitecturally, the Gallery blends historic presence with contemporary museum comfort, guiding you through bright, thoughtfully sequenced rooms that reward slow looking. The collection’s breadth shines in its **photography holdings**, where portraits by **Cecil Beaton** and **Yousuf Karsh** sit alongside striking modern and contemporary works that expand what a portrait can be—document, performance, or psychological study. For art enthusiasts, the experience is both scholarly and accessible: clear wall texts, strong thematic hangs, and frequent temporary exhibitions make repeat visits worthwhile.\n\nPlan to give yourself time to compare mediums—oil, pastel, sculpture, and lens-based work—and to linger over the details: costume, gesture, and gaze. The result is an art-lover’s itinerary that feels like a walk through Britain’s cultural memory, one face at a time.",
      "content_highlights": [
        "The “Chandos” portrait of William Shakespeare—one of the most famous images in British culture",
        "Tudor portraiture and Nicholas Hilliard’s exquisitely detailed portrait miniatures",
        "Major holdings of British portrait photography, including works by Cecil Beaton and Yousuf Karsh",
        "A chronological journey through portrait styles from Renaissance court imagery to modern and contemporary approaches",
        "Regular special exhibitions that spotlight artists, sitters, and themes of identity, celebrity, and power"
      ],
      "content_generated_at": "2026-01-18T00:25:46Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-phillips-collection",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Washington, D.C.",
      "museum_name": "Phillips Collection",
      "alternate_names": null,
      "website": "http://www.phillipscollection.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 38.91199,
      "longitude": -77.04671,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Art Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.phillipscollection.org/visit",
      "tickets_url": "http://www.phillipscollection.org/visit",
      "reservation_required": true,
      "accessibility_url": "http://www.phillipscollection.org/about/diversity",
      "reputation": 1,
      "collection_tier": 1,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 5,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 4,
      "modern_contemporary_strength": 4,
      "primary_art": null,
      "historical_context_score": 4,
      "priority_score": null,
      "scoring_version": "phase2_v1",
      "scored_by": "gpt-5.2",
      "score_notes": "The collection explicitly includes key Impressionist/Post-Impressionist figures (Monet, Renoir, van Gogh, Bonnard), indicating a strong but not necessarily flagship Impressionist presence. Its roster of major modern artists (Picasso, Braque, Klee, Mir\u0018, Rothko, O\u0007Keeffe, Lawrence) supports strong modern/contemporary holdings, consistent with a nationally known, high-quality but non-encyclopedic museum.",
      "score_last_verified": "2026-01-17",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.phillipscollection.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 4,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Washington, D.C.' from open data; MRD: computed city_tier=2 for Washington, D.C.; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T00:26:02Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "2023872151",
      "is_scoreable": true,
      "content_summary": "Intimate, elegant, and packed with masterpieces, the Phillips Collection offers one of Washington, D.C.’s most rewarding art experiences. Housed in a refined historic townhouse, it feels less like a grand institution and more like being invited into a connoisseur’s home—where Renoir, Degas, and Rothko hang within a few steps of each other. Best known for presenting modern art in human scale, the museum rewards slow looking, close study, and repeat visits.",
      "content_description": "Tucked into Dupont Circle, **The Phillips Collection** is celebrated as “America’s first museum of modern art,” founded in 1921 by collector Duncan Phillips. Rather than overwhelming you with monumental galleries, it invites you into a sequence of **intimate rooms** that encourage close looking—an atmosphere that can make even famous works feel newly personal. The setting is a distinctive part of the appeal: a historic residence paired with a sensitively integrated **modern addition**, creating a calm, domestic rhythm that suits the museum’s emphasis on viewing art as a lived experience.\n\nThe collection’s strengths are especially vivid in late 19th- and 20th-century painting, where *Impressionism*, *Post‑Impressionism*, and early *Modernism* unfold in tight, revealing conversations. Visitors often come seeking Pierre‑Auguste Renoir’s luminous **“Luncheon of the Boating Party,”** a cornerstone of the museum and one of the most beloved paintings in the city. Nearby, you’ll encounter key figures such as Edgar Degas, Henri Matisse, and Pablo Picasso, alongside powerful modern works by artists including Mark Rothko—proof of the Phillips’s knack for pairing beauty with bold ideas.\n\nFor art lovers, the pleasure is in the pacing: you can comfortably see the museum in a couple of hours, then linger—returning to a single room to compare brushwork, color harmonies, and *composition* across generations. Expect a thoughtfully curated, quietly intense visit that privileges depth over spectacle—ideal for travelers who want a museum experience that feels both world-class and warmly personal.",
      "content_highlights": [
        "Pierre‑Auguste Renoir’s “Luncheon of the Boating Party,” a must-see masterwork and signature piece",
        "Exceptional concentration of *Impressionist* and *Post‑Impressionist* painting in an intimate setting",
        "Strong early *Modernist* holdings, with standout works by artists such as Matisse and Picasso",
        "Mark Rothko and other 20th‑century highlights presented at close range for slow, immersive viewing",
        "A memorable visit experience shaped by the museum’s townhouse architecture and human-scale galleries"
      ],
      "content_generated_at": "2026-01-18T00:26:02Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-smithsonian-american-art-museum-and-renwick-gallery",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "NW Washington",
      "museum_name": "Smithsonian American Art Museum and Renwick Gallery",
      "alternate_names": null,
      "website": "https://americanart.si.edu/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "00 pm Renwick Gallery Pennsylvania Avenue at 17th Street",
      "address_line2": null,
      "postal_code": "20006",
      "latitude": 38.90105,
      "longitude": -77.04009,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://americanart.si.edu/visit",
      "tickets_url": "https://americanart.si.edu/search/books",
      "reservation_required": null,
      "accessibility_url": "https://americanart.si.edu/visit/accessibility",
      "reputation": 0,
      "collection_tier": 1,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 2,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 2,
      "modern_contemporary_strength": 3,
      "primary_art": null,
      "historical_context_score": 4,
      "priority_score": null,
      "scoring_version": "phase2_v1",
      "scored_by": "gpt-5.2",
      "score_notes": "Evidence points to a strong Smithsonian-level American art institution, with the Renwick Gallery specifically focused on American craft and decorative arts spanning the 19th–21st centuries, supporting moderate modern/contemporary strength and good interpretive context. Impressionism is not indicated as a focus and, given the craft/decorative emphasis, is likely minor. As part of the Smithsonian in Washington, D.C., the museum has international reputation and a strong permanent-collection tier.",
      "score_last_verified": "2026-01-17",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "https://americanart.si.edu",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted city 'Washington' from JSON-LD; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T00:26:16Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "2023571445",
      "is_scoreable": true,
      "content_summary": "In the heart of NW Washington, the Smithsonian American Art Museum and its sister venue, the Renwick Gallery, offer a sweeping, deeply enjoyable introduction to American creativity. From iconic paintings and sculpture to cutting-edge contemporary craft, this is where you can trace the nation’s artistic imagination across centuries. Expect strong collections, smart curation, and a visitor-friendly experience—plus the pleasure of seeing major names alongside surprises you didn’t know you’d love.",
      "content_description": "**Smithsonian American Art Museum (SAAM)** is one of the most rewarding places in Washington to understand how American art evolved—from early portraiture and landscape painting to the shocks and innovations of modern and contemporary practice. As you move through the galleries, you’ll encounter landmark works by artists such as **John Singer Sargent**, **Winslow Homer**, **Edward Hopper**, **Georgia O’Keeffe**, and **Alexander Calder**, with strengths in *Realism*, *Impressionism*, *Modernism*, and postwar art. The museum’s breadth is its superpower: expect a narrative that links art to the American experience—urban life, the frontier myth, industry, identity, and reinvention—without feeling like a textbook.\n\nArchitecturally, SAAM’s home in the historic Old Patent Office Building is part of the pleasure. The grand, light-filled **Kogod Courtyard**—a dramatic contemporary canopy set within 19th-century walls—creates a serene pause between galleries and a natural meeting point for art lovers comparing notes. The building’s generous scale makes for a comfortable visit, with clear sightlines and plenty of space to linger.\n\nA short trip away, the **Renwick Gallery** (SAAM’s jewel box near the White House) is Washington’s essential destination for contemporary craft and decorative arts. Expect ambitious installations and dazzling material intelligence—glass, fiber, ceramics, metalwork—presented with the seriousness usually reserved for painting. For travelers, the pairing is ideal: a deep dive into American art history at SAAM, then a vivid, idea-driven encounter with craft as contemporary art at the Renwick.",
      "content_highlights": [
        "Wide-ranging American art collection spanning colonial-era works to contemporary masters, including Edward Hopper and Georgia O’Keeffe",
        "The Kogod Courtyard—an iconic modern canopy within the historic Old Patent Office Building, perfect for a mid-visit reset",
        "Strong holdings in American *Realism*, *Impressionism*, and *Modernism*, with gallery narratives that connect art to national history",
        "Renwick Gallery’s premier focus on contemporary craft and decorative arts, featuring immersive, material-driven installations",
        "Two complementary experiences in NW Washington: a major encyclopedic American art museum plus a craft-forward satellite near the White House"
      ],
      "content_generated_at": "2026-01-18T00:26:16Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-the-george-washington-university-museum-and-the-textile-museum",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "NW Washington",
      "museum_name": "The George Washington University Museum and The Textile Museum",
      "alternate_names": null,
      "website": "https://museum.gwu.edu/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "10 a.m.-5 p.m. Closed on university holidays . 701 21st Street",
      "address_line2": null,
      "postal_code": "20052",
      "latitude": 39.05186,
      "longitude": -77.43757,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://museum.gwu.edu/visit",
      "tickets_url": "https://museum.gwu.edu/request-event-reservation",
      "reservation_required": null,
      "accessibility_url": "https://accessibility.gwu.edu/?utm_medium=link&utm_campaign=global-footer&utm_source=accessibility",
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 2,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "https://museum.gwu.edu",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T03:24:24Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "2029945200",
      "is_scoreable": false,
      "content_summary": "Nestled in the heart of Washington, D.C., **The George Washington University Museum and The Textile Museum** is a unique cultural destination that merges art, history, and education. Visitors will explore an extensive collection of textiles and artifacts, showcasing centuries of craftsmanship and global influences, making it a must-visit for art and history enthusiasts alike.",
      "content_description": "**The George Washington University Museum and The Textile Museum** offers a distinctive journey into the artistry and significance of textiles from around the world. The museum stands out not only for its impressive collections but also for its commitment to education and research. Housed within a beautifully renovated historic structure, the museum’s design reflects a dialogue between contemporary aesthetics and classical architectural elements, creating a captivating environment for visitors.  \n\nVisitors to the museum will find themselves immersed in the stories behind textiles that span various cultures and time periods. From delicate *silks* of Asia to bold *woven tapestries* from South America, each piece tells a unique story of technique, tradition, and cultural identity. The museum’s permanent collection includes the *world's largest collection of Navajo textiles*, highlighting the profound connection between art and social history. Meanwhile, various rotating exhibitions ensure that there is always something new and exciting to see, showcasing the work of contemporary textile artists alongside historical masterpieces.  \n\nEngaging educational programs make it easy for visitors to deepen their understanding of textile arts through workshops, lectures, and hands-on experiences. Whether you are an art aficionado or a curious traveler, **The George Washington University Museum and The Textile Museum** promises an enriching encounter that blends visual splendor with insightful narratives, inviting all to appreciate the universal language of textiles.",
      "content_highlights": [
        "World's largest collection of Navajo textiles",
        "Diverse global textile collections",
        "Educational programs and workshops",
        "Rotating exhibitions featuring contemporary artists",
        "Architecturally stunning renovated historic building"
      ],
      "content_generated_at": "2026-01-18T03:24:24Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-unknown-tudor-place-historic-house-and-garden",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "WASHINGTON",
      "museum_name": "Tudor Place Historic House and Garden",
      "alternate_names": null,
      "website": "http://www.tudorplace.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "1644 31ST ST NW",
      "address_line2": null,
      "postal_code": "20007",
      "latitude": 38.91288,
      "longitude": -77.06334,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "Botanical Garden",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: blocked by robots.txt; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T03:24:32Z",
      "notes": "CSV: museum type 'ARBORETUM, BOTANICAL GARDEN, OR NATURE CENTER' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 3,
      "is_scoreable": false,
      "content_summary": "Discover the enchanting **Tudor Place Historic House and Garden** in Washington, a hidden gem that blends history and nature. With its stunning botanical gardens and rich historical significance, this site offers a unique glimpse into early American life and the art of landscape design.",
      "content_description": "**Tudor Place Historic House and Garden** is not just a botanical garden, but a vibrant tapestry of history and horticulture that dates back to 1816. Nestled in Georgetown, this remarkable estate was home to the descendants of Martha Washington and is steeped in stories of the early American elite. Beyond its historical significance, the beautifully curated gardens provide a tranquil escape filled with diverse plant species that change with the seasons, allowing each visit to reveal new colors and fragrances. The **Federal-style mansion**, with its elegant architecture and period furnishings, invites visitors to step back in time and experience the lifestyle of those who inhabited it. The **house tour** offers fascinating insights into the lives of its residents, showcasing original artifacts and heirlooms that tell tales of a bygone era. Of special note is the **restored garden**, which pays homage to the 18th-century garden design that once flourished in the area, showcasing intricate paths, flowering plants, and centuries-old trees. As you stroll the grounds, don't miss the opportunity to join one of their seasonal programs, where you can learn about gardening techniques and the history of the area, making your visit both educational and inspiring. **Tudor Place** seamlessly combines a passion for history with a love for horticulture, ensuring that every visitor leaves with a deeper appreciation for both art forms.",
      "content_highlights": [
        "Beautifully curated botanical gardens featuring seasonal blooms",
        "Federal-style mansion showcasing original artifacts from the Washington family",
        "In-depth guided tours revealing the history of early American life",
        "Restored gardens reflecting 18th-century horticultural practices",
        "Engaging seasonal programs focused on gardening and historical education"
      ],
      "content_generated_at": "2026-01-18T03:24:32Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-dc-historical-society-of-washington",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "DC",
      "museum_name": "Historical Society of Washington",
      "alternate_names": null,
      "website": "http://www.historydc.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": "20002",
      "latitude": 38.89259,
      "longitude": -77.0032005,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Historic Preservation",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://www.historydc.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=2 for DC; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: DNS lookup failed for http://www.historydc.org; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T03:24:41Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'HISTORIC PRESERVATION' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "2023831850",
      "is_scoreable": false,
      "content_summary": "The Historical Society of Washington, DC offers a remarkable glimpse into the rich tapestry of the nation's capital. Through its dedication to preserving local history and culture, visitors can immerse themselves in the stories that shaped Washington, making it a must-visit destination for history enthusiasts and curious travelers alike.",
      "content_description": "**The Historical Society of Washington** is a treasure trove for those eager to uncover the layers of history that define the nation’s capital. Situated in the heart of DC, this museum is committed to the preservation of historical artifacts and stories that capture the essence of Washington, from its founding to the modern era. Upon entering, visitors are enveloped in a narrative of resilience and transformation, making each exhibit a compelling chapter in the city's story. The museum's commitment to *historic preservation* not only serves to inform but also inspires curiosity about the evolving nature of America's capital city.  \n\nThe museum's collections include an incredible array of photographs, manuscripts, and artifacts that illuminate the experiences of Washington's diverse communities. From the architectural charm of the building itself, which embodies *Federal-style* design elements, to interactive exhibits that invite visitor participation, **The Historical Society of Washington** offers a dynamic experience. Engaging programs and rotating exhibitions bring fresh perspectives and foster a deeper understanding of both past and present. Families, students, and history buffs will find something unique at every turn, whether it’s standing before a rare artifact or participating in thought-provoking discussions led by knowledgeable staff members. Each visit is an opportunity to connect with the historical pulse of the city and realize how its legacy continues to shape our lives today.",
      "content_highlights": [
        "Extensive archival collections documenting Washington's history",
        "Interactive exhibits that engage visitors of all ages",
        "Educational programs and workshops for deeper learning",
        "Rare artifacts showcasing the city’s cultural evolution",
        "Architectural charm of the museum building itself"
      ],
      "content_generated_at": "2026-01-18T03:24:41Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-dc-museum-and-gardens-hillwood-estate",
      "country": "USA",
      "state_province": "District of Columbia",
      "city": "Museum and Gardens",
      "museum_name": "Hillwood Estate",
      "alternate_names": null,
      "website": "http://www.hillwoodmuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "4155 LINNEAN AVENUE NW",
      "address_line2": null,
      "postal_code": "20008",
      "latitude": 38.9438,
      "longitude": -77.05251,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "Botanical Garden",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.hillwoodmuseum.org/visit",
      "tickets_url": "http://www.hillwoodmuseum.org/visit/hours-tickets",
      "reservation_required": null,
      "accessibility_url": "http://www.hillwoodmuseum.org/visit/accessibility",
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.hillwoodmuseum.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=2 for Museum and Gardens; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T03:24:52Z",
      "notes": "CSV: museum type 'ARBORETUM, BOTANICAL GARDEN, OR NATURE CENTER' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 2,
      "is_scoreable": false,
      "content_summary": "Discover the beauty and serenity of Hillwood Estate, a breathtaking botanical garden that invites visitors to explore its enchanting landscapes, unique horticultural displays, and rich cultural history. This hidden gem offers a perfect blend of art, nature, and architecture, making it an essential stop for any nature lover or art enthusiast visiting Washington, D.C.",
      "content_description": "**Hillwood Estate, Museum & Gardens** is not just a botanical garden; it is a transformative experience that intertwines nature, art, and history. Nestled in the lush landscapes of Washington, D.C., this estate was once home to Marjorie Merriweather Post, a socialite and art collector whose passion for beauty is echoed in every corner of Hillwood. Stroll through 25 acres of beautifully curated gardens, where seasonal blooms create a vibrant tapestry that changes with the seasons. Each garden area reflects a commitment to horticultural excellence and is designed to tell a story, inviting visitors to explore and connect with nature on a profound level. Whether you're wandering through the serene Japanese Garden or the stunning French Parterre, you’ll find a space that captivates the senses and calms the mind.  The estate also features stunning architecture, including the opulent mansion that houses a vast collection of Russian imperial art and exquisite French decorative arts, giving insight into Marjorie's illustrious life.  *Marjorie’s love of the arts* is reflected in the garden's sculptures and the carefully curated collections inside, where visitors can appreciate the intersection of nature and artistry.  Hillwood provides not just a visual feast, but a chance to immerse oneself in a world where history and beauty thrive together. Visitors will engage with numerous programs and events, from garden workshops to art exhibitions, creating an ever-evolving experience that resonates with both aesthetics and education.  Whether you're an avid gardener or simply seeking tranquility, **Hillwood Estate** is a sanctuary worth exploring.  ",
      "content_highlights": [
        "Stunning 25 acres of landscaped gardens",
        "Impressive collection of Russian imperial art",
        "The serene Japanese Garden designed for reflection",
        "Educational programs and workshops available for all ages",
        "Historical mansion showcasing French decorative arts"
      ],
      "content_generated_at": "2026-01-18T03:24:52Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    }
  ],
  "updated_at": "2026-01-18T03:24:52Z"
}
