{
  "state": "Idaho",
  "state_code": "ID",
  "last_updated": "2026-01-16T20:07:00.564255+00:00Z",
  "museums": [
    {
      "museum_id": "usa-id-unknown-boise-art-museum",
      "country": "USA",
      "state_province": "Idaho",
      "city": "Boise",
      "museum_name": "Boise Art Museum",
      "alternate_names": null,
      "website": "http://www.boiseartmuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 43.61027,
      "longitude": -116.20591,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://boiseartmuseum.org/?page_id=720",
      "tickets_url": "https://boiseartmuseum.org/hours-admission/",
      "reservation_required": null,
      "accessibility_url": "https://boiseartmuseum.org/hours-admission/#accessibility",
      "reputation": 2,
      "collection_tier": 2,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 1,
      "modern_contemporary_strength": 2,
      "primary_art": null,
      "historical_context_score": 2,
      "priority_score": null,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The Boise Art Museum has limited Impressionist holdings and a modest collection of Modern/Contemporary works, which contributes to its score of 1 in Impressionist strength and 2 in Modern/Contemporary strength. Its historical context is local in relevance, reflecting its community focus.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.boiseartmuseum.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Boise' from open data; MRD: computed city_tier=2 for Boise; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:58:24Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "2083458330",
      "is_scoreable": true,
      "content_summary": "Set beside Boise’s leafy Julia Davis Park, the Boise Art Museum is a rewarding stop for art lovers who enjoy intimate galleries, thoughtfully rotated exhibitions, and a close look at contemporary creativity in the Intermountain West. Its strengths lie in changing shows—often spotlighting living artists and regional voices—plus approachable scale, calm viewing conditions, and a pleasant park-centered setting that makes it easy to pair art with a stroll through downtown Boise’s cultural corridor.",
      "content_description": "In the heart of Julia Davis Park, **Boise Art Museum** offers a focused, visitor-friendly encounter with art in a city better known for outdoor landscapes than gallery-hopping—making the museum’s curated quiet and steady stream of exhibitions feel like a welcome discovery. While the institution’s permanent holdings are **modest**, the museum’s real draw is its **rotating program**, which typically foregrounds contemporary practice, traveling shows, and regional perspectives that connect Boise to broader conversations in American art.\n\nArchitecturally, the experience is defined less by monumental spectacle and more by an **accessible, human-scaled** museum presence within the park. Expect clear sightlines, comfortable pacing, and galleries that encourage close looking—ideal for appreciating the material intelligence of contemporary painting, photography, and mixed-media work. The setting itself matters: stepping out of the galleries into the green of the park creates a natural rhythm between concentrated viewing and reflective breaks.\n\nFor travelers, **Boise Art Museum** works best as a *curatorially led* visit: check what’s on view, then give yourself time to slow down and follow the exhibition narrative rather than hunt only for famous names. It’s a museum that rewards repeat visits—returning locals and weekend visitors alike will find the galleries transformed by new shows, often with a distinctly Northwest/Intermountain sensibility and an emphasis on artists working now.",
      "content_highlights": [
        "Park-side location in Julia Davis Park—easy to combine with Boise’s central cultural attractions",
        "Rotating exhibitions that keep the experience fresh and often emphasize contemporary art",
        "Intimate, approachable gallery scale that encourages close looking without crowds",
        "A strong sense of regional perspective—an entry point into art of the Intermountain West",
        "Best enjoyed as an exhibition-driven visit: check current shows and plan around what’s on view"
      ],
      "content_generated_at": "2026-01-25T01:58:24Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "eca_score": 1,
      "collection_based_strength": 2,
      "primary_art_focus": "Modern/Contemporary"
    },
    {
      "museum_id": "usa-id-idaho-falls-art-museum-of-eastern-idaho",
      "country": "USA",
      "state_province": "Idaho",
      "city": "Idaho Falls",
      "museum_name": "Art Museum of Eastern Idaho",
      "alternate_names": null,
      "website": "http://www.theartmuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "7777 300 S. Capital Ave.",
      "address_line2": null,
      "postal_code": "83402",
      "latitude": 43.48919,
      "longitude": -112.04481,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.theartmuseum.org/visit",
      "tickets_url": "https://www.facebook.com/TheArtMuseumofEasternIdaho/",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 2,
      "collection_tier": 3,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": 2,
      "priority_score": null,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The Art Museum of Eastern Idaho has a modest collection that may provide educational value but lacks depth and significance for broader scholarship. Its historical context score reflects its relevance to the immediate community, while its reputation indicates regional recognition.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.theartmuseum.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=2 for Idaho Falls; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T01:58:36Z",
      "notes": "CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "is_scoreable": true,
      "content_summary": "In Idaho Falls, the Art Museum of Eastern Idaho offers an intimate, locally rooted encounter with art in the heart of the region. Expect a rotating schedule of exhibitions that spotlight Eastern Idaho artists alongside visiting shows, making each trip feel timely and fresh. With a modest, approachable scale, it’s ideal for travelers who love to linger—close to the work, close to the community—while sampling a cross-section of contemporary and regional creativity without the crowds of a major metropolitan museum.",
      "content_description": "**The Art Museum of Eastern Idaho** in Idaho Falls is best approached as a **regional exhibition space with a community pulse**—a place where the pleasure comes from discovery rather than blockbuster permanence. With a **modest collection** and **minimal curatorial authority** in the wider museum ecosystem, its strength is the ability to pivot quickly: you’ll typically find **changing exhibitions** that foreground Eastern Idaho voices, regional makers, and contemporary work presented in an accessible way. For art lovers, that means the galleries can feel like a snapshot of what’s being made and debated *right now* in the area, rather than a survey of canonical art history.\n\nBecause the museum’s identity is driven by programming, the visitor experience is often shaped by **temporary shows**, local collaborations, and educational initiatives—great if you enjoy seeing emerging artists and returning to catch what’s new. Rather than expecting a “greatest hits” roster of famous names, plan your visit around the current exhibition calendar and treat it like a **studio visit made public**: works on paper, painting, photography, craft-based practices, and mixed media are the kinds of formats you’re likely to encounter in a regional museum setting.\n\nArchitecturally, this is less about grand monumentality and more about **human-scale gallery viewing**—the kind of environment where you can take your time, read labels, and look closely at surfaces and technique. For travelers building an art-focused day in Idaho Falls, it’s a rewarding stop for an **unhurried, close-range museum experience**—especially appealing if you value local cultural context and the surprise of rotating exhibitions.",
      "content_highlights": [
        "Rotating exhibitions that spotlight Eastern Idaho and regional artists",
        "An intimate, human-scale gallery experience—easy to see thoroughly in one visit",
        "Contemporary and community-oriented programming rather than blockbuster crowds",
        "A strong “discover new work” vibe—ideal for repeat visits to see changing shows",
        "Convenient Idaho Falls location for pairing art viewing with a broader day in town"
      ],
      "content_generated_at": "2026-01-25T01:58:36Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "eca_score": 1,
      "collection_based_strength": 2
    }
  ],
  "updated_at": "2026-01-25T01:58:36Z"
}
