{
  "state": "Idaho",
  "state_code": "ID",
  "last_updated": "2026-01-16T20:07:00.564255+00:00Z",
  "museums": [
    {
      "museum_id": "usa-id-unknown-boise-art-museum",
      "country": "USA",
      "state_province": "Idaho",
      "city": "Boise",
      "museum_name": "Boise Art Museum",
      "alternate_names": null,
      "website": "http://www.boiseartmuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 43.61027,
      "longitude": -116.20591,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://boiseartmuseum.org/?page_id=720",
      "tickets_url": "https://boiseartmuseum.org/hours-admission/",
      "reservation_required": null,
      "accessibility_url": "https://boiseartmuseum.org/hours-admission/#accessibility",
      "reputation": 2,
      "collection_tier": 2,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": "phase2_v1",
      "scored_by": "gpt-5.2",
      "score_notes": "The provided Wikipedia summary is not about the Boise Art Museum or its collections, so strengths in Impressionism, Modern/Contemporary art, and interpretive historical context cannot be reliably scored from the evidence. Based on being a city art museum in Boise (a smaller regional capital) with limited external signals, it is assessed as a regional institution with a moderate collection tier.",
      "score_last_verified": "2026-01-18",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.boiseartmuseum.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 2,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Boise' from open data; MRD: computed city_tier=2 for Boise; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T02:56:26Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "2083458330",
      "is_scoreable": true,
      "content_summary": "Set beside Boise’s beloved Julia Davis Park, the Boise Art Museum is the city’s essential stop for art lovers—intimate enough to feel personal, yet ambitious in scope. Expect thoughtfully curated exhibitions that mix regional voices with nationally engaged contemporary art, plus standout strengths in works on paper and ceramics. The experience is as much about discovery as it is about atmosphere: airy galleries, a calm park setting, and programming that invites close looking. It’s an ideal museum to pair with a downtown walk and a slow afternoon of art.",
      "content_description": "In the cultural heart of downtown, **Boise Art Museum** offers a rewarding, well-paced visit that feels tailored to curious viewers. As a regional museum with a contemporary edge, it frequently rotates exhibitions—so you’re likely to encounter new voices, timely themes, and unexpected crossovers between media. The museum is especially engaging for travelers who enjoy the thrill of temporary shows: the galleries often foreground **living artists**, experimentation, and the kinds of installations, photographs, and paintings that spark conversation rather than simply provide a survey.\n\nThe museum’s core strengths lean toward **works on paper** and **ceramics**, fields that reward close looking—line, texture, process, and the artist’s hand are front and center. These mediums also lend themselves to intimate gallery moments: you’ll find yourself stepping in to study a print’s layered inks or the subtle surface of a fired form. The curatorial approach tends to emphasize *contemporary practice* and the cultural contexts around making, which makes the museum feel current and intellectually accessible.\n\nArchitecturally, the experience is defined by clean, gallery-forward spaces designed to keep attention on the art, paired with a location that’s hard to beat. Step outside and you’re immediately in **Julia Davis Park**, perfect for decompression between rooms or after a final lap through the exhibitions. For art-focused travelers, the Boise Art Museum works beautifully as a half-day anchor: a concentrated dose of modern and contemporary creativity, followed by an easy stroll to nearby cultural sites and cafes downtown.",
      "content_highlights": [
        "Rotating contemporary exhibitions that keep repeat visits fresh and discovery-driven",
        "Notable emphasis on works on paper—prints, drawings, and photography suited to close viewing",
        "Ceramics focus, showcasing form, surface, and process at an intimate, human scale",
        "Prime setting in Julia Davis Park—an art visit paired with one of Boise’s best outdoor spaces",
        "Compact, easy-to-navigate galleries ideal for a focused 60–120 minute museum experience"
      ],
      "content_generated_at": "2026-01-18T01:04:34Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-id-idaho-falls-art-museum-of-eastern-idaho",
      "country": "USA",
      "state_province": "Idaho",
      "city": "Idaho Falls",
      "museum_name": "Art Museum of Eastern Idaho",
      "alternate_names": null,
      "website": "http://www.theartmuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "7777 300 S. Capital Ave.",
      "address_line2": null,
      "postal_code": "83402",
      "latitude": 43.48919,
      "longitude": -112.04481,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.theartmuseum.org/visit",
      "tickets_url": "https://www.facebook.com/TheArtMuseumofEasternIdaho/",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 3,
      "collection_tier": 3,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": "phase2_v1",
      "scored_by": "gpt-5.2",
      "score_notes": "The evidence provides no description of the museum’s permanent collection or interpretive approach, so collection-area strengths and historical context cannot be reliably scored. Based on the institution’s local/regional setting in Idaho Falls and lack of evidence for major holdings, it is most plausibly a local museum with a small collection tier.",
      "score_last_verified": "2026-01-18",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.theartmuseum.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 2,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=2 for Idaho Falls; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T02:56:26Z",
      "notes": "CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "is_scoreable": true,
      "content_summary": "Idaho Falls’ Art Museum of Eastern Idaho is a rewarding stop for art lovers who enjoy discovering regional voices and community-driven exhibitions. With a small, approachable scale, it’s easy to take your time—lingering with contemporary works, local and Idaho-connected artists, and changing shows that keep the galleries fresh. Expect an intimate museum experience where you can look closely, chat with staff or docents, and pair your visit with a stroll through downtown’s riverside atmosphere.",
      "content_description": "**Art Museum of Eastern Idaho** offers a satisfying, close-looking kind of museum visit—ideal for travelers who prefer *contemporary* and regionally rooted art presented in a manageable, thoughtfully curated setting. While not encyclopedic in scope, the museum’s strength is its **changing exhibitions** and its role as a cultural anchor for Idaho Falls, spotlighting artists connected to Eastern Idaho and the wider Intermountain West. For art enthusiasts, the appeal lies in seeing how local subject matter—land, weather, community histories—can be reimagined through modern materials and personal visual languages, from painting and photography to mixed media.\n\nArchitecturally, the experience tends toward **intimate gallery rooms and flexible exhibition spaces** rather than monumental halls—an advantage when you want to focus on individual works without the sensory overload of a mega-museum. The scale encourages slow viewing: you can circle back to a piece that rewards repeat attention, compare approaches across media, and notice curatorial details such as thematic groupings and wall texts that foreground process and intention.\n\nFor visitors, this is a museum best enjoyed like a conversation: arrive with curiosity, take in the current show(s), and allow time for any **talks, workshops, or community programming** that often accompany exhibitions in local art institutions. It’s an excellent complement to a day in Idaho Falls—an art-focused pause that connects you directly to the region’s creative present.",
      "content_highlights": [
        "Rotating exhibitions that keep the galleries fresh—often featuring Idaho- and West-connected contemporary artists",
        "An intimate, small-museum layout designed for close looking and unhurried viewing",
        "A strong sense of place: recurring regional themes such as landscape, ecology, and community narratives",
        "Programming that can deepen the visit—artist talks, workshops, and community events (when scheduled)",
        "Easy to pair with an Idaho Falls day out: a culture stop that fits neatly into a downtown/riverside itinerary"
      ],
      "content_generated_at": "2026-01-18T01:04:46Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    }
  ],
  "updated_at": "2026-01-18T02:56:26Z"
}
