{
  "state": "North Dakota",
  "state_code": "ND",
  "last_updated": "2026-01-16T20:07:00.679160+00:00Z",
  "museums": [
    {
      "museum_id": "usa-nd-fargo-plains-art-museum",
      "country": "USA",
      "state_province": "North Dakota",
      "city": "Fargo",
      "museum_name": "Plains Art Museum",
      "alternate_names": null,
      "website": "http://www.plainsart.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "PO BOX 2338",
      "address_line2": null,
      "postal_code": "58102",
      "latitude": 46.8769526,
      "longitude": -96.7918307,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.plainsart.org/visit/",
      "tickets_url": "https://plainsart.org/visit/hours-and-admission/",
      "reservation_required": null,
      "accessibility_url": "https://plainsart.org/wellness-and-access-programs/",
      "reputation": 2,
      "collection_tier": 2,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 1,
      "modern_contemporary_strength": 2,
      "primary_art": "Modern/Contemporary",
      "historical_context_score": 2,
      "priority_score": 23,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The Plains Art Museum has a modest permanent collection with some educational value but lacks depth and critical acclaim. Its regional significance is noted, but the museum's overall impact and holdings do not strongly influence art historical scholarship.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://www.plainsart.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=2 for Fargo; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T02:43:40Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 2,
      "phone": "7012323821",
      "is_scoreable": true,
      "content_summary": "In downtown Fargo, Plains Art Museum offers an intimate, thoughtfully curated encounter with art rooted in the Northern Plains. Housed in a beautifully adapted historic warehouse building, it’s a rewarding stop for travelers who enjoy contemporary exhibitions, regional voices, and Indigenous perspectives presented at a human scale. Expect a calm, gallery-focused visit—less “blockbuster” and more discovery—where you can slow down with painting, photography, and installation art, then step back out into Fargo’s walkable arts district.",
      "content_description": "**Plains Art Museum** is Fargo’s essential art stop for visitors who prefer *close-looking* over crowds. As a regional museum with a modest permanent collection, its strength is the way it **pairs local and Northern Plains narratives with contemporary practice**—often through rotating exhibitions that spotlight emerging and mid-career artists. You’re likely to encounter a mix of painting, photography, and mixed-media work that feels responsive to place: big skies, prairie histories, and the cultural complexity of the region. For art lovers, the pleasure here is the museum’s scale: you can give each gallery time, read labels without jostling, and leave feeling you’ve actually absorbed what you saw.\n\nThe building itself is part of the experience. Set within a repurposed historic warehouse in downtown Fargo, the museum’s **industrial bones, tall volumes, and clean gallery lines** create a crisp backdrop for contemporary displays—an appealing contrast between *heritage architecture* and current visual culture. Rather than overwhelming you with endless rooms, the layout encourages an unhurried circuit: drift from one exhibition to the next, return to a piece that caught you, and appreciate how lighting and wall space give works room to breathe.\n\nPlan your visit around what’s on view—because **exhibitions are the main draw**. Combine the museum with Fargo’s nearby cafés and storefront galleries for a full afternoon of looking. If you enjoy regional institutions that champion artists close to home while inviting broader conversations, Plains Art Museum is a satisfying, thoughtfully paced visit.",
      "content_highlights": [
        "Downtown Fargo location in a repurposed historic warehouse—atmospheric industrial architecture adapted for galleries",
        "Rotating contemporary exhibitions (painting, photography, mixed media) with a strong Northern Plains sense of place",
        "Regional focus that often amplifies local and Indigenous perspectives through changing shows and programming",
        "Intimate, uncrowded galleries ideal for slow looking and reading interpretive texts without rush",
        "Easy to pair with Fargo’s walkable arts district—cafés, nearby cultural stops, and neighborhood exploration"
      ],
      "content_generated_at": "2026-01-25T02:43:40Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "overall_quality_score": 7,
      "eca_score": 1,
      "collection_based_strength": 2,
      "primary_art_focus": "Modern/Contemporary"
    }
  ],
  "updated_at": "2026-01-25T02:43:40Z"
}
