{
  "state": "Nebraska",
  "state_code": "NE",
  "last_updated": "2026-01-16T20:07:00.687245+00:00Z",
  "museums": [
    {
      "museum_id": "usa-ne-unknown-kregel-windmill-factory-museum",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Nebraska City",
      "museum_name": "Kregel Windmill Factory Museum",
      "alternate_names": null,
      "website": "http://kregelwindmillfactorymuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 40.67063,
      "longitude": -95.86658,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://kregelwindmillfactorymuseum.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Nebraska City' from open data; MRD: computed city_tier=3 for Nebraska City; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T04:05:05Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "4028731078",
      "is_scoreable": false,
      "content_summary": "Discover the Kregel Windmill Factory Museum, a captivating tribute to American craftsmanship and agrarian heritage. This museum uniquely showcases windmill manufacturing, offering a deep dive into the history and evolution of these iconic structures that once powered the heartland. Experience hands-on exhibits that bring history to life and immerse yourself in an aspect of rural ingenuity that shaped modern farming.",
      "content_description": "**Kregel Windmill Factory Museum** stands as a testament to the ingenuity of American agricultural engineering. Nestled in the heart of Nebraska City, this unique museum focuses on the art and science of windmill manufacturing. Originating in the early 20th century, the Kregel factory was one of the major producers of windmills in the U.S., and today it invites visitors to explore the legacy of this essential rural technology. The museum not only preserves the history of windmill production but also celebrates the local culture and craftsmanship that defines the region. You'll find fascinating exhibits that include artifacts, photographs, and machinery that illustrate the evolution and significance of windmills in agricultural practices across America. Throughout your visit, you'll gain insight into how these striking structures harnessed the power of the wind to pump water, serve farms, and dramatically enhance agricultural efficiency. The ambiance of the factory site itself offers a nostalgic glimpse into a bygone era of rural life, making it a truly immersive experience. \n\nVisitors can engage with a variety of interactive displays, including models of different windmill designs and informative panels that detail the mechanics behind each type. Additionally, guided tours provide an in-depth look at the historical context of windmill usage, along with anecdotes that breathe life into the exhibits. The museum's thoughtfully curated layout, influenced by its industrial roots, draws you deeper into the story of windmills, ensuring a memorable experience that connects visitors to the agrarian heart of America. Whether you're an art aficionado, history buff, or simply curious, **Kregel Windmill Factory Museum** promises a unique encounter with an essential piece of agricultural history.",
      "content_highlights": [
        "Interactive exhibits on windmill manufacturing",
        "Historical artifacts from the Kregel factory",
        "Guided tours with rich storytelling",
        "Insight into rural agricultural practices",
        "The architectural charm of a historic manufacturing site"
      ],
      "content_generated_at": "2026-01-18T04:05:05Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-ne-unknown-norfolk-arts-center",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Norfolk",
      "museum_name": "Norfolk Arts Center",
      "alternate_names": null,
      "website": "http://www.norfolkartscenter.org/",
      "status": null,
      "last_updated": "2026-01-15",
      "street_address": "305 N 5th Street",
      "address_line2": null,
      "postal_code": "68701",
      "latitude": null,
      "longitude": null,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": null,
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://norfolkartscenter.org/visit/",
      "tickets_url": "https://www.facebook.com/NorfolkArtsCenter/",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.norfolkartscenter.org"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted city 'Norfolk' from JSON-LD; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T04:05:17Z",
      "notes": null,
      "city_tier": 3,
      "is_scoreable": false,
      "content_summary": "The Norfolk Arts Center is a unique destination that celebrates the landscape and life of agrarian culture through the lens of art. As the nation's sole agrarian art museum, it offers a fascinating exploration of farming and rural themes, showcasing exhibitions that connect the past and present of agricultural life. Don't miss the opportunity to engage with artisans and attend workshops that deepen your understanding of this vital aspect of our heritage.",
      "content_description": "**Norfolk Arts Center** stands out as a beacon of agrarian art, dedicated to preserving and displaying artworks that reflect the rich narratives of rural life. Nestled in Norfolk, Nebraska, this one-of-a-kind museum is not just a gallery; it's a cultural hub where the heritage of agriculture meets contemporary creative expression. The museum’s commitment to showcasing the evolution of agrarian themes is evident in its diverse exhibitions, which highlight everything from classic depictions of pastoral landscapes to modern interpretations of farm life challenges. Visitors will experience art that is not only visually stunning but deeply rooted in the stories of the land and those who cultivate it. Additionally, the museum often hosts educational events, artist talks, and panel discussions, providing a platform for engaging dialogue about the significance of agriculture in today’s society. Here, art meets the heart of rural America, and one can feel the pulse of its history echoing through the halls. *Engage* with the past while contemplating the future of our agricultural landscapes through creative eyes. Visitors can also participate in workshops that encourage personal expression and connection to traditional agrarian art forms, adding a hands-on dimension to their experience. From exploring unique collections to interacting with artists, guests are invited to cultivate a deeper appreciation for the nuances of agrarian life beyond the gallery walls. Step into **Norfolk Arts Center**, where art and agriculture intertwine, inviting all to explore the beauty of rural existence in its many forms.",
      "content_highlights": [
        "Exclusive focus on agrarian art and themes",
        "Diverse range of exhibitions showcasing both historical and contemporary perspectives on farm life",
        "Educational events, including artist talks and panel discussions",
        "Hands-on art workshops connecting visitors with traditional agrarian techniques",
        "Community engagement through humanities presentations and collaborative projects"
      ],
      "content_generated_at": "2026-01-18T04:05:17Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-ne-david-city-bone-creek-museum-of-agrarian-art",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "David City",
      "museum_name": "Bone Creek Museum of Agrarian Art",
      "alternate_names": null,
      "website": "http://bonecreek.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "312 N 5th Street",
      "address_line2": null,
      "postal_code": "68632",
      "latitude": 41.25383,
      "longitude": -97.12841,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://bonecreek.org/visit/",
      "tickets_url": "http://www.facebook.com/bonecreekmuseum",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 3,
      "collection_tier": 3,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 1,
      "modern_contemporary_strength": 2,
      "primary_art": null,
      "historical_context_score": 2,
      "priority_score": null,
      "scoring_version": "phase2_v1",
      "scored_by": "gpt-5.2",
      "score_notes": "The museum’s title indicates a specialized focus on agrarian art rather than Impressionism, so Impressionist holdings are likely negligible. As a small, local museum in David City with no evidence of major collections, it is scored as small-tier with local reputation; modern/contemporary presence and historical interpretation are assumed limited but possible within a thematic agrarian framework.",
      "score_last_verified": "2026-01-17",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://bonecreek.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 2,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for David City; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T02:01:03Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "4023674488",
      "is_scoreable": true,
      "content_summary": "In the heart of Nebraska farm country, the Bone Creek Museum of Agrarian Art offers a rare, focused lens on rural life through art—so rare, in fact, it bills itself as the nation’s only museum dedicated exclusively to agrarian art. With a small, thoughtfully curated program of rotating exhibitions, it pairs the visual poetry of fields, barns, labor, and community with artist talks and hands-on workshops. It’s an intimate stop that rewards visitors who want art rooted in place, history, and lived experience.",
      "content_description": "**Bone Creek Museum of Agrarian Art** in David City is a niche destination with outsized cultural appeal: it is devoted entirely to the visual world of agriculture and rural life. Rather than presenting “country themes” as nostalgia, Bone Creek treats agrarian subject matter as a serious artistic and humanistic field—one that can encompass *regionalism*, landscape traditions, documentary approaches, and contemporary interpretations of work, land stewardship, and community. Because the museum’s exhibitions rotate, each visit feels like an edited chapter: you’ll encounter images and objects that speak to the heritage of farm life while also addressing current rural realities.\n\nWith a **small, local** scale, the museum leans into the strengths of an intimate art experience. Visitors can look closely—at brushwork, print textures, and compositional choices—without the crowds that often flatten the museum-going experience. Bone Creek also distinguishes itself through programming: **artist talks, panel discussions, workshops, and humanities presentations** extend the exhibitions into conversation, making it a particularly satisfying stop for travelers who like to connect what they see on the wall with the ideas behind it.\n\nArchitecturally, expect a **practical, community-oriented museum environment** suited to changing shows and educational events. The payoff is the visitor experience: a focused, calm venue where art lovers can spend meaningful time with rural imagery—then step outside into Nebraska’s agrarian landscape and feel the subject matter continue in real life.",
      "content_highlights": [
        "Nation’s only museum dedicated exclusively to agrarian art, centering rural and farm life as serious artistic subject matter",
        "Rotating exhibitions that balance rural heritage with contemporary themes in agriculture and community life",
        "Frequent artist talks and panel discussions that deepen the context behind the artwork",
        "Art workshops that let visitors engage with techniques connected to depicting land, labor, and landscape",
        "An intimate, small-museum visit that encourages close looking and unhurried reflection"
      ],
      "content_generated_at": "2026-01-18T02:01:03Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-ne-kearney-museum-of-nebraska-art",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Kearney",
      "museum_name": "Museum of Nebraska Art",
      "alternate_names": null,
      "website": "http://monet.unk.edu/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": "68847",
      "latitude": 40.6996235,
      "longitude": -99.0810916,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 3,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": "phase2_v1",
      "scored_by": "gpt-5.2",
      "score_notes": "The provided evidence does not describe the Museum of Nebraska Art’s permanent collection or interpretive approach, so collection-area strengths and historical-context scoring cannot be determined. Based on its location in Kearney, Nebraska (a smaller city) and lack of broader indicators in the evidence, the museum’s reputation is best characterized as primarily local.",
      "score_last_verified": "2026-01-18",
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://monet.unk.edu",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 2,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=3 for Kearney; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: Access forbidden (403) for http://monet.unk.edu; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T02:56:26Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "3088658559",
      "is_scoreable": true,
      "content_summary": "In Kearney, the Museum of Nebraska Art offers a deeply place-based way to understand the state through art—especially its rural imagination. With exhibitions devoted to agrarian themes, the museum spotlights how artists have pictured farm life, labor, landscape, and community across generations. Expect thoughtfully curated shows, lively public programs, and a welcoming, local-scale museum experience that rewards slow looking. It’s an essential stop for art lovers curious about the Midwest’s visual culture beyond the usual coastal canon.",
      "content_description": "Set in Kearney, the **Museum of Nebraska Art** invites art-focused travelers to encounter Nebraska’s cultural identity through exhibitions that center rural heritage and contemporary life. The museum’s programming—often presented under the agrarian-art focus associated with Bone Creek—takes farm and small-town experience seriously as artistic subject matter, tracing how artists translate land, weather, work, and memory into image. Rather than treating the countryside as mere backdrop, the museum frames agrarian themes as an evolving story, where tradition, change, and environmental awareness meet.\n\nYou’ll typically find rotating exhibitions that explore both historic and current perspectives on rural and farm life, with interpretive texts that connect artworks to lived experience. For visitors, this means a gallery visit that feels both **aesthetically rich** and **humanities-minded**: you’re looking at art, but also thinking about place, labor, and community. Programs such as **artist talks, panel discussions, workshops, and presentations** extend the experience beyond the walls, making it easy to pair viewing with conversation—ideal if you enjoy hearing artists and scholars unpack process and context.\n\nArchitecturally, expect an approachable, regional museum atmosphere designed for close viewing rather than spectacle. The scale encourages repeat visits and careful attention to detail—brushwork, printmaking textures, and narrative cues in genre scenes. Plan to linger: this is a museum where the pleasure comes from noticing how artists shape familiar rural motifs into compelling *visual storytelling*.",
      "content_highlights": [
        "Nation’s only museum focused exclusively on agrarian art, dedicated to rural and farm-life themes",
        "Rotating exhibitions linking heritage and contemporary perspectives on Midwestern rural culture",
        "Robust public programming: artist talks, panel discussions, workshops, and humanities presentations",
        "Interpretive approach that connects artworks to labor, landscape, community, and environmental change",
        "Intimate, local-scale visitor experience ideal for slow looking and repeat visits"
      ],
      "content_generated_at": "2026-01-18T02:01:17Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-ne-lincoln-international-quilt-study-center-museum",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Lincoln",
      "museum_name": "International Quilt Study Center & Museum",
      "alternate_names": null,
      "website": "http://www.quiltstudy.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 40.82845,
      "longitude": -96.67294,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=2 for Lincoln; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: blocked by robots.txt",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T04:05:26Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "4024726549",
      "is_scoreable": false,
      "content_summary": "The International Quilt Study Center & Museum in Lincoln, Nebraska, is a unique gem dedicated to the art and history of quilts, showcasing the largest collection of quilts in the world. It's a must-visit for art enthusiasts and anyone interested in cultural heritage, offering a vibrant blend of tradition and creativity that transcends generations.",
      "content_description": "The **International Quilt Study Center & Museum** (IQSCM) stands as a beacon of creativity and cultural history in Lincoln, Nebraska. This distinguished museum is home to the largest collection of quilts worldwide, boasting over 5,000 quilts that span centuries and continents. Each piece tells a story, showcasing the evolution of quilting as an artistic expression and its significant role in women's history and cultural identity. Visitors can immerse themselves in a rich tapestry of *design*, *color*, and *technique*, discovering how these textiles reflect the societal values and artistic movements of their time.\n\nThe architecture of the IQSCM is equally impressive, with a modern design that harmoniously integrates with the lush surroundings. Inside, the spacious galleries are thoughtfully curated to present rotating exhibitions alongside the permanent collection, ensuring that every visit promises something new. Educational programs, workshops, and artist talks are regularly held, providing visitors with an opportunity to engage deeply with the art of quilting. The museum’s inviting atmosphere encourages attendees to connect with both the art and its makers, making each experience rich and personal.\n\nA visit to the **International Quilt Study Center & Museum** is not just about viewing quilts; it’s about appreciating the stories they tell and the communities they represent. Whether you're a seasoned quilter or a curious beginner, the museum's events and exhibitions will inspire creativity and foster a deeper understanding of this intricate textile art form.",
      "content_highlights": [
        "The world's largest collection of quilts, with over 5,000 unique pieces",
        "Rotating exhibitions showcasing both historical and contemporary quilting",
        "Educational workshops and artist talks promoting quilting as an art form",
        "A beautiful, modern architectural space designed for artistic engagement",
        "Interactive displays that allow visitors to discover quilting techniques and traditions"
      ],
      "content_generated_at": "2026-01-18T04:05:26Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-ne-lincoln-sheldon-museum-of-art",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Lincoln",
      "museum_name": "Sheldon Museum of Art",
      "alternate_names": null,
      "website": "http://www.sheldonartmuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": "68588",
      "latitude": 40.8175375,
      "longitude": -96.7044642,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.sheldonartmuseum.org/visit/",
      "tickets_url": "http://www.sheldonartmuseum.org/admission-hours-accessibility/",
      "reservation_required": null,
      "accessibility_url": "http://www.sheldonartmuseum.org/admission-hours-accessibility/",
      "reputation": 2,
      "collection_tier": 2,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 2,
      "modern_contemporary_strength": 4,
      "primary_art": null,
      "historical_context_score": 3,
      "priority_score": null,
      "scoring_version": "phase2_v1",
      "scored_by": "gpt-5.2",
      "score_notes": "The Sheldon focuses on 19th- and 20th-century art with a sizable holding (12,000+ works) spanning multiple American art movements, supporting a strong modern/contemporary score but only minor implied Impressionist representation (no stated emphasis or canonical French Impressionist holdings). As a university museum with broad American movement coverage, it likely provides decent but variable historical framing; its reputation and scale read as a solid regional, moderate-tier collection rather th",
      "score_last_verified": "2026-01-17",
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://www.sheldonartmuseum.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=2 for Lincoln; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T02:01:43Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "4024722461",
      "is_scoreable": true,
      "content_summary": "In Lincoln, the Sheldon Museum of Art is a rewarding stop for travelers who want serious art in a relaxed university-town setting. Known for its strong holdings of American modern and contemporary work, the museum pairs smart, approachable exhibitions with a visitor-friendly scale—easy to see in a single visit, yet rich enough to linger. Expect highlights spanning painting, sculpture, prints, and photography, along with thoughtfully curated shows that connect regional perspectives to national art histories.",
      "content_description": "**Sheldon Museum of Art** in Lincoln is a standout for art lovers seeking a focused, high-quality encounter with American art in the heart of Nebraska. As a regional anchor with a **moderate but thoughtfully shaped collection**, Sheldon is prized for the way it presents 20th- and 21st-century art as a living conversation—pairing recognizable names with discoveries and creating exhibitions that feel both scholarly and inviting. For visitors, this means galleries that encourage close looking: crisp installations of painting, sculpture, works on paper, and photography, often organized to illuminate themes in American modernism and contemporary practice.\n\nArchitecturally, the museum experience emphasizes clarity and calm: **clean lines, generous wall space, and well-considered sightlines** that let individual works read with impact. The setting—embedded in a university environment—adds a lively, curious energy, with the sense that ideas are being tested in real time through rotating exhibitions and educational programming.\n\nPlan to give yourself time to move slowly, especially through temporary shows and any outdoor or campus-adjacent viewing opportunities. Sheldon rewards repeat visits: returning travelers can catch new curatorial angles, evolving contemporary presentations, and seasonal programming. If you’re building a Midwest art itinerary, it’s an essential Lincoln stop—compact, intellectually satisfying, and designed for the pleasure of sustained looking.",
      "content_highlights": [
        "Strong emphasis on American modern and contemporary art across multiple media",
        "Rotating exhibitions that connect regional context to broader national art histories",
        "Visitor-friendly scale: manageable in one visit, with enough depth to merit lingering",
        "Clean, gallery-forward architecture with generous sightlines that favor close looking",
        "University setting that supports lively interpretive programs and an idea-driven atmosphere"
      ],
      "content_generated_at": "2026-01-18T02:01:43Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-ne-omaha-joslyn-art-museum",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Omaha",
      "museum_name": "Joslyn Art Museum",
      "alternate_names": null,
      "website": "http://www.joslyn.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "2200 Dodge Street",
      "address_line2": null,
      "postal_code": "68102",
      "latitude": 41.2604154,
      "longitude": -95.946024,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.joslyn.org/visit/visit-detail/",
      "tickets_url": "https://www.facebook.com/joslynartmuseum/",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 2,
      "collection_tier": 2,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 2,
      "modern_contemporary_strength": 3,
      "primary_art": null,
      "historical_context_score": 4,
      "priority_score": null,
      "scoring_version": "phase2_v1",
      "scored_by": "gpt-5.2",
      "score_notes": "Wikipedia describes a comprehensive permanent collection of 12,000+ objects with 19th–20th century American and European art and contemporary art, suggesting moderate modern/contemporary strength but no explicit Impressionist emphasis (minor by inference). The museum’s breadth across American/European, Asian, and Western American art and its named Western studies center imply solid interpretive framing and a respectable, regionally significant but not national-tier profile.",
      "score_last_verified": "2026-01-17",
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://www.joslyn.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=1 for Omaha; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-18T02:01:56Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 1,
      "phone": "4023423300",
      "is_scoreable": true,
      "content_summary": "Omaha’s Joslyn Art Museum is the city’s flagship fine-arts destination—beloved for its ambitious exhibitions, strong American and European holdings, and a setting that makes art-viewing feel ceremonial. Expect an experience that balances big-name painting and sculpture with thoughtful regional context, all presented in handsome galleries that invite slow looking. For art travelers, Joslyn is a rewarding anchor stop: substantial enough to plan around, yet approachable for a relaxed afternoon of museum-going in the heart of Nebraska.",
      "content_description": "**Joslyn Art Museum** is Omaha’s essential stop for art lovers, pairing a **regionally significant collection** with a museum experience that feels both grand and welcoming. Its strengths typically read best through the lens of **American art**—from portraiture and landscape traditions to modern and contemporary works that map changing ideas of place, identity, and ambition across the United States. Alongside this, you’ll usually find **European painting and sculpture** that provide a satisfying counterpoint, helping visitors compare academic traditions with later innovations in color, brushwork, and form.\n\nArchitecturally, Joslyn’s appeal is immediate: the museum’s **monumental historic building** gives your visit a sense of occasion, while interior galleries are designed for clear sightlines and close study—ideal for savoring composition, surface, and technique. The experience is especially rewarding for travelers who like to move between “big picture” viewing and intimate details: you can stand back for sweeping narrative impact, then step in close to parse *paint handling*, *glazing*, or the physicality of sculpted materials.\n\nPlan to give yourself time for both permanent galleries and rotating exhibitions, which often broaden the story beyond a single period. For an art-focused itinerary in Omaha, **Joslyn Art Museum** works beautifully as a cornerstone visit—substantial, thoughtfully curated, and memorable not just for what it shows, but for how it frames the act of looking.",
      "content_highlights": [
        "A regionally important fine-arts collection with notable depth in American art",
        "European works that contextualize American traditions through comparative viewing",
        "A monumental historic building that lends grandeur and ceremony to the visit",
        "Rotating exhibitions that refresh the experience for repeat visitors",
        "Quiet, well-proportioned galleries ideal for slow looking and close study"
      ],
      "content_generated_at": "2026-01-18T02:01:56Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    }
  ],
  "updated_at": "2026-01-18T04:05:26Z"
}
