{
  "state": "Nebraska",
  "state_code": "NE",
  "last_updated": "2026-01-16T20:07:00.687245+00:00Z",
  "museums": [
    {
      "museum_id": "usa-ne-unknown-kregel-windmill-factory-museum",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Nebraska City",
      "museum_name": "Kregel Windmill Factory Museum",
      "alternate_names": null,
      "website": "http://kregelwindmillfactorymuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 40.67063,
      "longitude": -95.86658,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://kregelwindmillfactorymuseum.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Nebraska City' from open data; MRD: computed city_tier=3 for Nebraska City; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T02:43:49Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "4028731078",
      "is_scoreable": false,
      "content_summary": "The Kregel Windmill Factory Museum in Nebraska City offers a unique glimpse into the fascinating history of American windmill manufacturing. With an impressive collection of restored machinery and engaging exhibits, this museum is a must-visit for anyone interested in industrial history or the agricultural roots of America.",
      "content_description": "**The Kregel Windmill Factory Museum** stands as a testament to Nebraska's rich agricultural history and the innovation that shaped rural life. Located in Nebraska City, this museum is housed in a historic building that was once an actual windmill factory, providing visitors with an authentic experience of early 20th-century manufacturing. The architecture itself tells a story; the vintage brick structure exudes charm while showcasing the craftsmanship of the era. As you step inside, you'll be transported back to a time when windmills were essential to farming and rural communities, symbolizing progress and sustainability. This unique museum not only preserves the legacy of windmill production but also offers fascinating insights into the integral role these machines played in harnessing wind power for irrigation and water supply. Visitors can explore an extensive collection of windmills, many of which are fully restored and operational, offering a rare opportunity to see these machines in action. Through interactive displays and informative panels, the museum highlights the techniques behind windmill design and operation, making it an engaging experience for both adults and children alike. Furthermore, the museum often hosts special events, workshops, and educational programs aimed at fostering a deeper understanding of agrarian technology and its impact on American agriculture. Whether you're a history buff, a fan of unique machinery, or simply curious about rural heritage, **the Kregel Windmill Factory Museum** promises an enriching experience filled with learning and nostalgia.",
      "content_highlights": [
        "Restored windmills on display, showcasing operational mechanisms",
        "Historic factory building providing authentic industrial atmosphere",
        "Interactive exhibits detailing windmill manufacturing processes",
        "Educational programs and workshops for all ages",
        "Unique insight into Nebraska's agricultural heritage and innovation"
      ],
      "content_generated_at": "2026-01-25T02:43:49Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-ne-unknown-norfolk-arts-center",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Norfolk",
      "museum_name": "Norfolk Arts Center",
      "alternate_names": null,
      "website": "http://www.norfolkartscenter.org/",
      "status": null,
      "last_updated": "2026-01-15",
      "street_address": "305 N 5th Street",
      "address_line2": null,
      "postal_code": "68701",
      "latitude": null,
      "longitude": null,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": null,
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://norfolkartscenter.org/visit/",
      "tickets_url": "https://www.facebook.com/NorfolkArtsCenter/",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.norfolkartscenter.org"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted city 'Norfolk' from JSON-LD; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T02:43:57Z",
      "notes": null,
      "city_tier": 3,
      "is_scoreable": false,
      "content_summary": "The Norfolk Arts Center is a must-visit destination for art lovers and those interested in the unique intersection of rural life and artistic expression. As the nation’s only exclusively agrarian art museum, it showcases exceptional exhibitions that celebrate the beauty and complexities of farming and rural culture.",
      "content_description": "**Norfolk Arts Center** stands out as a treasure trove dedicated entirely to agrarian art, making it a distinctive landmark in the art world. Here, visitors are invited to explore an array of *artistic expressions* that reflect both historical and contemporary themes related to rural life and farming. The museum's exhibitions are thoughtfully curated, often highlighting the intricate relationship between art and the agrarian lifestyle. Each piece serves not only as a work of art but as a narrative that tells the stories of the land and the people who work it. Artists from various backgrounds contribute their unique perspectives, ensuring that every visit brings a fresh experience to viewers.  <br><br>  In addition to its engaging exhibitions, **Norfolk Arts Center** hosts a variety of educational events, including artist talks, panel discussions, and workshops. These programs foster a deeper understanding of the *cultural significance* of agrarian art and encourage interaction between visitors and artists. The museum’s architecture complements its mission, providing a welcoming space that invites reflection and dialogue. Whether you're an art aficionado or simply curious about the stories behind rural landscapes, a visit to this unique museum promises an enriching experience.  <br><br>  Furthermore, the center's commitment to preserving and promoting the heritage of rural culture adds an invaluable dimension to its offerings. It’s not just about viewing art; it’s about understanding the *context* that shapes it, making your visit to the **Norfolk Arts Center** an inspiring journey into the heart of agrarian life.",
      "content_highlights": [
        "The nation's only exclusively agrarian art museum",
        "Rotating exhibitions that highlight both heritage and current themes in rural life",
        "Educational programs including artist talks, workshops, and panel discussions",
        "A rich collection that illustrates the beauty and challenges of farming",
        "A welcoming architectural space that encourages visitor interaction"
      ],
      "content_generated_at": "2026-01-25T02:43:57Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-ne-david-city-bone-creek-museum-of-agrarian-art",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "David City",
      "museum_name": "Bone Creek Museum of Agrarian Art",
      "alternate_names": null,
      "website": "http://bonecreek.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "312 N 5th Street",
      "address_line2": null,
      "postal_code": "68632",
      "latitude": 41.25383,
      "longitude": -97.12841,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://bonecreek.org/visit/",
      "tickets_url": "http://www.facebook.com/bonecreekmuseum",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 3,
      "collection_tier": 3,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 1,
      "modern_contemporary_strength": 2,
      "primary_art": "Modern/Contemporary",
      "historical_context_score": 2,
      "priority_score": 26,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The museum has a moderate collection strength, primarily focusing on agrarian art, which provides local cultural context. Given the small population of the area and the lack of nearby museums, its historical context is relevant mainly to the local community.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://bonecreek.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 4,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for David City; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T02:44:10Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "4023674488",
      "is_scoreable": true,
      "content_summary": "In the small town of David City, Nebraska, the Bone Creek Museum of Agrarian Art offers a rare, focused way to see American rural life through artists’ eyes. As the nation’s only museum devoted exclusively to agrarian art, it turns fields, barns, labor, and community into compelling visual culture—past and present. Come for thoughtfully curated exhibitions and stay for artist talks, workshops, and humanities programs that deepen what you’re seeing. For art lovers, it’s an intimate, regional museum with a distinct mission and real local character.",
      "content_description": "**Bone Creek Museum of Agrarian Art** in David City is a destination for travelers who want museum-going to feel rooted in place. Uniquely dedicated to agrarian art, Bone Creek frames the farm and rural community not as nostalgia, but as a living subject—one that artists continually reinterpret through scenes of labor, land stewardship, seasonal cycles, and small-town heritage. The museum’s exhibition program highlights both historical touchstones and contemporary themes, giving visitors a chance to see how rural life has been pictured, debated, and reimagined across generations.\n\nRather than promising a one-size-fits-all survey, Bone Creek’s strength is its **regional focus** and **exhibition-driven experience**: rotating shows that explore rural narratives through painting, photography, and other media commonly associated with *American realism* and documentary traditions (while leaving room for more interpretive approaches). Programming is a major part of the visit—**artist talks, panel discussions, workshops, and humanities presentations** add context and invite you to look closely at craft, technique, and meaning, whether the subject is a weathered outbuilding, a harvested field, or the social fabric of farming communities.\n\nFor art enthusiasts, the pleasure here is the museum’s scale and specificity: an unhurried gallery visit where you can spend time with works that resonate with Nebraska’s landscape and agrarian heritage, then extend the experience through educational events. If you’re planning a trip across the Plains or seeking museums with a clear curatorial point of view, Bone Creek offers a concentrated, memorable encounter with art shaped by the rural Midwest.",
      "content_highlights": [
        "Nation’s only museum devoted exclusively to agrarian art and rural themes",
        "Rotating exhibitions connecting farm heritage with contemporary rural life",
        "Strong regional emphasis—an intimate lens on Nebraska and the broader rural Midwest",
        "Robust public programs: artist talks, panel discussions, workshops, and humanities presentations",
        "A visitor-friendly small-museum experience ideal for slow looking and thematic exploration"
      ],
      "content_generated_at": "2026-01-25T02:44:10Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "overall_quality_score": 6,
      "collection_based_strength": 3
    },
    {
      "museum_id": "usa-ne-kearney-museum-of-nebraska-art",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Kearney",
      "museum_name": "Museum of Nebraska Art",
      "alternate_names": null,
      "website": "http://monet.unk.edu/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": "68847",
      "latitude": 40.6996235,
      "longitude": -99.0810916,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 3,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": 2,
      "priority_score": null,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The Museum of Nebraska Art provides local context by interpreting and preserving Nebraska's art scene but lacks significant depth or national importance in its collections. Its reputation serves primarily the local community and region.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://monet.unk.edu",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=3 for Kearney; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: Access forbidden (403) for http://monet.unk.edu; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T02:44:21Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "3088658559",
      "is_scoreable": true,
      "content_summary": "In Kearney, the Museum of Nebraska Art offers art lovers a rewarding stop that connects regional identity with wider American currents. With an intimate scale and a strong sense of place, it’s a museum where you can slow down, look closely, and come away with a sharper feel for Nebraska’s creative legacy. Expect approachable galleries, rotating exhibitions, and the pleasure of discovering artists and themes rooted in prairie landscapes, rural life, and the cultural history of the Great Plains.",
      "content_description": "**The Museum of Nebraska Art (MONA)** in Kearney is a compelling destination for travelers who love museums that feel both personal and place-specific. Set in the heart of central Nebraska, MONA invites you into a focused encounter with art shaped by the state’s landscapes and communities—prairie horizons, small-town narratives, and the visual poetry of everyday life. Its size works to your advantage: you can spend real time with individual works, return to favorites, and absorb the through-lines that link regional artmaking to broader American traditions.\n\nThe museum’s **collection and exhibitions** emphasize Nebraska connections and regularly rotate, making repeat visits worthwhile. For art enthusiasts, the strongest draw is the chance to see how artists interpret the Great Plains—through *landscape*, *portraiture*, and contemporary approaches that rethink rural experience beyond nostalgia. The curatorial lens often highlights local heritage alongside current themes, so the visit can feel like a conversation between past and present rather than a static survey.\n\nArchitecturally and experientially, MONA reads as a welcoming, human-scaled art space—ideal for unrushed looking. Expect an easy-to-navigate layout, interpretive labels that support close reading, and a programmatic emphasis on community engagement, from exhibition-related events to educational offerings. If your museum itinerary usually centers on major metropolitan collections, MONA is a refreshing counterpoint: a concentrated, thoughtfully presented view of art where **Nebraska is not a footnote, but the main subject**.",
      "content_highlights": [
        "Nebraska-focused collection and rotating exhibitions that connect art to Great Plains history and culture",
        "Intimate, visitor-friendly galleries designed for slow looking and close study",
        "Exhibition themes exploring rural life, landscape, and community identity through multiple media",
        "A strong sense of place—ideal for travelers seeking regional art beyond big-city museums",
        "Programs and events that deepen context, from talks to hands-on educational offerings"
      ],
      "content_generated_at": "2026-01-25T02:44:21Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "collection_based_strength": 2
    },
    {
      "museum_id": "usa-ne-lincoln-international-quilt-study-center-museum",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Lincoln",
      "museum_name": "International Quilt Study Center & Museum",
      "alternate_names": null,
      "website": "http://www.quiltstudy.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 40.82845,
      "longitude": -96.67294,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=2 for Lincoln; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: blocked by robots.txt",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T02:44:27Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "4024726549",
      "is_scoreable": false,
      "content_summary": "The International Quilt Study Center & Museum in Lincoln, Nebraska, is a treasure trove for textile enthusiasts and art lovers alike. It houses the world's largest collection of quilts, showcasing the rich history and diversity of quilting as a form of artistic expression. A visit here immerses guests in the intricate stories woven into every quilt, making it a unique cultural experience not to be missed.",
      "content_description": "**The International Quilt Study Center & Museum** offers a unique glimpse into the intricate world of quilts, celebrating their significance as both functional pieces and works of art. Established in 1997, this museum is home to over 5,000 quilts representing a plethora of styles, techniques, and cultural traditions. Visitors will discover quilts that span centuries and continents, revealing stories of family history, cultural celebration, and artistic innovation through fabric and thread. Each exhibit invites guests to appreciate the artistry behind every stitch and the rich narratives woven into these textiles.  \n\nThe architecture of the museum itself complements its purpose; designed with a modern aesthetic that highlights its collections, the space encourages exploration and interaction. **The Special Exhibitions Gallery** regularly hosts curated shows that dive deep into specific themes, artists, or periods, allowing for an ever-evolving experience with each visit. Hands-on programs and workshops invite guests to engage with the craft, creating an enriching atmosphere that bridges the gap between historical appreciation and contemporary practice. Whether you're a seasoned quilter or a curious traveler, the International Quilt Study Center & Museum offers an engaging and educational experience that celebrates the beauty and significance of quilting in our cultural tapestry.",
      "content_highlights": [
        "World's largest collection of quilts showcasing diverse styles and histories",
        "Interactive exhibits that allow visitors to learn about quilting techniques",
        "Regularly changing special exhibitions focusing on specific themes and periods",
        "Workshops and programs for hands-on engagement in quilting arts",
        "Well-curated library and resources for quilting enthusiasts and researchers"
      ],
      "content_generated_at": "2026-01-25T02:44:27Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-ne-lincoln-sheldon-museum-of-art",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Lincoln",
      "museum_name": "Sheldon Museum of Art",
      "alternate_names": null,
      "website": "http://www.sheldonartmuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": "68588",
      "latitude": 40.8175375,
      "longitude": -96.7044642,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.sheldonartmuseum.org/visit/",
      "tickets_url": "http://www.sheldonartmuseum.org/admission-hours-accessibility/",
      "reservation_required": null,
      "accessibility_url": "http://www.sheldonartmuseum.org/admission-hours-accessibility/",
      "reputation": 2,
      "collection_tier": 2,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 2,
      "modern_contemporary_strength": 3,
      "primary_art": "Modern/Contemporary",
      "historical_context_score": 2,
      "priority_score": 16,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The Sheldon Museum of Art has a modest collection with some depth in American art movements but lacks significant Impressionist holdings. Its reputation is regional, known primarily within the multi-state area, and it provides local historical context.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://www.sheldonartmuseum.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=2 for Lincoln; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T02:44:38Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "4024722461",
      "is_scoreable": true,
      "content_summary": "A rewarding stop for art lovers curious about America’s rural imagination, the Sheldon Museum of Art in Lincoln pairs a strong university-museum spirit with a thoughtfully presented collection. Expect a focused, easy-to-navigate visit where modern and contemporary works meet regional perspectives, with galleries that invite close looking rather than overwhelm. It’s an excellent choice for travelers who enjoy discovering smartly curated exhibitions, learning through labels and programming, and experiencing an art museum that feels both accessible and intellectually engaged.",
      "content_description": "**Sheldon Museum of Art** in Lincoln offers an art-focused experience that feels tailor-made for travelers who like museums that are **well-curated, approachable, and idea-driven**. As a university-affiliated museum, Sheldon leans into interpretation—clear wall texts, thematic exhibition design, and programs that connect art history to contemporary questions. Rather than trying to be encyclopedic, the museum’s strength is in presenting artworks in ways that sharpen your eye for *composition*, *material*, and *meaning*, making it a satisfying visit even if you have only an hour or two.\n\nInside the galleries, you’ll typically encounter a **modest but meaningful range of modern and contemporary art**, often complemented by rotating exhibitions that spotlight specific themes, artists, or regional contexts. The curatorial approach tends to be **competent and focused**, favoring exhibitions that encourage comparison—how artists respond to landscape, identity, labor, and the built environment—topics that resonate in Nebraska while remaining broadly relevant in American art.\n\nFor architecture and ambiance, Sheldon aims for a **quiet, gallery-forward environment**—the kind art enthusiasts appreciate when they want to study surfaces, brushwork, and scale without distraction. Plan to slow down: look for sightlines between rooms, carefully paced lighting, and the pleasure of seeing works at comfortable viewing distance. If you’re building a Lincoln itinerary, Sheldon is a strong anchor for an art day—especially for visitors who value thoughtful curation and a museum that rewards close looking.",
      "content_highlights": [
        "University-museum energy: thoughtful labels, learning-centered interpretation, and frequent educational programming",
        "Modern and contemporary emphasis presented through tightly curated, theme-driven exhibitions",
        "Rotating shows that connect art to regional experience—landscape, place, labor, and identity",
        "Quiet, gallery-first atmosphere that encourages close looking and unhurried viewing",
        "An accessible, time-friendly visit: satisfying for a quick stop, rewarding for longer, attentive viewing"
      ],
      "content_generated_at": "2026-01-25T02:44:38Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "overall_quality_score": 14,
      "eca_score": 2,
      "collection_based_strength": 2,
      "primary_art_focus": "Modern/Contemporary"
    },
    {
      "museum_id": "usa-ne-omaha-joslyn-art-museum",
      "country": "USA",
      "state_province": "Nebraska",
      "city": "Omaha",
      "museum_name": "Joslyn Art Museum",
      "alternate_names": null,
      "website": "http://www.joslyn.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "2200 Dodge Street",
      "address_line2": null,
      "postal_code": "68102",
      "latitude": 41.2604154,
      "longitude": -95.946024,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.joslyn.org/visit/visit-detail/",
      "tickets_url": "https://www.facebook.com/joslynartmuseum/",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 2,
      "collection_tier": 2,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 2,
      "modern_contemporary_strength": 3,
      "primary_art": "Modern/Contemporary",
      "historical_context_score": 3,
      "priority_score": 17,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The Joslyn Art Museum has a significant permanent collection with over 12,000 objects, contributing to a strong regional and thematic strength. While it houses a diverse array of art, including Western American Art, its reputation remains primarily local to regional, aligning with the prior assessments.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://www.joslyn.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=1 for Omaha; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T02:44:49Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 1,
      "phone": "4023423300",
      "is_scoreable": true,
      "content_summary": "In Omaha, the Joslyn Art Museum rewards art lovers with a big-city experience grounded in Midwestern breadth. Expect a compelling mix of European and American painting, strong holdings of prints and works on paper, and a notable emphasis on art of the American West and Native American traditions. The building itself is part of the draw—monumental and dignified—making a visit feel like stepping into a classic civic temple to art, then roaming galleries that balance crowd-pleasers with discoveries.",
      "content_description": "**Joslyn Art Museum** stands as one of the Midwest’s most memorable art stops—an institution where a serious, regionally rooted collection meets the atmosphere of a grand civic museum. For travelers planning an art-focused day in Omaha, it’s an easy place to linger: galleries are arranged for pleasurable wandering, with painting, sculpture, and a particularly rewarding concentration of works on paper that invite close looking at technique, line, and mood. The museum’s strengths often shine brightest in American art, including material connected to the broader story of the Great Plains and the American West, giving the visit a strong sense of place beyond a standard “highlights reel.”\n\nArchitecturally, **the museum’s monumental presence** is part of the experience. Its classic, formal design reads like a purpose-built sanctuary for looking—ideal for travelers who appreciate museums as artworks in their own right. Inside, the visitor rhythm is calm and contemplative: you can move from room to room comparing brushwork across periods, then slow down in print-focused spaces where *etching*, *lithography*, and other works on paper reward patient attention.\n\nPlan to visit with time to revisit a favorite gallery: the Joslyn’s best moments come when you return for a second look—whether it’s an American scene that suddenly feels more contemporary, or a delicate drawing that reveals its full complexity only after a few quiet minutes.",
      "content_highlights": [
        "Monumental, temple-like museum architecture that makes the building itself a destination",
        "Strong American art presence with regional resonance for the Great Plains and broader West",
        "Notable depth in prints and works on paper—ideal for visitors who love close, technical looking",
        "A balanced, art-lover-friendly gallery flow: big visual statements alongside intimate rooms",
        "A regional museum with ambitious scope—good for both first-time visitors and repeat deep dives"
      ],
      "content_generated_at": "2026-01-25T02:44:49Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "overall_quality_score": 11,
      "eca_score": 2,
      "collection_based_strength": 3,
      "primary_art_focus": "Modern/Contemporary"
    }
  ],
  "updated_at": "2026-01-25T02:44:49Z"
}
