{
  "state": "South Carolina",
  "state_code": "SC",
  "last_updated": "2026-01-16T20:07:00.778338+00:00Z",
  "museums": [
    {
      "museum_id": "usa-sc-unknown-columbia-museum-of-art",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "Columbia",
      "museum_name": "Columbia Museum of Art",
      "alternate_names": null,
      "website": "http://www.columbiamuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "1515 Main Street",
      "address_line2": null,
      "postal_code": "29201",
      "latitude": 34.00586,
      "longitude": -81.03566,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.columbiamuseum.org/visit",
      "tickets_url": "https://www.columbiamuseum.org/visit#layer-duo-252",
      "reservation_required": null,
      "accessibility_url": "http://www.columbiamuseum.org/visit/accessibility",
      "reputation": 2,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 3,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The museum is regional in significance and primarily serves the local community, indicated by its reputation score of 2. However, there is no specific evidence of the strengths of its collections or curatorial authority.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.columbiamuseum.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Columbia' from open data; MRD: computed city_tier=2 for Columbia; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:29:35Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "8037992810",
      "is_scoreable": true,
      "content_summary": "A cornerstone of South Carolina’s cultural life, the Columbia Museum of Art rewards art lovers with an engaging mix of European and American works, thoughtfully curated special exhibitions, and an intimate, easy-to-navigate gallery experience. Expect a strong regional perspective alongside bigger art-historical conversations—ideal for travelers who want substance without the sprawl of a mega-museum. With a lively downtown location and a calendar that often pairs art with talks and events, it’s a satisfying stop for both first-time visitors and repeat museumgoers.",
      "content_description": "**Columbia Museum of Art** is the kind of regional museum that surprises you: concentrated, carefully edited, and confident in its storytelling. Rather than overwhelming you with endless rooms, it offers a rewarding “close looking” experience—ideal for art enthusiasts who like to spend time with objects, labels, and curatorial context. Expect a core of European and American art—often spanning Old Master traditions through modern and contemporary work—anchored by rotating exhibitions that bring fresh themes and sharper focus to the permanent collection. For visitors, that means each trip can feel distinct, with new pairings, new scholarship, and new reasons to return.\n\nThe museum’s strengths lie in how it connects big art-history currents—think *portraiture*, *landscape*, and the evolution of *modernism*—to a regional setting and audience. The galleries tend to emphasize clarity and intimacy: you can move from room to room without losing the thread, and the scale invites comparison and discovery (a particular pleasure for travelers who want a meaningful museum visit in a manageable timeframe). Look out for interpretive materials and programming that deepen the visit—artist talks, family-friendly initiatives, and special events that often turn a museum stop into an evening plan.\n\nArchitecturally, **the building’s downtown presence** reinforces the museum’s role as a civic anchor: it feels like part of the city’s cultural fabric rather than a remote destination. For art-focused travelers, the experience is both polished and approachable—an excellent choice when you want strong exhibitions, a well-shaped collection, and the satisfaction of leaving with real visual memories, not just steps on a pedometer.",
      "content_highlights": [
        "A tightly curated mix of European and American art that encourages slow looking and easy navigation",
        "Rotating special exhibitions that regularly reshape the visit and spotlight new themes and artists",
        "Galleries designed for an intimate viewing experience—ideal for comparing styles, techniques, and periods",
        "A lively downtown cultural stop with events and programs that often complement exhibitions",
        "A strong regional museum perspective: big art-history ideas presented with local relevance and accessibility"
      ],
      "content_generated_at": "2026-01-25T03:29:35Z",
      "content_model": "gpt-5.2",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-unknown-culture-heritage-museums",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "York County",
      "museum_name": "Culture & Heritage Museums",
      "alternate_names": null,
      "website": "http://chmuseums.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "2714 CLEVELAND ST",
      "address_line2": null,
      "postal_code": "29047",
      "latitude": 33.55027,
      "longitude": -80.59255,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "History Museum",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://chmuseums.org/plan-your-visit-hb/",
      "tickets_url": "https://sales.chmuseums.org/calendar.aspx",
      "reservation_required": true,
      "accessibility_url": "https://chmuseums.org/accessibility/",
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://chmuseums.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted city 'York County' from page text; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:29:42Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'HISTORY MUSEUM' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 3,
      "phone": "8038972225",
      "is_scoreable": false,
      "content_summary": "The **Culture & Heritage Museums** in York County offer a captivating glimpse into the region's rich history across 14 beautiful acres of gardens. Visitors can explore a unique living collection and engage with informative wayside signs that illustrate the stories behind various historical sites. It's a perfect blend of nature and history, making it a must-visit destination for culture enthusiasts.",
      "content_description": "**Culture & Heritage Museums** invites you to step into the heart of York County’s storied past. Spanning 14 scenic acres, this history museum features a stunning collection of gardens, where visitors can meander through meticulously maintained paths and discover the natural splendor of the region. The gardens are not only a feast for the eyes but also serve as living history sites, each with wayside signs that share the fascinating stories of the land and its heritage. This immersive experience allows guests to connect with the environment while gaining insights into the preservation efforts that keep these stories alive.  \n\nInside the museum, you'll find an intriguing array of cultural exhibits that highlight the diverse history and traditions that have shaped York County. From artifacts that reflect early settlement life to displays showcasing the impact of industry and agriculture, every corner offers a unique narrative waiting to be uncovered. The architecture itself is a testament to the era it represents, featuring *colonial influences*, *Victorian touches*, and *modern adaptations* serving as backdrops to the rich collections. Whether you’re wandering through the lush gardens or exploring the diverse exhibits within the museum's walls, your visit promises an enriching journey through time—one that fosters a deep appreciation for both the cultural heritage and natural beauty of this remarkable region.",
      "content_highlights": [
        "14 acres of beautifully maintained gardens open to the public",
        "Informative wayside signs detailing historical significance",
        "Living collection that showcases local heritage efforts",
        "Diverse exhibits covering early settlement to industrial history",
        "Stunning architecture reflecting various historical styles"
      ],
      "content_generated_at": "2026-01-25T03:29:42Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-unknown-fort-mill-history-museum",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "FORT MILL",
      "museum_name": "Fort Mill History Museum",
      "alternate_names": null,
      "website": "http://www.fortmillhistorymuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "310 NORTH WHITE STREET",
      "address_line2": null,
      "postal_code": "29716",
      "latitude": 35.01204,
      "longitude": -80.94837,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "History Museum",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.fortmillhistorymuseum.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: DNS lookup failed for http://www.fortmillhistorymuseum.org; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:29:47Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'HISTORY MUSEUM' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 3,
      "phone": "8038023646",
      "is_scoreable": false,
      "content_summary": "Discover the rich tapestry of Fort Mill's history at the **Fort Mill History Museum**. Dive into interactive exhibits and immersive displays that bring the past to life, making it a must-visit for history buffs and curious travelers alike.",
      "content_description": "**Fort Mill History Museum** serves as a captivating gateway into the historical narrative of Fort Mill, South Carolina. Nestled amid picturesque surroundings, this museum takes visitors on a journey through the town’s storied past, from its rich textile roots to the pivotal role it played in the local Civil War developments. With a focus on preserving and sharing the town's heritage, the museum offers a collection of exhibits that engage all ages, ensuring that history doesn't just educate but inspires as well. Visitors are invited to explore artifacts, photographs, and documents that bring to life the stories of the people who shaped this vibrant community.  \n\nThe architectural charm of **Fort Mill History Museum** itself tells a story. Housed in a historic building that reflects the locality’s character, the museum intricately blends historical preservation with innovative exhibit design. With enlightening wayside signs throughout its 14 acres, the museum grounds encourage outdoor exploration, allowing guests to soak in the scenic beauty while learning about significant events and the preservation efforts undertaken by Historic Columbia. As you wander through and partake in interactive displays, a sense of community pride and connection to the past unfurls, making each visit not only educational but emotionally resonant.",
      "content_highlights": [
        "Interactive exhibits showcasing Fort Mill's textile industry",
        "Preserved artifacts from the local Civil War history",
        "Engaging wayside signs throughout the museum grounds",
        "Beautifully landscaped gardens open to the public",
        "Family-friendly activities that make history accessible"
      ],
      "content_generated_at": "2026-01-25T03:29:47Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-unknown-historic-columbia",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "Columbia",
      "museum_name": "Historic Columbia",
      "alternate_names": null,
      "website": "https://www.historiccolumbia.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "1616 Blanding St",
      "address_line2": null,
      "postal_code": "29201",
      "latitude": 34.01282,
      "longitude": -81.03087,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Historic Preservation",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": "https://ecom.roller.app/historiccolumbia/hc/en-us/home",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 3,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "https://www.historiccolumbia.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:29:55Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'HISTORIC PRESERVATION' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "8032527742",
      "is_scoreable": false,
      "content_summary": "Historic Columbia offers visitors a unique glimpse into the past with its beautifully curated gardens, rich history, and dedicated preservation efforts. Explore 14 acres of lush greenery and captivating wayside signs that weave together the stories of Columbia's heritage, making it an enriching stop for history enthusiasts and nature lovers alike.",
      "content_description": "**Historic Columbia** is not just a museum; it is a vibrant celebration of the city's history, culture, and natural beauty. Spread across 14 acres of meticulously maintained gardens, visitors can wander through scenic landscapes that tell the story of Columbia's evolution and community spirit. The gardens, which are free to the public seven days a week, offer a tranquil setting for reflection and education, highlighting the importance of historic preservation through various living collections. Each corner reveals a unique aspect of the area's heritage, and the informative wayside signs provide insightful context that enriches the visitor experience. Here, history isn't confined to walls; it flourishes in the outdoors.  *Explore the flora that has roots reaching back to the early settlers and enjoy the tranquil sound of water features harmonizing with the surrounding environment.*   As you stroll, look for the native plants that were essential to the local economy and cultural practices, highlighting the intrinsic link between nature and history.  *Engage with our educational initiatives that empower visitors with knowledge about preservation and the stories that form the backbone of our community's identity.*  **Historic Columbia**'s fusion of nature and heritage serves as a reminder of the importance of these spaces and their role in maintaining a connection with our past.  *The experience culminates in a deeper appreciation for the stories that have shaped this remarkable place.*",
      "content_highlights": [
        "14 acres of meticulously maintained gardens",
        "Informative wayside signs detailing local history",
        "Free entry for public to explore the grounds",
        "Unique living collections showcasing historical flora",
        "Educational initiatives focused on preservation and community heritage"
      ],
      "content_generated_at": "2026-01-25T03:29:55Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-unknown-south-carolina-historical-society-museum",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "CHARLESTON",
      "museum_name": "South Carolina Historical Society Museum",
      "alternate_names": null,
      "website": "https://schistory.org/museum/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "100 MEETING STREET",
      "address_line2": null,
      "postal_code": "29409",
      "latitude": 32.77724,
      "longitude": -79.93088,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "Historic Preservation",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 2,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: blocked by robots.txt; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:30:01Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'HISTORIC PRESERVATION' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 3,
      "phone": "8437233225",
      "is_scoreable": false,
      "content_summary": "The South Carolina Historical Society Museum in Charleston is a captivating destination for history lovers. With its stunning collections and tranquil gardens, it offers a vivid glimpse into South Carolina's rich heritage and preservation efforts, making it a must-visit for anyone exploring the state's past.",
      "content_description": "**The South Carolina Historical Society Museum** serves as a beacon of historical preservation in the charming city of Charleston. Nestled within 14 acres of beautifully maintained gardens, this museum invites visitors to embark on a journey through time, uncovering the storied past of America's Palmetto State. The grounds are adorned with wayside signs that illuminate key historical moments and the ongoing efforts to safeguard South Carolina's cultural legacy. This gentle blend of nature and history creates an experience that is both educational and serene.  \n\nThe museum's collection is captivating, featuring artifacts that span centuries of South Carolina's history. From colonial documents to modern memorabilia, each piece tells a story of the people and events that shaped the state. The architecture of the museum itself reflects the style of the eras it showcases, providing a visual feast that enhances the narrative of the exhibitions. Visitors can delve into various exhibits and appreciate the craftsmanship of the artifacts alongside the lush backdrop of gardens that change with the seasons. Exploring this unique space is not just about viewing history; it’s about feeling connected to it through its preservation efforts and the natural beauty surrounding you.",
      "content_highlights": [
        "Stunning 14 acres of gardens open to the public",
        "Informative wayside signs detailing preservation efforts",
        "Vast collection of historical artifacts spanning centuries",
        "Architectural beauty reflecting South Carolina's history",
        "Serene environment for relaxed exploration and learning"
      ],
      "content_generated_at": "2026-01-25T03:30:01Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-unknown-south-carolina-state-museum",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "Columbia",
      "museum_name": "South Carolina State Museum",
      "alternate_names": null,
      "website": "http://www.scmuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "10 a.m. - 5 p.m. South Carolina State Museum 301 Gervais Street",
      "address_line2": null,
      "postal_code": "29201",
      "latitude": 33.99715,
      "longitude": -81.04731,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "General Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.scmuseum.org/visit",
      "tickets_url": "http://www.scmuseum.org/visit/hours-admission",
      "reservation_required": null,
      "accessibility_url": "http://www.scmuseum.org/visit/accessibility",
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 3,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.scmuseum.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; City extraction: found 'Columbia' from open data; MRD: computed city_tier=2 for Columbia; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:30:10Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "8038984921",
      "is_scoreable": false,
      "content_summary": "The **South Carolina State Museum** is a cultural treasure trove located in Columbia, offering a captivating exploration of the state's history, art, and science. With its diverse collections and engaging exhibits, this museum provides a unique opportunity for visitors to discover the rich heritage and natural wonders of South Carolina all under one roof.",
      "content_description": "**South Carolina State Museum** stands as a beacon of heritage and learning, nestled in the heart of Columbia. Spanning **four floors** and featuring **art, history, natural history**, and **science exhibits**, this museum is the largest in the state, making it a must-visit destination for anyone looking to immerse themselves in the diverse narratives that shape South Carolina. From *Native American artifacts* to **historic artifacts** of the American Revolution, each exhibit offers a glimpse into the rich past of the Palmetto State. The museum's dedication to preserving and interpreting these stories makes it an important educational institution for residents and travelers alike.  Additionally, the stunning **restoration of the historic Columbia Mill** adds to the museum's charm and visual appeal.  Visitors can marvel at this architectural gem as they explore the collections within.  Beyond the exhibits, the museum also hosts special programs, workshops, and events that invite community engagement and enrich the visitor experience.  Whether you're interested in the region's *ecological diversity* or the vibrant *artistic movements* that have flourished here, there's something for everyone at the **South Carolina State Museum**.  Don't forget to take advantage of the beautifully landscaped **gardens spanning 14 acres**, offering serene spots for reflection and a chance to appreciate the natural beauty surrounding the museum.  A visit here is not just about viewing exhibits; it's an invitation to connect with the essence of South Carolina and its spirited past.  Experience history, immerse yourself in art, and find inspiration in the stories waiting to be discovered.  ",
      "content_highlights": [
        "Largest collection of historical artifacts in South Carolina",
        "Engaging science and natural history exhibits",
        "Restored historic Columbia Mill showcased within the museum",
        "14 acres of beautifully landscaped gardens",
        "Dynamic programs and community events throughout the year"
      ],
      "content_generated_at": "2026-01-25T03:30:10Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-unknown-sumter-county-gallery-of-art",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "Sumter",
      "museum_name": "Sumter County Gallery of Art",
      "alternate_names": null,
      "website": "https://sumtergallery.com/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "200 Hasel Street",
      "address_line2": null,
      "postal_code": "29150",
      "latitude": 33.92354,
      "longitude": -80.34451,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "History Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://sumtergallery.com/about/plan-a-visit",
      "tickets_url": "https://www.facebook.com/sumtergallery",
      "reservation_required": null,
      "accessibility_url": "https://sumtergallery.com/accessibility-statement",
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "https://sumtergallery.com",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:30:18Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'HISTORY MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "phone": "8037750908",
      "is_scoreable": false,
      "content_summary": "The **Sumter County Gallery of Art** is a hidden gem for history enthusiasts and art lovers alike. Nestled in Sumter, South Carolina, this museum presents a unique blend of local heritage and artistic expression, encouraging visitors to explore a thoughtfully curated collection that connects the past with the present.",
      "content_description": "**Sumter County Gallery of Art** invites visitors to embark on a captivating journey through time, showcasing the rich historical narrative of Sumter and its surrounding area. The gallery is not just a museum; it’s a bridge connecting the stories of diverse eras through stunning *artistic* installations and compelling exhibits. From regional artwork to historical artifacts, each piece has been thoughtfully selected to reflect the vibrant cultural tapestry of the region. The museum offers a space where visitors can discover the impact of local artists and historical figures on the broader canvas of South Carolina's art scene. Throughout the gallery, guests will find opportunities to engage with both contemporary and historical contexts, making each visit unique and enlightening.  Often rotating exhibitions ensure there’s always something new to discover, while wayside signs and informative placards deepen the learning experience.  The ambiance is inviting; taking a leisurely stroll through the exhibits offers a chance for reflection and inspiration, ideal for art aficionados and casual visitors alike.  Moreover, the gallery often hosts events such as workshops, talks, and community gatherings, fostering a friendly atmosphere where creativity flourishes.  Whether you are an art lover seeking fresh inspiration or a history buff hungry for local stories, the **Sumter County Gallery of Art** promises a rewarding experience that highlights the beauty of cultural heritage.  For an enriching afternoon, uncover the treasures of this charming locale and enjoy a moment of connection with the artistry that embodies Sumter’s soul.",
      "content_highlights": [
        "Diverse collection of local artwork reflecting regional history",
        "Engaging rotating exhibitions featuring contemporary artists",
        "Thoughtfully curated historical artifacts from Sumter County",
        "Interactive programs and community events that foster local engagement",
        "Beautiful setting that encourages exploration and reflection in the gallery"
      ],
      "content_generated_at": "2026-01-25T03:30:18Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-unknown-sumter-county-museum",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "SUMTER",
      "museum_name": "Sumter County Museum",
      "alternate_names": null,
      "website": "http://www.sumtercountymuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "122 NORTH WASHINGTON STREET P O BOX 1456",
      "address_line2": null,
      "postal_code": "29150",
      "latitude": 33.92354,
      "longitude": -80.34451,
      "place_id": null,
      "address_source": "museums_csv",
      "address_last_verified": "2026-01-16",
      "museum_type": "History Museum",
      "primary_domain": null,
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://www.sumtermuseum.org/visit/",
      "tickets_url": "https://www.facebook.com/SumterMuseum",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.sumtercountymuseum.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=3 for Unknown; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:30:26Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'HISTORY MUSEUM' CSV: coordinates from IRS 990 database CSV: physical address from IRS 990",
      "city_tier": 3,
      "phone": "8037750908",
      "is_scoreable": false,
      "content_summary": "The Sumter County Museum offers an immersive experience into the rich history and culture of Sumter, South Carolina. With engaging exhibits, beautiful gardens, and hands-on activities, this museum is a treasure trove for history enthusiasts and families alike, making it a must-visit on your next trip.",
      "content_description": "**Sumter County Museum** serves as a vibrant gateway into the heart of South Carolina's history. Nestled in a picturesque landscape, it stands out as a center of learning, exploration, and cultural heritage. Visitors will find themselves captivated by the museum's curated exhibits that highlight crucial aspects of local history, including the region's role in the Civil War, its agricultural roots, and the colorful narratives of its diverse inhabitants. The museum's layout encourages exploration, making it as much a journey through time as it is a collection of artifacts.  \n\nThe *architecture* of the museum itself is a blend of historical charm and modern design, providing a backdrop that complements the story it tells. With interactive exhibits, living history demonstrations, and special events, visitors will not only observe but also engage with the past. The museum's outdoor gardens—spanning 14 acres—add to the enchanting experience, allowing guests to stroll through lush paths and discover wayside signs that unravel the history of the land and its preservation efforts. Furthermore, the inclusion of community events fosters a sense of connection to Sumter, making each visit unique. Don't miss the chance to uncover the hidden gems of **Sumter County Museum**!  \n",
      "content_highlights": [
        "Engaging exhibits on local Civil War history",
        "Interactive experiences for families and children",
        "Beautifully landscaped gardens for serene exploration",
        "Focus on Sumter's agricultural heritage and local culture",
        "Hands-on activities that allow visitors to experience history live"
      ],
      "content_generated_at": "2026-01-25T03:30:26Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-charleston-gibbs-museum-of-art",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "Charleston",
      "museum_name": "Gibbs Museum of Art",
      "alternate_names": null,
      "website": "http://www.gibbesmuseum.org/",
      "status": null,
      "last_updated": "2026-01-15",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": null,
      "longitude": null,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": null,
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "http://www.gibbesmuseum.org/visit/",
      "tickets_url": "https://1742.blackbaudhosting.com/1742/tickets?tab=3&txobjid=1b87ef14-b89d-4a5c-803f-79124cc2bcd8",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 2,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://www.gibbesmuseum.org"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=2 for Charleston; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:30:33Z",
      "notes": null,
      "city_tier": 2,
      "is_scoreable": false,
      "content_summary": "The Gibbs Museum of Art is a treasure nestled in the heart of Charleston, showcasing unparalleled collections of American art. With a focus on both historic and contemporary pieces, visitors can immerse themselves in the vibrant artistic narrative of the region. Unique exhibits, combined with the serene gardens, make this museum a must-visit for anyone exploring Charleston.",
      "content_description": "**The Gibbs Museum of Art** represents a confluence of artistic expression and historical preservation, set amidst the charming backdrop of Charleston. Founded on the principles of cultivation and appreciation of American art, this museum houses a diverse collection that spans multiple centuries. Visitors will encounter stunning works that reflect the artistic evolution and cultural richness of the South, from traditional portraiture to innovative modern pieces that challenge perceptions and inspire dialogue. The curated collections include masterworks by renowned artists, American folk art, and pieces that highlight local Charleston narratives, making it a vital part of South Carolina's artistic heritage.  \n\nThe museum itself is an architectural gem that complements its collections beautifully. The historic building is surrounded by 14 acres of gardens, where winding paths lead you to breathtaking landscapes and tranquil spots for reflection. Visitors are encouraged to explore the outdoor installations and wayside signs that offer insights into both the art and the historical significance of this beautiful setting. Spend an afternoon leisurely wandering through galleries and gardens, immersing yourself in the stories behind the art and the environment that fostered such creativity. The **Gibbs Museum of Art** not only showcases art but invites individuals to engage with the history and natural beauty that Charleston offers.",
      "content_highlights": [
        "Diverse collections showcasing American art from various periods",
        "Beautifully landscaped 14-acre garden for relaxation and exploration",
        "Unique outdoor installations enhancing the visitor experience",
        "Opportunities to learn about the history of the region through art",
        "Engaging educational programs and exhibitions for all ages"
      ],
      "content_generated_at": "2026-01-25T03:30:33Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-charleston-halsey-institute-of-contemporary-art",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "Charleston",
      "museum_name": "Halsey Institute of Contemporary Art",
      "alternate_names": null,
      "website": "http://www.halsey.cofc.edu/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "161 CALHOUN STREET",
      "address_line2": null,
      "postal_code": "29401",
      "latitude": 32.7852453,
      "longitude": -79.9373708,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://halsey.charleston.edu/visit/",
      "tickets_url": "https://www.facebook.com/halseyinstitute/",
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 2,
      "collection_tier": 3,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 2,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 1,
      "modern_contemporary_strength": 1,
      "primary_art": "Modern/Contemporary",
      "historical_context_score": 2,
      "priority_score": 24,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The Halsey Institute is a non-collecting institution focused on contemporary art exhibitions, indicating a limited influence on scholarship and curatorial impact in the realm of permanent collections. It provides some local context through its programming but does not hold a meaningful permanent collection.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://www.halsey.cofc.edu",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=2 for Charleston; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:30:44Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "8439534422",
      "is_scoreable": true,
      "content_summary": "Charleston’s Halsey Institute of Contemporary Art is a must for art lovers who want to experience the city’s living creative pulse. Rather than a permanent collection, the Halsey shines through carefully curated, rotating exhibitions that spotlight contemporary artists and urgent ideas. Expect an intimate, gallery-forward visit—ideal for returning multiple times—where the emphasis is on discovery, conversation, and seeing what’s happening in contemporary art right now in the Lowcountry and beyond.",
      "content_description": "**Halsey Institute of Contemporary Art** offers a focused, contemporary counterpoint to Charleston’s historic streetscapes—a place where you come to see *now*, not a fixed canon. As a non-collecting institution, its strength is curatorial: a steady cadence of rotating exhibitions that can move from emerging voices to nationally recognized artists, often with thoughtful wall texts and programming that invite close looking. For travelers building an art itinerary, the Halsey is especially rewarding because every visit feels current—what’s on view changes, and with it the conversation around materials, images, and ideas.\n\nThe visitor experience is gallery-centered and deliberately uncluttered: you’ll spend your time with the work, not navigating crowds or encyclopedic displays. Expect to encounter contemporary practices across **painting, photography, video, installation, and conceptual approaches**, frequently framed in ways that resonate with Charleston’s cultural landscape without being limited by it. If you’re the kind of museumgoer who loves reading labels, attending talks, or catching an opening, this is a place that rewards curiosity.\n\nPlan to check the exhibition calendar before you go, then give yourself time to linger—contemporary art here often reveals itself through detail, process, and context. The Halsey is best experienced as a repeat stop: return on a later day (or a future trip) and you’ll find an entirely different show, effectively turning one museum into many.",
      "content_highlights": [
        "Rotating contemporary exhibitions (no permanent collection), so each visit offers new work and new ideas",
        "Curator-led, research-driven shows spanning painting, photography, video, and installation",
        "A strong “right now” complement to Charleston’s historic museums—ideal for travelers seeking contemporary perspectives",
        "Programming that deepens engagement: talks, openings, and interpretive materials (check current schedule)",
        "An intimate, gallery-first experience designed for slow looking and close attention to individual works"
      ],
      "content_generated_at": "2026-01-25T03:30:44Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "overall_quality_score": 6,
      "eca_score": 2,
      "collection_based_strength": 0,
      "primary_art_focus": "Modern/Contemporary"
    },
    {
      "museum_id": "usa-sc-columbia-south-carolina-confederate-relic-room-military-museum",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "Columbia",
      "museum_name": "South Carolina Confederate Relic Room & Military Museum",
      "alternate_names": null,
      "website": "http://crr.sc.gov/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 33.99715,
      "longitude": -81.04731,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "General Museum",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 3,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "official_website",
        "http://crr.sc.gov",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=2 for Columbia; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: Network error accessing http://crr.sc.gov: Network error for http://crr.sc.gov: <urlopen error [WinError 10061] No connection could be made bec; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:30:52Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'GENERAL MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "8037378095",
      "is_scoreable": false,
      "content_summary": "Discover the rich military heritage of South Carolina at the **Confederate Relic Room & Military Museum** in Columbia. With a unique collection of artifacts, uniforms, and memorabilia, this museum offers an immersive experience into the state's Civil War history, making it an invaluable stop for history buffs and curious travelers alike.",
      "content_description": "**The South Carolina Confederate Relic Room & Military Museum** is a treasure trove of military history located in the heart of Columbia. Established to honor South Carolina's military contributions, this museum houses a remarkable collection of artifacts from the American Civil War era to modern military conflicts. Visitors will find themselves enveloped in stories that highlight the bravery and sacrifice of South Carolinians through time. The museum's commitment to preserving and presenting these pieces makes it a vital proof of the state’s rich history.  \n\nAs you explore the museum, you'll encounter everything from authentic Confederate uniforms to battle flags and weapons, each telling a story of valor and commitment. The architecture of the museum itself is inviting, with spacious galleries designed to enhance the visitor experience, ensuring that exhibits are engaging and accessible. Interactive displays make it easier for guests to connect with the past, while well-curated narratives provide context for the artifacts at hand. \n\nIn addition to permanent exhibits, the museum hosts special events and educational programs, inviting visitors of all ages to deepen their understanding of military history. Whether you're a local, a history enthusiast, or a tourist looking for a unique glimpse into the past, the **Confederate Relic Room & Military Museum** is a must-visit destination that promises an enlightening experience you won't forget.",
      "content_highlights": [
        "Extensive collection of Civil War artifacts",
        "Authentic Confederate uniforms and military ephemera",
        "Interactive displays for a hands-on learning experience",
        "Educational programs and special exhibits",
        "Rich insights into South Carolina's military legacy"
      ],
      "content_generated_at": "2026-01-25T03:30:52Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-greenville-bob-jones-university-museum-and-gallery",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "Greenville",
      "museum_name": "Bob Jones University Museum and Gallery",
      "alternate_names": null,
      "website": "http://www.bjumg.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": null,
      "latitude": 34.87431,
      "longitude": -82.36733,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 2,
      "collection_tier": 2,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": 0,
      "modern_contemporary_strength": 0,
      "primary_art": "Modern/Contemporary",
      "historical_context_score": 2,
      "priority_score": 26,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The museum has a modest collection of sacred art mainly focusing on European Old Masters, which gives it some local context but does not significantly influence broader art historical scholarship. The museum's reputation is recognized regionally, but its historical context is limited to primarily local significance.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: no results; MRD: computed city_tier=2 for Greenville; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: blocked by robots.txt; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:31:03Z",
      "notes": "CSV: phone from IRS 990 database CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "phone": "8647701331",
      "is_scoreable": true,
      "content_summary": "Tucked inside Bob Jones University, the Bob Jones University Museum & Gallery is one of the Southeast’s most surprising stops for old-master painting and European devotional art. Its compact scale makes it easy to visit without fatigue, yet the galleries reward close looking with richly crafted Renaissance and Baroque works, luminous altarpiece imagery, and strong representation of 19th‑century academic and salon traditions. For art lovers in Greenville, it’s a focused, atmospheric museum experience with real aesthetic punch.",
      "content_description": "**Bob Jones University Museum & Gallery** offers an unexpectedly concentrated encounter with European art, especially painting and religious imagery, presented in a setting designed for careful, quiet looking. While not a sprawling encyclopedic institution, it excels as a **teaching museum**—the kind of place where you can stand close to a panel painting, trace the finesse of glazing in an oil work, and notice how artists orchestrate light, gesture, and symbolism. Expect strengths in *Renaissance* and *Baroque* sensibilities—dramatic contrasts, devotional intensity, and refined craftsmanship—alongside later European works that reflect *academic* polish and narrative clarity.\n\nThe museum’s appeal is also experiential: the galleries tend to be **intimate and legible**, so you can move chronologically and thematically without feeling rushed. For travelers, that means it pairs well with a day in Greenville—an energizing, art-forward stop that complements the city’s food and walkable downtown. Architecturally, you’re visiting a campus museum rather than a landmark “starchitect” building, but that works in its favor: the focus stays on the objects, with controlled lighting and a calm viewing rhythm.\n\nPlan to linger on the museum’s European painting and devotional objects, where composition, surface, and iconography invite slow reading. Even if you’re not a specialist in *Christian iconography*, the works offer a direct line into the visual language that shaped Western art for centuries—ideal for enthusiasts who enjoy connecting technique to meaning and leaving with a sharper eye.",
      "content_highlights": [
        "Compact European-focused galleries that reward close, unhurried looking",
        "Strong presence of Renaissance- and Baroque-inspired devotional imagery and old-master traditions",
        "Opportunities to study technique up close—glazing, chiaroscuro, and narrative composition",
        "A teaching-museum atmosphere: quiet, focused spaces suited to attentive viewing",
        "Easy to combine with a Greenville itinerary thanks to the museum’s manageable scale and campus setting"
      ],
      "content_generated_at": "2026-01-25T03:31:03Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "overall_quality_score": 4,
      "eca_score": 0,
      "collection_based_strength": 2
    },
    {
      "museum_id": "usa-sc-greenville-upcountry-history-museum",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "Greenville",
      "museum_name": "Upcountry History Museum",
      "alternate_names": null,
      "website": "http://www.upcountryhistory.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": "540 Buncombe Street",
      "address_line2": null,
      "postal_code": "29601",
      "latitude": 34.8571497,
      "longitude": -82.4029294,
      "place_id": null,
      "address_source": "official_website",
      "address_last_verified": "2026-01-15",
      "museum_type": "History Museum",
      "primary_domain": "History",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": "https://www.upcountryhistory.org/plan-your-visit/",
      "tickets_url": "https://www.upcountryhistory.org/plan-your-visit/",
      "reservation_required": null,
      "accessibility_url": "https://www.upcountryhistory.org/plan-your-visit/accessibility/",
      "reputation": null,
      "collection_tier": null,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 1,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": null,
      "priority_score": null,
      "scoring_version": null,
      "scored_by": null,
      "score_notes": null,
      "score_last_verified": null,
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://www.upcountryhistory.org",
        "museums_csv"
      ],
      "confidence": null,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=2 for Greenville; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: extracted full address from page text; Inferred primary_domain=History from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:31:10Z",
      "notes": "CSV: museum type 'HISTORY MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 2,
      "is_scoreable": false,
      "content_summary": "The Upcountry History Museum in Greenville offers a captivating journey through the rich history of the Upcountry region of South Carolina. With interactive exhibits and engaging storytelling, visitors can explore the cultural and historical narratives that have shaped this charming area. An essential stop for history enthusiasts and curious travelers alike.",
      "content_description": "The **Upcountry History Museum** is a treasure trove of South Carolina's heritage, artfully narrating the stories that have shaped the Upcountry region. Located at the heart of Greenville, this museum presents an inviting blend of interactive exhibits and well-preserved artifacts. Visitors step into a *dynamic space* where *history comes alive*, showcasing everything from the early Native American cultures to the modernization of the area in the 20th century. Each exhibit is crafted to not only inform but also to engage visitors, making history feel personal and immediate.\n\nThe architectural design of the museum itself is noteworthy, featuring **contemporary elements** that seamlessly harmonize with the historical context of its exhibits. As you wander through the thoughtfully curated galleries, you will encounter *immersive displays*, compelling narratives, and even digital interactive stations that invite you to delve deeper into the past. The **Upcountry History Museum** also offers a variety of community programs and temporary exhibitions, ensuring that there is always something new to learn and discover. Moreover, the museum's connection to Greenville provides insights into local traditions and stories that might otherwise be overlooked.\n\nWhether you're a local resident or a traveler passing through, a visit to the **Upcountry History Museum** guarantees a rich, educational experience that sparks a fascination with southern history and culture. Don't forget to participate in their events or tours, as they often feature guest speakers and demonstrations that enhance the historical narrative, allowing you to walk away with a deeper appreciation of the region's vibrant past.",
      "content_highlights": [
        "Interactive exhibits on local Native American history",
        "Unearth local stories through multimedia presentations",
        "Seasonal community events that celebrate Upcountry culture",
        "Access to educational programs for all ages",
        "Special exhibitions featuring Upcountry artists and historical events"
      ],
      "content_generated_at": "2026-01-25T03:31:10Z",
      "content_model": "gpt-4o-mini",
      "content_source": "openai"
    },
    {
      "museum_id": "usa-sc-myrtle-beach-franklin-g-burroughs-simeon-b-chapin-art-museum",
      "country": "USA",
      "state_province": "South Carolina",
      "city": "Myrtle Beach",
      "museum_name": "Franklin G. Burroughs-Simeon B. Chapin Art Museum",
      "alternate_names": null,
      "website": "http://www.walkerart.org/membership/h//www.myrtlebeachartmuseum.org/",
      "status": null,
      "last_updated": "2026-01-16",
      "street_address": null,
      "address_line2": null,
      "postal_code": "29577",
      "latitude": 33.6587436,
      "longitude": -78.9197731,
      "place_id": null,
      "address_source": null,
      "address_last_verified": null,
      "museum_type": "Art Museum",
      "primary_domain": "Art",
      "topics": null,
      "audience_focus": null,
      "open_hours_url": null,
      "tickets_url": null,
      "reservation_required": null,
      "accessibility_url": null,
      "reputation": 3,
      "collection_tier": 3,
      "time_needed": "Half day (2-4 hours)",
      "estimated_visit_minutes": null,
      "best_season": null,
      "nearby_museum_count": 0,
      "visit_priority_notes": null,
      "parking_notes": null,
      "public_transit_notes": null,
      "impressionist_strength": null,
      "modern_contemporary_strength": null,
      "primary_art": null,
      "historical_context_score": 1,
      "priority_score": null,
      "scoring_version": "phase2_v3_mrd2026",
      "scored_by": "gpt-4o-mini",
      "score_notes": "The museum has a modest collection that likely lacks the authority needed for higher scores. Its historical context score is limited as it primarily serves the local community, with minimal broader impact.",
      "score_last_verified": "2026-01-25",
      "data_sources": [
        "walker_reciprocal",
        "openstreetmap",
        "official_website",
        "http://www.walkerart.org/membership/h//www.myrtlebeachartmuseum.org",
        "museums_csv",
        "llm_scoring"
      ],
      "confidence": 3,
      "row_notes_internal": "Seeded from walker-reciprocal roster; needs enrichment.; Wikidata: no search results; Nominatim: matched 1 result; MRD: computed city_tier=3 for Myrtle Beach; MRD: inferred time_needed='Half day (2-4 hours)' from museum_type; Official site: fetched homepage; Official site: no applicable fields to fill; Inferred primary_domain=Art from name/type",
      "created_at": "2026-01-15",
      "updated_at": "2026-01-25T03:31:21Z",
      "notes": "CSV: museum type 'ART MUSEUM' CSV: coordinates from IRS 990 database",
      "city_tier": 3,
      "is_scoreable": true,
      "content_summary": "Tucked inside a handsome historic home near Myrtle Beach’s lively coastline, the Franklin G. Burroughs–Simeon B. Chapin Art Museum offers a refreshing, art-focused pause from the shore. Expect intimate galleries, thoughtfully curated rotating exhibitions, and a strong sense of place that highlights the region’s creative life. With its approachable scale and welcoming atmosphere, it’s an easy, rewarding stop for travelers who like to see what artists are making—and collecting—beyond the big-city museum circuit.",
      "content_description": "Set in a charming historic residence, the **Franklin G. Burroughs–Simeon B. Chapin Art Museum** delivers a museum visit that feels personal rather than overwhelming—ideal for art lovers who prefer close looking and quiet discovery. The house-like setting gives the galleries a lived-in warmth, and the museum’s local reputation works to your advantage: you’ll often have space to slow down, read labels, and spend real time with individual works rather than rushing through a blockbuster crowd.\n\nBecause the museum’s collection is **modest**, the programming matters—and that’s where the experience shines. Expect **rotating exhibitions** that may range from regional painting and photography to contemporary craft and design, often spotlighting artists connected to South Carolina and the broader Southeast. This emphasis on changing shows keeps repeat visits worthwhile and offers a snapshot of evolving creative conversations, from *plein-air* coastal views to more experimental, contemporary approaches.\n\nArchitecturally, the museum’s residential scale creates an appealing contrast to Myrtle Beach’s resort energy: you’re stepping into a calmer, more contemplative environment. Plan for a focused visit—perfect as a morning cultural stop or a late-afternoon reset before dinner. For travelers building an arts itinerary along the Grand Strand, it’s a compact museum with genuine personality and a strong sense of local artistic context.",
      "content_highlights": [
        "Historic house setting that creates an intimate, close-looking gallery experience",
        "Rotating exhibitions that keep the visit fresh and encourage repeat stops",
        "Regional emphasis that helps you understand South Carolina and Southeast artistic culture",
        "Calm, crowd-free atmosphere—ideal for art lovers who enjoy reading labels and lingering",
        "Easy-to-pair cultural stop while exploring Myrtle Beach’s beaches, restaurants, and nearby neighborhoods"
      ],
      "content_generated_at": "2026-01-25T03:31:21Z",
      "content_model": "gpt-5.2",
      "content_source": "openai",
      "collection_based_strength": 2
    }
  ],
  "updated_at": "2026-01-25T03:31:21Z"
}
