{
  "search_query": "Chinese American Historical Museum (CAHM) Spring Valley museum",
  "found": true,
  "page_title": "Jewish history",
  "page_url": "https://en.wikipedia.org/wiki/Jewish_history",
  "extract": "Jews originated from the Israelites and Hebrews of historical Israel and Judah, two related kingdoms that emerged in the Levant during the Iron Age. The earliest mention of Israelites is inscribed on the Merneptah Stele c. 1213–1203 BCE; later religious literature tells the story of Israelites going back at least as far as c. 1500 BCE. Traditionally, the name Israel is said to originate with the Hebrew patriarch Jacob, who provides a narrative etiology for the name – after wrestling with an angel, Jacob is renamed Israel, meaning \"he who struggles with God\". The Kingdom of Israel based in Samaria fell to the Neo-Assyrian Empire c. 720 BCE, and the Kingdom of Judah to the Neo-Babylonian Empire in 586 BCE. Part of the Judean population was exiled to Babylon. The Assyrian and Babylonian captivities are regarded as representing the start of the Jewish diaspora. After the Achaemenid Empire conquered the region, the exiled Jews were allowed to return and rebuild the temple; these events mark the beginning of the Second Temple period. After several centuries of foreign rule, the Maccabean Revolt against the Seleucid Empire led to an independent Hasmonean kingdom, but it was gradually incorporated into the Roman imperial system. The Jewish–Roman wars, a series of unsuccessful revolts against the Romans in the 1st and 2nd centuries CE, resulted in the destruction of Jerusalem and the Second Temple, and the expulsion of many Jews. The Jewish population in Syria Palaestina gradually decreased during the following centuries, enhancing the role of the Jewish diaspora and shifting the spiritual and demographic centre from the depopulated Judea to Galilee and then to Babylon, with smaller communities spread out across the Roman Empire. During the same period, the Mishnah and the Talmud, central Jewish texts, were composed. In the following millennia, the diaspora communities coalesced into three major ethnic subdivisions according to where their ancestors settled: the Ashkenazim i...",
  "error": null,
  "fetched_at": "2026-01-24T20:22:52Z"
}
