{
  "search_query": "Museum of Design Atlanta Atlanta museum",
  "found": true,
  "page_title": "Hartsfield–Jackson Atlanta International Airport",
  "page_url": "https://en.wikipedia.org/wiki/Hartsfield%E2%80%93Jackson_Atlanta_International_Airport",
  "extract": "Hartsfield–Jackson Atlanta International Airport (IATA: ATL, ICAO: KATL, FAA LID: ATL) is the primary international airport serving Atlanta and its surrounding metropolitan area in the U.S. state of Georgia. Located 10 mi (16 km; 8.7 nmi) south of the Downtown Atlanta district, it is named after former Atlanta mayors William B. Hartsfield and Maynard Jackson. Since 1998, Hartsfield–Jackson has been the world's busiest airport by passenger traffic, except 2020, when its passenger traffic dipped for that year due to travel restrictions resulting from the COVID-19 pandemic. In 2024, Hartsfield–Jackson served 108.1 million passengers, the most of any airport in the world. It is also the world's busiest airport by aircraft movements. Hartsfield–Jackson is the primary hub of Delta Air Lines, and it is home to the airline's corporate headquarters. With just over 1,000 flights a day to 225 domestic and international destinations, the Delta hub is the world's largest airline hub, and it is considered the first mega-hub in America. Additionally, Hartsfield–Jackson is the home of Delta's Technical Operations Center, which is the airline's primary maintenance, repair and overhaul arm. Aside from Delta, Hartsfield–Jackson is also an operating base for low-cost carriers Frontier Airlines, Southwest Airlines, and Spirit Airlines. The airport offers international service to North America, Latin America, Europe, Africa, the Middle East, and East Asia. Hartsfield–Jackson is mostly in unincorporated areas of Clayton County, but it spills into Fulton County with a portion of the airport within the city limits of Atlanta following an annexation by the city in 1960 as well as portions within College Park and Hapeville. Its domestic terminal is served by MARTA's Red and Gold rail lines. Hartsfield–Jackson covers 4,700 acres (7.3 sq mi; 19 km2) of land and has five parallel runways which are aligned in an east–west direction. There are three runways that are 9,000 feet (2,743 m) long, one ...",
  "error": null,
  "fetched_at": "2026-01-24T20:27:36Z"
}
