{
  "search_query": "San Diego Museum of Art San Diego museum",
  "found": true,
  "page_title": "San Diego–Tijuana",
  "page_url": "https://en.wikipedia.org/wiki/San_Diego%E2%80%93Tijuana",
  "extract": "San Diego–Tijuana is an international transborder agglomeration, straddling the border of the adjacent North American coastal cities of San Diego, California, United States, and Tijuana, Baja California, Mexico. The 2020 population of the region was 5,456,577, making it the largest bi-national conurbation shared between the United States and Mexico, and the second-largest shared between the US and another country. The conurbation consists of San Diego County, (2020 population 3,298,634) in the United States and the municipalities of Tijuana (2020 pop. 1,922,523), Rosarito Beach (126,980), and Tecate (108,440) in Mexico. It is the third-most populous region in the California–Baja California region, smaller only than the metropolitan areas of Greater Los Angeles and the San Francisco Bay Area. San Diego–Tijuana traces its European roots to 1542, when the land was explored by Portuguese explorers on behalf of the Spanish Empire. In 1601, it was mandated by the Spanish viceroy in Mexico City that safe ports be found, one of which would be San Diego Bay, for ships of the Manila galleon. During this mission, explorer Sebastián Vizcaíno was also told to map the California coast in great detail, leading to the further exploration of the modern-day site of San Diego–Tijuana. Since 2010, statewide droughts in California and in northern Mexico have further strained the San Diego–Tijuana binational region's water security. The metropolitan region is host to 13 consulates for several countries. Over fifty million people cross the border each year between San Diego and Tijuana; it is the busiest land-border crossing in the Western Hemisphere. Since the implementation of the North American Free Trade Agreement (NAFTA) in 1994, San Diego–Tijuana has become a dominant commercial center in the United States and Mexico. The economic success of globalization has allowed San Diego–Tijuana to grow to the third richest region in the former Californias region, with a GDP of $136.3 billion ...",
  "error": null,
  "fetched_at": "2026-01-17T22:59:42Z"
}
