{
  "search_query": "Frick Collection New York museum",
  "found": true,
  "page_title": "Frick Collection",
  "page_url": "https://en.wikipedia.org/wiki/Frick_Collection",
  "extract": "The Frick Collection (colloquially known as the Frick) is an art museum on the Upper East Side of Manhattan in New York City. It was established in 1935 to preserve the collection of the industrialist Henry Clay Frick. The collection consists of 14th- to 19th-century European paintings, as well as other pieces of European fine and decorative art. It is located at the Henry Clay Frick House, a Beaux-Arts mansion designed for Henry Clay Frick. The Frick also houses the Frick Art Research Library, an art history research center established by Frick's daughter Helen Clay Frick in 1920, which contains sales catalogs, books, periodicals, and photographs. The museum dates to 1920, when the trustees of Frick's estate formed the Frick Collection Inc. to care for his art collection, which he had bequeathed for public use. After Frick's wife Adelaide Frick died in 1931, John Russell Pope converted the Frick House into a museum, which opened on December 16, 1935. The museum acquired additional works of art over the years, and it expanded the house in 1977 to accommodate increasing visitation. Following fundraising campaigns in the 2000s, a further expansion was announced in the 2010s. From 2021 until March 2024, during the renovation of the Frick House, the Frick Madison operated at 945 Madison Avenue. The Frick House reopened in April 2025. The Frick has about 1,500 pieces in its collection as of 2021. Artists with works in the collection include Bellini, Fragonard, Gainsborough, Goya, Holbein, Rembrandt, Titian, Turner, Velázquez, Vermeer, and Whistler. The museum has gradually acquired additional pieces over the years to supplement the paintings in Frick's original collection. In addition to its permanent collection, the museum has hosted small temporary exhibitions on narrowly defined topics, as well as academic symposiums, concerts, and classes. The Frick Collection typically has up to 300,000 visitors annually and has an endowment fund to support its programming. Commenta...",
  "error": null,
  "fetched_at": "2026-01-24T20:35:04Z"
}
