{
  "search_query": "Beth Sholom Synagogue Visitor Center Elkins Park museum",
  "found": true,
  "page_title": "Beth Sholom Synagogue (Elkins Park, Pennsylvania)",
  "page_url": "https://en.wikipedia.org/wiki/Beth_Sholom_Synagogue_(Elkins_Park,_Pennsylvania)",
  "extract": "Beth Sholom Synagogue is a Conservative Jewish synagogue at 8231 Old York Road in Elkins Park, a suburb of Philadelphia, Pennsylvania, United States. The main synagogue building, completed in 1959, was the only Jewish house of worship designed by Frank Lloyd Wright; it consists of a hexagonal base topped by a tetrahedron-shaped pyramidal roof. There is a doughnut-shaped annex south of the main building, designed by Israel Demchick and Thalheimer & Weitz, which is used as both a school and auditorium. Beth Sholom's congregation was established in 1919 and originally occupied a building at the intersection of Broad Street, Courtland Street, and Belfield Avenue, which was dedicated in 1921. Many members moved to Philadelphia's suburbs after World War II, prompting Beth Sholom's first senior rabbi, Mortimer J. Cohen, to buy land in Elkins Park in 1949. The annex opened in 1951, and Cohen hired Wright to design the Elkins Park synagogue two years later. Due to various delays and construction difficulties, the synagogue was not dedicated until September 20, 1959, after Wright died. Beth Sholom merged with the West Oak Lane Jewish Community Center in 1978 and Temple Sholom in 2004. Membership declined in the early 21st century, and a visitor center opened at Beth Sholom Synagogue in 2009. The main building is a National Historic Landmark and has a facade made of glass, steel, and reinforced concrete. The 100-foot-tall (30 m) roof is made of corrugated plastic and wire glass, suspended between three steel-and-concrete beams. The hexagonal interior measures 175 feet (53 m) wide, with furnishings designed by Wright. Two vestibules to the west lead to a main sanctuary on the second floor, with more than 1,000 seats. The main sanctuary's floor slopes down toward the center of the room, with seats facing a bimah in the east, while its ceiling slopes up toward the roof. The first floor of the synagogue contains the Sisterhood Sanctuary, and there are also two lounges and a mechan...",
  "error": null,
  "fetched_at": "2026-01-24T20:37:26Z"
}
