{
  "search_query": "Ulysses S. Grant Cottage State Historic Site Wilton museum",
  "found": true,
  "page_title": "Grant Cottage State Historic Site",
  "page_url": "https://en.wikipedia.org/wiki/Grant_Cottage_State_Historic_Site",
  "extract": "Grant Cottage State Historic Site is an Adirondack mountain cottage on the slope of Mount McGregor in the town of Moreau, New York. Ulysses S. Grant, the 18th President of the United States, died of throat cancer at the cottage on July 23, 1885. The house was maintained as a shrine to U.S. Grant following his death by the Mount McGregor Memorial Association and a series of live-in caretakers. The building became a New York State Historic Site in 1957 and was added to the National Register of Historic Places in 1971. The Historic Site was designated a National Historic Landmark by the National Park Service in 2021. The cottage was originally owned by Joseph William Drexel, a New York banker and friend of Grant, and Grant would spend the last six weeks of his life there. Author and publisher Mark Twain gave Grant a $25,000 advance to write his memoirs; Grant completed the manuscript just three days before he died. During the next two years, sales of the work netted his family nearly $450,000 in royalties, saving his widow, Julia, from destitution. For decades after his death, thousands of Civil War veterans made a pilgrimage to this shrine outside Saratoga Springs. Thousands more visit Mt. McGregor annually to see the original artifacts preserved at this historic site. Visitors can tour the historic house museum which has been furnished exactly as it was on the day Grant died. Some of the original floral arrangements from the funeral are on display, and the bed in which he died is shown in the parlor. Also in the parlor is the clock that was at the cottage, stopped at 8:08 am by General Grant's eldest son Frederick Dent Grant, who then reached over and touched his father's forehead for the last time. A marker is located outside the cottage on the spot where Grant had his last look of the valley; it had to be fenced off to stop visitors from chipping off pieces as souvenirs. A visitor center and gift shop are also located there. A plaque is located a short distance awa...",
  "error": null,
  "fetched_at": "2026-01-24T20:34:43Z"
}
