{
  "search_query": "Schack Art Center Everett museum",
  "found": true,
  "page_title": "Everett, Washington",
  "page_url": "https://en.wikipedia.org/wiki/Everett,_Washington",
  "extract": "Everett ( EV-er-it; Lushootseed: dᶻəɬigʷəd [d͜zəˈɬi̞ɡʷəd]) is the county seat of and the most populous city in Snohomish County, Washington, United States. It is 25 miles (40 km) north of Seattle and is one of the main cities in the metropolitan area and the Puget Sound region. Everett is the seventh-most populous city in the state, with 110,629 residents as of the 2020 census. The city is primarily situated on a peninsula at the mouth of the Snohomish River along Port Gardner Bay, an inlet of Possession Sound (itself part of Puget Sound), and extends to the south and west. The Port Gardner Peninsula has been inhabited by the Snohomish people for thousands of years, whose main settlement, hibulb, was located at Preston Point near the mouth of the river. Modern settlement in the area began with loggers and homesteaders arriving in the 1860s, but plans to build a city were not conceived until 1890. A consortium of East Coast investors seeking to build a major industrial city acquired land in the area and filed a plat for \"Everett\", which they named in honor of Everett Colby, the son of investor Charles L. Colby. The city was incorporated in 1893, shortly after the arrival of the Great Northern Railway, and prospered as a major lumber center with several large sawmills. Everett became the county seat in 1897 after a dispute with Snohomish contested over several elections and a Supreme Court case. The city was the site of labor unrest during the 1910s, which culminated in the Everett massacre in 1916 that killed several members of the Industrial Workers of the World. The area was connected by new interurban railways and highway bridges in the 1920s, transforming it into a major commercial hub, and gained an airport at Paine Field in 1936. The city's economy transitioned away from lumber and towards aerospace after World War II, with the construction of Boeing's aircraft assembly plant at Paine Field in 1967. Boeing's presence brought additional industrial and commercial...",
  "error": null,
  "fetched_at": "2026-01-24T20:40:23Z"
}
