{
  "search_query": "Museum of Contemporary Art Chicago museum",
  "found": true,
  "page_title": "Museum of Contemporary Art Chicago",
  "page_url": "https://en.wikipedia.org/wiki/Museum_of_Contemporary_Art_Chicago",
  "extract": "The Museum of Contemporary Art Chicago (MCA) is a contemporary art museum near Water Tower Place in the Near North Side community area of Chicago, Illinois, United States. The museum, which was established in 1967, is one of the world's largest contemporary art venues. The museum's collection is composed of thousands of objects of Post-World War II visual art. The museum is run gallery-style, with individually curated exhibitions throughout the year. Each exhibition may be composed of temporary loans, pieces from their permanent collection, or a combination of the two. The museum has hosted several notable debut exhibitions, including Frida Kahlo's first U.S. exhibition and Jeff Koons' first solo museum exhibition. Koons later presented an exhibit at the museum that broke the museum's attendance record. The current record for the most attended exhibition is the 2017 exhibition of Takashi Murakami's work. The museum's collection, which includes Jasper Johns, Andy Warhol, Cindy Sherman, Kara Walker, and Alexander Calder, contains historical samples of 1940s–1970s late surrealism, pop art, minimalism, and conceptual art; notable holdings also include 1980s postmodernism, as well as contemporary painting, sculpture, photography, video, installation, and related media. It also presents dance, theater, music, and multidisciplinary arts. The current location at 220 East Chicago Avenue is in the Streeterville neighborhood of the Near North Side community area. Josef Paul Kleihues designed the current building after the museum conducted a 12-month search, reviewing more than 200 nominations. The museum was initially located at 237 East Ontario Street, which was originally designed as a bakery. The current building is known for its signature staircase leading to an elevated ground floor, which has an atrium, the full glass-walled east and west façades giving a direct view of the city and Lake Michigan.",
  "error": null,
  "fetched_at": "2026-01-17T18:58:07Z"
}
