{
  "search_query": "Wenatchee Valley Museum and Cultural Center Wenatchee museum",
  "found": true,
  "page_title": "Wenatchee, Washington",
  "page_url": "https://en.wikipedia.org/wiki/Wenatchee,_Washington",
  "extract": "Wenatchee ( wen-ACH-ee) is the county seat of and the most populous city in Chelan County, Washington, United States. The population was 35,508 as of the 2020 census. The city lies at the confluence of the Columbia and Wenatchee rivers near the eastern foothills of the Cascade Range in north-central Washington. Wenatchee is on the west side of the Columbia River in Chelan County, across from the city of East Wenatchee in Douglas County. The city was named for the Wenatchi, a Native American tribe that inhabited the area around the confluence at the time of European-American contact. The name is a Sahaptin word that means \"river which comes [or whose source is] from canyons\" or \"robe of the rainbow\". Awenatchela means \"people at the source [of a river]\". The city of Wenatchee shares its name with the Wenatchee River, Lake Wenatchee and the Wenatchee National Forest. Wenatchee is the principal city of the Wenatchee–East Wenatchee, Washington Metropolitan Statistical Area, which encompasses all of Chelan and Douglas counties (total population around 110,884). However, the \"Wenatchee Valley Area\" generally refers to the land between Rocky Reach and Rock Island Dam on both banks of the Columbia River. Wenatchee is referred to as the \"Apple Capital of the World\" due to the valley's many orchards. The city is also sometimes referred to as the \"Buckle of the Power Belt of the Great Northwest\" which is a metaphor for the series of hydroelectric dams on the Columbia River. Rock Island Dam is located nearest to the middle of this \"belt\", and so was labeled the \"Buckle\". This saying is printed at the top of every issue of Wenatchee's newspaper, The Wenatchee World, but is no longer in common use elsewhere.",
  "error": null,
  "fetched_at": "2026-01-24T20:40:20Z"
}
