{
  "search_query": "Price Tower Arts Center Bartlesville museum",
  "found": true,
  "page_title": "Price Tower",
  "page_url": "https://en.wikipedia.org/wiki/Price_Tower",
  "extract": "The Price Tower is a nineteen-story, 221-foot-high (67 m) skyscraper at 510 South Dewey Avenue in Bartlesville, Oklahoma, United States. One of the few high-rises designed by Frank Lloyd Wright, the Price Tower is derived from a 1929 proposal for a group of apartment buildings in New York City. Harold C. Price Sr., the head of the pipeline-construction firm H. C. Price Company, commissioned the tower. The building was widely discussed when it was completed in 1956. It received the American Institute of Architects' Twenty-five Year Award in 1983 and has been designated a National Historic Landmark. The H. C. Price Company wanted to develop a modern headquarters in Bartlesville, and Harold Price hired Wright to design it in 1952. Groundbreaking took place on November 13, 1953, with a topping out ceremony in March 1955. The Price Tower opened on February 10, 1956, attracting thousands of sightseers. The Price Company sold the tower in 1981 to Phillips Petroleum, which occupied the tower's offices until the mid-1980s. Phillips donated the structure to the Price Tower Arts Center in 2001. The arts center subsequently converted part of the building into a museum, opening a boutique hotel and restaurant on the upper stories. The Price Tower was sold in 2023 and closed in 2024 following financial issues and legal disputes. It was resold in 2025 to McFarlin Building LLC, which began renovating it into a hotel and residential building that year As built, the Price Tower had about 42,000 square feet (3,900 m2) of rentable space, split across one residential and three office quadrants. The floor plan is laid out on a grid of parallelograms with 30-60-90 triangles, arranged around a pinwheel-shaped structural core with four piers. The facade includes embossed copper spandrels and louvers, tinted glass windows, and poured stucco surfaces. The reinforced-concrete floors are cantilevered outward from the structural core. Initially, the residential and office portions of the buildin...",
  "error": null,
  "fetched_at": "2026-01-17T18:13:43Z"
}
