{
  "search_query": "Heart Mountain Interpretive Center Powell museum",
  "found": true,
  "page_title": "Heart Mountain Relocation Center",
  "page_url": "https://en.wikipedia.org/wiki/Heart_Mountain_Relocation_Center",
  "extract": "The Heart Mountain War Relocation Center, named after nearby Heart Mountain and located midway between the northwest Wyoming towns of Cody and Powell, was one of ten concentration camps used for the internment of Japanese Americans evicted during World War II from their local communities (including their homes, businesses, and college residencies) in the West Coast Exclusion Zone by the executive order of President Franklin Roosevelt (after the bombing of Pearl Harbor in December 1941, upon the recommendation of Lieutenant General John L. DeWitt). This site was managed before the war by the federal Bureau of Reclamation as the would-be site of a major irrigation project. Construction of the camp's 650 military-style barracks and surrounding guard towers began in June 1942. The camp opened August 11, when the first Japanese Americans were shipped in by train from the internment program's \"assembly centers\" in Pomona, Santa Anita, and Portland. The camp would hold a total of 13,997 Japanese Americans over the next three years, with a peak population of 10,767, making it the third-largest \"town\" in Wyoming before its November 10, 1945, closure. Among the inmates, the notation \"心嶺山 (Shinreizan)\" was sometimes applied. Heart Mountain is perhaps best known for many of its younger residents challenging the controversial draft of Nisei males from camp in order to highlight the loss of their rights through the incarceration. The Heart Mountain Fair Play Committee, led by Frank Emi and several others, was particularly active in this resistance, encouraging internees to refuse U.S. military induction until they and their families were released from camp and their civil rights were restored. Heart Mountain had the highest rate of draft resistance of all ten camps, with 85 young men and seven Fair Play Committee leaders ultimately sentenced and imprisoned for Selective Service Act violations. (At the same time, 649 Japanese American men—volunteers and draftees—joined the America...",
  "error": null,
  "fetched_at": "2026-01-24T20:41:05Z"
}
