{
  "search_query": "Anchorage Museum Anchorage museum",
  "found": true,
  "page_title": "Anchorage, Alaska",
  "page_url": "https://en.wikipedia.org/wiki/Anchorage,_Alaska",
  "extract": "Anchorage, officially the Municipality of Anchorage, is the most populous city in the U.S. state of Alaska. With a population of 291,247 at the 2020 census, it contains nearly 40 percent of the state's population. The Anchorage metropolitan area, which includes Anchorage and the neighboring Matanuska-Susitna Borough, had a population of 398,328 in 2020, accounting for more than half the state's population. At 1,706 sq mi (4,420 km2) of land area, the city is the fourth-largest by area in the U.S. Anchorage is in Southcentral Alaska, at the terminus of the Cook Inlet, on a peninsula formed by the Knik Arm to the north and the Turnagain Arm to the south. First settled as a tent city near the mouth of Ship Creek in 1915 when construction on the Alaska Railroad began, Anchorage was incorporated as a city in November 1920. In September 1975, the City of Anchorage merged with the Greater Anchorage Area Borough, creating the Municipality of Anchorage. The municipal city limits span 1,961.1 sq mi (5,079.2 km2), encompassing the urban core, a joint military base, several outlying communities, and almost all of Chugach State Park. Because of this, less than 10 percent of the Municipality (or Muni) is populated, with the highest concentration of people in the 100 square-mile area that makes up the city proper, on a promontory at the headwaters of the inlet, commonly called Anchorage, the City of Anchorage, or the Anchorage Bowl. Due to its location, Anchorage is almost equidistant from New York City, Tokyo, and Murmansk, Russia (straight over the North Pole), Anchorage lies within 10 hours by air of nearly 90 percent of the inhabited global north. For this reason, Ted Stevens Anchorage International Airport is a common refueling stop for international cargo flights and home to a major FedEx hub, which the company calls a \"critical part\" of its global network of services. Anchorage has won the All-America City Award four times: in 1956, 1965, 1984–85, and 2002, from the Nationa...",
  "error": null,
  "fetched_at": "2026-01-17T22:59:23Z"
}
