{
  "search_query": "Foss Waterway Seaport Tacoma museum",
  "found": true,
  "page_title": "Tacoma, Washington",
  "page_url": "https://en.wikipedia.org/wiki/Tacoma,_Washington",
  "extract": "Tacoma ( tə-KOH-mə) is a city in and the county seat of Pierce County, Washington, United States. A port city, it is situated along the Puget Sound roughly 30 miles (48 km) from Seattle and Olympia, and 58 miles (93 km) northwest of Mount Rainier National Park. Tacoma is the second-largest city in the Puget Sound area and the third-most populous city in the state with a population of 219,346 at the 2020 census. Tacoma is the economic and cultural center of the South Sound region, which has a population of about 1 million. Tacoma adopted its name after the nearby Mount Rainier, called təˡqʷuʔbəʔ in the Puget Sound Salish dialect, and \"Takhoma\" in an anglicized version. It is locally known as the \"City of Destiny\" because the area was chosen to be the western terminus of the Northern Pacific Railroad in the late 19th century. The decision of the railroad was influenced by Tacoma's neighboring deep-water harbor, Commencement Bay. By connecting the bay with the railroad, Tacoma's motto became \"When rails meet sails\". Commencement Bay serves the Port of Tacoma, a center of international trade on the Pacific Coast and Washington's largest port. The city gained notoriety in 1940 for the collapse of the Tacoma Narrows Bridge, which earned the nickname \"Galloping Gertie\" due to the vertical movement of the deck during windy conditions. Like most industrial cities, Tacoma suffered a prolonged decline in the mid-20th century as a result of suburbanization and divestment. Since the 1990s, downtown Tacoma has experienced a period of revitalization. Developments in the downtown include the University of Washington Tacoma; the T Line (formerly Tacoma Link), the first modern electric light rail service in the state; the state's highest density of art and history museums; and a restored urban waterfront, the Thea Foss Waterway.",
  "error": null,
  "fetched_at": "2026-01-24T20:40:05Z"
}
